RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
/**
 * @file reg_stm32l4xx.h
 * @brief STM32L4xx Ultra-Low-Power ARM Cortex-M4 Peripheral Registers
 * @copyright Clean-room proprietary implementation. Zero GPL/Apache code.
 */

#ifndef REG_STM32L4XX_H
#define REG_STM32L4XX_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* STM32L4 Low Power Block 1 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_1_TypeDef;
#define L4_BLOCK_1 ((L4_BLOCK_1_TypeDef *)(0x40008000UL + 1 * 0x400UL))

#define L4_BLOCK_1_BIT_0 (1UL << 0)
#define L4_BLOCK_1_BIT_1 (1UL << 1)
#define L4_BLOCK_1_BIT_2 (1UL << 2)
#define L4_BLOCK_1_BIT_3 (1UL << 3)
#define L4_BLOCK_1_BIT_4 (1UL << 4)
#define L4_BLOCK_1_BIT_5 (1UL << 5)
#define L4_BLOCK_1_BIT_6 (1UL << 6)
#define L4_BLOCK_1_BIT_7 (1UL << 7)
#define L4_BLOCK_1_BIT_8 (1UL << 8)
#define L4_BLOCK_1_BIT_9 (1UL << 9)
#define L4_BLOCK_1_BIT_10 (1UL << 10)
#define L4_BLOCK_1_BIT_11 (1UL << 11)
#define L4_BLOCK_1_BIT_12 (1UL << 12)
#define L4_BLOCK_1_BIT_13 (1UL << 13)
#define L4_BLOCK_1_BIT_14 (1UL << 14)
#define L4_BLOCK_1_BIT_15 (1UL << 15)
#define L4_BLOCK_1_BIT_16 (1UL << 16)
#define L4_BLOCK_1_BIT_17 (1UL << 17)
#define L4_BLOCK_1_BIT_18 (1UL << 18)
#define L4_BLOCK_1_BIT_19 (1UL << 19)
#define L4_BLOCK_1_BIT_20 (1UL << 20)
#define L4_BLOCK_1_BIT_21 (1UL << 21)
#define L4_BLOCK_1_BIT_22 (1UL << 22)
#define L4_BLOCK_1_BIT_23 (1UL << 23)
#define L4_BLOCK_1_BIT_24 (1UL << 24)
#define L4_BLOCK_1_BIT_25 (1UL << 25)
#define L4_BLOCK_1_BIT_26 (1UL << 26)
#define L4_BLOCK_1_BIT_27 (1UL << 27)
#define L4_BLOCK_1_BIT_28 (1UL << 28)
#define L4_BLOCK_1_BIT_29 (1UL << 29)
#define L4_BLOCK_1_BIT_30 (1UL << 30)
#define L4_BLOCK_1_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 2 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_2_TypeDef;
#define L4_BLOCK_2 ((L4_BLOCK_2_TypeDef *)(0x40008000UL + 2 * 0x400UL))

#define L4_BLOCK_2_BIT_0 (1UL << 0)
#define L4_BLOCK_2_BIT_1 (1UL << 1)
#define L4_BLOCK_2_BIT_2 (1UL << 2)
#define L4_BLOCK_2_BIT_3 (1UL << 3)
#define L4_BLOCK_2_BIT_4 (1UL << 4)
#define L4_BLOCK_2_BIT_5 (1UL << 5)
#define L4_BLOCK_2_BIT_6 (1UL << 6)
#define L4_BLOCK_2_BIT_7 (1UL << 7)
#define L4_BLOCK_2_BIT_8 (1UL << 8)
#define L4_BLOCK_2_BIT_9 (1UL << 9)
#define L4_BLOCK_2_BIT_10 (1UL << 10)
#define L4_BLOCK_2_BIT_11 (1UL << 11)
#define L4_BLOCK_2_BIT_12 (1UL << 12)
#define L4_BLOCK_2_BIT_13 (1UL << 13)
#define L4_BLOCK_2_BIT_14 (1UL << 14)
#define L4_BLOCK_2_BIT_15 (1UL << 15)
#define L4_BLOCK_2_BIT_16 (1UL << 16)
#define L4_BLOCK_2_BIT_17 (1UL << 17)
#define L4_BLOCK_2_BIT_18 (1UL << 18)
#define L4_BLOCK_2_BIT_19 (1UL << 19)
#define L4_BLOCK_2_BIT_20 (1UL << 20)
#define L4_BLOCK_2_BIT_21 (1UL << 21)
#define L4_BLOCK_2_BIT_22 (1UL << 22)
#define L4_BLOCK_2_BIT_23 (1UL << 23)
#define L4_BLOCK_2_BIT_24 (1UL << 24)
#define L4_BLOCK_2_BIT_25 (1UL << 25)
#define L4_BLOCK_2_BIT_26 (1UL << 26)
#define L4_BLOCK_2_BIT_27 (1UL << 27)
#define L4_BLOCK_2_BIT_28 (1UL << 28)
#define L4_BLOCK_2_BIT_29 (1UL << 29)
#define L4_BLOCK_2_BIT_30 (1UL << 30)
#define L4_BLOCK_2_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 3 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_3_TypeDef;
#define L4_BLOCK_3 ((L4_BLOCK_3_TypeDef *)(0x40008000UL + 3 * 0x400UL))

#define L4_BLOCK_3_BIT_0 (1UL << 0)
#define L4_BLOCK_3_BIT_1 (1UL << 1)
#define L4_BLOCK_3_BIT_2 (1UL << 2)
#define L4_BLOCK_3_BIT_3 (1UL << 3)
#define L4_BLOCK_3_BIT_4 (1UL << 4)
#define L4_BLOCK_3_BIT_5 (1UL << 5)
#define L4_BLOCK_3_BIT_6 (1UL << 6)
#define L4_BLOCK_3_BIT_7 (1UL << 7)
#define L4_BLOCK_3_BIT_8 (1UL << 8)
#define L4_BLOCK_3_BIT_9 (1UL << 9)
#define L4_BLOCK_3_BIT_10 (1UL << 10)
#define L4_BLOCK_3_BIT_11 (1UL << 11)
#define L4_BLOCK_3_BIT_12 (1UL << 12)
#define L4_BLOCK_3_BIT_13 (1UL << 13)
#define L4_BLOCK_3_BIT_14 (1UL << 14)
#define L4_BLOCK_3_BIT_15 (1UL << 15)
#define L4_BLOCK_3_BIT_16 (1UL << 16)
#define L4_BLOCK_3_BIT_17 (1UL << 17)
#define L4_BLOCK_3_BIT_18 (1UL << 18)
#define L4_BLOCK_3_BIT_19 (1UL << 19)
#define L4_BLOCK_3_BIT_20 (1UL << 20)
#define L4_BLOCK_3_BIT_21 (1UL << 21)
#define L4_BLOCK_3_BIT_22 (1UL << 22)
#define L4_BLOCK_3_BIT_23 (1UL << 23)
#define L4_BLOCK_3_BIT_24 (1UL << 24)
#define L4_BLOCK_3_BIT_25 (1UL << 25)
#define L4_BLOCK_3_BIT_26 (1UL << 26)
#define L4_BLOCK_3_BIT_27 (1UL << 27)
#define L4_BLOCK_3_BIT_28 (1UL << 28)
#define L4_BLOCK_3_BIT_29 (1UL << 29)
#define L4_BLOCK_3_BIT_30 (1UL << 30)
#define L4_BLOCK_3_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 4 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_4_TypeDef;
#define L4_BLOCK_4 ((L4_BLOCK_4_TypeDef *)(0x40008000UL + 4 * 0x400UL))

#define L4_BLOCK_4_BIT_0 (1UL << 0)
#define L4_BLOCK_4_BIT_1 (1UL << 1)
#define L4_BLOCK_4_BIT_2 (1UL << 2)
#define L4_BLOCK_4_BIT_3 (1UL << 3)
#define L4_BLOCK_4_BIT_4 (1UL << 4)
#define L4_BLOCK_4_BIT_5 (1UL << 5)
#define L4_BLOCK_4_BIT_6 (1UL << 6)
#define L4_BLOCK_4_BIT_7 (1UL << 7)
#define L4_BLOCK_4_BIT_8 (1UL << 8)
#define L4_BLOCK_4_BIT_9 (1UL << 9)
#define L4_BLOCK_4_BIT_10 (1UL << 10)
#define L4_BLOCK_4_BIT_11 (1UL << 11)
#define L4_BLOCK_4_BIT_12 (1UL << 12)
#define L4_BLOCK_4_BIT_13 (1UL << 13)
#define L4_BLOCK_4_BIT_14 (1UL << 14)
#define L4_BLOCK_4_BIT_15 (1UL << 15)
#define L4_BLOCK_4_BIT_16 (1UL << 16)
#define L4_BLOCK_4_BIT_17 (1UL << 17)
#define L4_BLOCK_4_BIT_18 (1UL << 18)
#define L4_BLOCK_4_BIT_19 (1UL << 19)
#define L4_BLOCK_4_BIT_20 (1UL << 20)
#define L4_BLOCK_4_BIT_21 (1UL << 21)
#define L4_BLOCK_4_BIT_22 (1UL << 22)
#define L4_BLOCK_4_BIT_23 (1UL << 23)
#define L4_BLOCK_4_BIT_24 (1UL << 24)
#define L4_BLOCK_4_BIT_25 (1UL << 25)
#define L4_BLOCK_4_BIT_26 (1UL << 26)
#define L4_BLOCK_4_BIT_27 (1UL << 27)
#define L4_BLOCK_4_BIT_28 (1UL << 28)
#define L4_BLOCK_4_BIT_29 (1UL << 29)
#define L4_BLOCK_4_BIT_30 (1UL << 30)
#define L4_BLOCK_4_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 5 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_5_TypeDef;
#define L4_BLOCK_5 ((L4_BLOCK_5_TypeDef *)(0x40008000UL + 5 * 0x400UL))

#define L4_BLOCK_5_BIT_0 (1UL << 0)
#define L4_BLOCK_5_BIT_1 (1UL << 1)
#define L4_BLOCK_5_BIT_2 (1UL << 2)
#define L4_BLOCK_5_BIT_3 (1UL << 3)
#define L4_BLOCK_5_BIT_4 (1UL << 4)
#define L4_BLOCK_5_BIT_5 (1UL << 5)
#define L4_BLOCK_5_BIT_6 (1UL << 6)
#define L4_BLOCK_5_BIT_7 (1UL << 7)
#define L4_BLOCK_5_BIT_8 (1UL << 8)
#define L4_BLOCK_5_BIT_9 (1UL << 9)
#define L4_BLOCK_5_BIT_10 (1UL << 10)
#define L4_BLOCK_5_BIT_11 (1UL << 11)
#define L4_BLOCK_5_BIT_12 (1UL << 12)
#define L4_BLOCK_5_BIT_13 (1UL << 13)
#define L4_BLOCK_5_BIT_14 (1UL << 14)
#define L4_BLOCK_5_BIT_15 (1UL << 15)
#define L4_BLOCK_5_BIT_16 (1UL << 16)
#define L4_BLOCK_5_BIT_17 (1UL << 17)
#define L4_BLOCK_5_BIT_18 (1UL << 18)
#define L4_BLOCK_5_BIT_19 (1UL << 19)
#define L4_BLOCK_5_BIT_20 (1UL << 20)
#define L4_BLOCK_5_BIT_21 (1UL << 21)
#define L4_BLOCK_5_BIT_22 (1UL << 22)
#define L4_BLOCK_5_BIT_23 (1UL << 23)
#define L4_BLOCK_5_BIT_24 (1UL << 24)
#define L4_BLOCK_5_BIT_25 (1UL << 25)
#define L4_BLOCK_5_BIT_26 (1UL << 26)
#define L4_BLOCK_5_BIT_27 (1UL << 27)
#define L4_BLOCK_5_BIT_28 (1UL << 28)
#define L4_BLOCK_5_BIT_29 (1UL << 29)
#define L4_BLOCK_5_BIT_30 (1UL << 30)
#define L4_BLOCK_5_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 6 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_6_TypeDef;
#define L4_BLOCK_6 ((L4_BLOCK_6_TypeDef *)(0x40008000UL + 6 * 0x400UL))

#define L4_BLOCK_6_BIT_0 (1UL << 0)
#define L4_BLOCK_6_BIT_1 (1UL << 1)
#define L4_BLOCK_6_BIT_2 (1UL << 2)
#define L4_BLOCK_6_BIT_3 (1UL << 3)
#define L4_BLOCK_6_BIT_4 (1UL << 4)
#define L4_BLOCK_6_BIT_5 (1UL << 5)
#define L4_BLOCK_6_BIT_6 (1UL << 6)
#define L4_BLOCK_6_BIT_7 (1UL << 7)
#define L4_BLOCK_6_BIT_8 (1UL << 8)
#define L4_BLOCK_6_BIT_9 (1UL << 9)
#define L4_BLOCK_6_BIT_10 (1UL << 10)
#define L4_BLOCK_6_BIT_11 (1UL << 11)
#define L4_BLOCK_6_BIT_12 (1UL << 12)
#define L4_BLOCK_6_BIT_13 (1UL << 13)
#define L4_BLOCK_6_BIT_14 (1UL << 14)
#define L4_BLOCK_6_BIT_15 (1UL << 15)
#define L4_BLOCK_6_BIT_16 (1UL << 16)
#define L4_BLOCK_6_BIT_17 (1UL << 17)
#define L4_BLOCK_6_BIT_18 (1UL << 18)
#define L4_BLOCK_6_BIT_19 (1UL << 19)
#define L4_BLOCK_6_BIT_20 (1UL << 20)
#define L4_BLOCK_6_BIT_21 (1UL << 21)
#define L4_BLOCK_6_BIT_22 (1UL << 22)
#define L4_BLOCK_6_BIT_23 (1UL << 23)
#define L4_BLOCK_6_BIT_24 (1UL << 24)
#define L4_BLOCK_6_BIT_25 (1UL << 25)
#define L4_BLOCK_6_BIT_26 (1UL << 26)
#define L4_BLOCK_6_BIT_27 (1UL << 27)
#define L4_BLOCK_6_BIT_28 (1UL << 28)
#define L4_BLOCK_6_BIT_29 (1UL << 29)
#define L4_BLOCK_6_BIT_30 (1UL << 30)
#define L4_BLOCK_6_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 7 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_7_TypeDef;
#define L4_BLOCK_7 ((L4_BLOCK_7_TypeDef *)(0x40008000UL + 7 * 0x400UL))

#define L4_BLOCK_7_BIT_0 (1UL << 0)
#define L4_BLOCK_7_BIT_1 (1UL << 1)
#define L4_BLOCK_7_BIT_2 (1UL << 2)
#define L4_BLOCK_7_BIT_3 (1UL << 3)
#define L4_BLOCK_7_BIT_4 (1UL << 4)
#define L4_BLOCK_7_BIT_5 (1UL << 5)
#define L4_BLOCK_7_BIT_6 (1UL << 6)
#define L4_BLOCK_7_BIT_7 (1UL << 7)
#define L4_BLOCK_7_BIT_8 (1UL << 8)
#define L4_BLOCK_7_BIT_9 (1UL << 9)
#define L4_BLOCK_7_BIT_10 (1UL << 10)
#define L4_BLOCK_7_BIT_11 (1UL << 11)
#define L4_BLOCK_7_BIT_12 (1UL << 12)
#define L4_BLOCK_7_BIT_13 (1UL << 13)
#define L4_BLOCK_7_BIT_14 (1UL << 14)
#define L4_BLOCK_7_BIT_15 (1UL << 15)
#define L4_BLOCK_7_BIT_16 (1UL << 16)
#define L4_BLOCK_7_BIT_17 (1UL << 17)
#define L4_BLOCK_7_BIT_18 (1UL << 18)
#define L4_BLOCK_7_BIT_19 (1UL << 19)
#define L4_BLOCK_7_BIT_20 (1UL << 20)
#define L4_BLOCK_7_BIT_21 (1UL << 21)
#define L4_BLOCK_7_BIT_22 (1UL << 22)
#define L4_BLOCK_7_BIT_23 (1UL << 23)
#define L4_BLOCK_7_BIT_24 (1UL << 24)
#define L4_BLOCK_7_BIT_25 (1UL << 25)
#define L4_BLOCK_7_BIT_26 (1UL << 26)
#define L4_BLOCK_7_BIT_27 (1UL << 27)
#define L4_BLOCK_7_BIT_28 (1UL << 28)
#define L4_BLOCK_7_BIT_29 (1UL << 29)
#define L4_BLOCK_7_BIT_30 (1UL << 30)
#define L4_BLOCK_7_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 8 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_8_TypeDef;
#define L4_BLOCK_8 ((L4_BLOCK_8_TypeDef *)(0x40008000UL + 8 * 0x400UL))

#define L4_BLOCK_8_BIT_0 (1UL << 0)
#define L4_BLOCK_8_BIT_1 (1UL << 1)
#define L4_BLOCK_8_BIT_2 (1UL << 2)
#define L4_BLOCK_8_BIT_3 (1UL << 3)
#define L4_BLOCK_8_BIT_4 (1UL << 4)
#define L4_BLOCK_8_BIT_5 (1UL << 5)
#define L4_BLOCK_8_BIT_6 (1UL << 6)
#define L4_BLOCK_8_BIT_7 (1UL << 7)
#define L4_BLOCK_8_BIT_8 (1UL << 8)
#define L4_BLOCK_8_BIT_9 (1UL << 9)
#define L4_BLOCK_8_BIT_10 (1UL << 10)
#define L4_BLOCK_8_BIT_11 (1UL << 11)
#define L4_BLOCK_8_BIT_12 (1UL << 12)
#define L4_BLOCK_8_BIT_13 (1UL << 13)
#define L4_BLOCK_8_BIT_14 (1UL << 14)
#define L4_BLOCK_8_BIT_15 (1UL << 15)
#define L4_BLOCK_8_BIT_16 (1UL << 16)
#define L4_BLOCK_8_BIT_17 (1UL << 17)
#define L4_BLOCK_8_BIT_18 (1UL << 18)
#define L4_BLOCK_8_BIT_19 (1UL << 19)
#define L4_BLOCK_8_BIT_20 (1UL << 20)
#define L4_BLOCK_8_BIT_21 (1UL << 21)
#define L4_BLOCK_8_BIT_22 (1UL << 22)
#define L4_BLOCK_8_BIT_23 (1UL << 23)
#define L4_BLOCK_8_BIT_24 (1UL << 24)
#define L4_BLOCK_8_BIT_25 (1UL << 25)
#define L4_BLOCK_8_BIT_26 (1UL << 26)
#define L4_BLOCK_8_BIT_27 (1UL << 27)
#define L4_BLOCK_8_BIT_28 (1UL << 28)
#define L4_BLOCK_8_BIT_29 (1UL << 29)
#define L4_BLOCK_8_BIT_30 (1UL << 30)
#define L4_BLOCK_8_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 9 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_9_TypeDef;
#define L4_BLOCK_9 ((L4_BLOCK_9_TypeDef *)(0x40008000UL + 9 * 0x400UL))

#define L4_BLOCK_9_BIT_0 (1UL << 0)
#define L4_BLOCK_9_BIT_1 (1UL << 1)
#define L4_BLOCK_9_BIT_2 (1UL << 2)
#define L4_BLOCK_9_BIT_3 (1UL << 3)
#define L4_BLOCK_9_BIT_4 (1UL << 4)
#define L4_BLOCK_9_BIT_5 (1UL << 5)
#define L4_BLOCK_9_BIT_6 (1UL << 6)
#define L4_BLOCK_9_BIT_7 (1UL << 7)
#define L4_BLOCK_9_BIT_8 (1UL << 8)
#define L4_BLOCK_9_BIT_9 (1UL << 9)
#define L4_BLOCK_9_BIT_10 (1UL << 10)
#define L4_BLOCK_9_BIT_11 (1UL << 11)
#define L4_BLOCK_9_BIT_12 (1UL << 12)
#define L4_BLOCK_9_BIT_13 (1UL << 13)
#define L4_BLOCK_9_BIT_14 (1UL << 14)
#define L4_BLOCK_9_BIT_15 (1UL << 15)
#define L4_BLOCK_9_BIT_16 (1UL << 16)
#define L4_BLOCK_9_BIT_17 (1UL << 17)
#define L4_BLOCK_9_BIT_18 (1UL << 18)
#define L4_BLOCK_9_BIT_19 (1UL << 19)
#define L4_BLOCK_9_BIT_20 (1UL << 20)
#define L4_BLOCK_9_BIT_21 (1UL << 21)
#define L4_BLOCK_9_BIT_22 (1UL << 22)
#define L4_BLOCK_9_BIT_23 (1UL << 23)
#define L4_BLOCK_9_BIT_24 (1UL << 24)
#define L4_BLOCK_9_BIT_25 (1UL << 25)
#define L4_BLOCK_9_BIT_26 (1UL << 26)
#define L4_BLOCK_9_BIT_27 (1UL << 27)
#define L4_BLOCK_9_BIT_28 (1UL << 28)
#define L4_BLOCK_9_BIT_29 (1UL << 29)
#define L4_BLOCK_9_BIT_30 (1UL << 30)
#define L4_BLOCK_9_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 10 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_10_TypeDef;
#define L4_BLOCK_10 ((L4_BLOCK_10_TypeDef *)(0x40008000UL + 10 * 0x400UL))

#define L4_BLOCK_10_BIT_0 (1UL << 0)
#define L4_BLOCK_10_BIT_1 (1UL << 1)
#define L4_BLOCK_10_BIT_2 (1UL << 2)
#define L4_BLOCK_10_BIT_3 (1UL << 3)
#define L4_BLOCK_10_BIT_4 (1UL << 4)
#define L4_BLOCK_10_BIT_5 (1UL << 5)
#define L4_BLOCK_10_BIT_6 (1UL << 6)
#define L4_BLOCK_10_BIT_7 (1UL << 7)
#define L4_BLOCK_10_BIT_8 (1UL << 8)
#define L4_BLOCK_10_BIT_9 (1UL << 9)
#define L4_BLOCK_10_BIT_10 (1UL << 10)
#define L4_BLOCK_10_BIT_11 (1UL << 11)
#define L4_BLOCK_10_BIT_12 (1UL << 12)
#define L4_BLOCK_10_BIT_13 (1UL << 13)
#define L4_BLOCK_10_BIT_14 (1UL << 14)
#define L4_BLOCK_10_BIT_15 (1UL << 15)
#define L4_BLOCK_10_BIT_16 (1UL << 16)
#define L4_BLOCK_10_BIT_17 (1UL << 17)
#define L4_BLOCK_10_BIT_18 (1UL << 18)
#define L4_BLOCK_10_BIT_19 (1UL << 19)
#define L4_BLOCK_10_BIT_20 (1UL << 20)
#define L4_BLOCK_10_BIT_21 (1UL << 21)
#define L4_BLOCK_10_BIT_22 (1UL << 22)
#define L4_BLOCK_10_BIT_23 (1UL << 23)
#define L4_BLOCK_10_BIT_24 (1UL << 24)
#define L4_BLOCK_10_BIT_25 (1UL << 25)
#define L4_BLOCK_10_BIT_26 (1UL << 26)
#define L4_BLOCK_10_BIT_27 (1UL << 27)
#define L4_BLOCK_10_BIT_28 (1UL << 28)
#define L4_BLOCK_10_BIT_29 (1UL << 29)
#define L4_BLOCK_10_BIT_30 (1UL << 30)
#define L4_BLOCK_10_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 11 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_11_TypeDef;
#define L4_BLOCK_11 ((L4_BLOCK_11_TypeDef *)(0x40008000UL + 11 * 0x400UL))

#define L4_BLOCK_11_BIT_0 (1UL << 0)
#define L4_BLOCK_11_BIT_1 (1UL << 1)
#define L4_BLOCK_11_BIT_2 (1UL << 2)
#define L4_BLOCK_11_BIT_3 (1UL << 3)
#define L4_BLOCK_11_BIT_4 (1UL << 4)
#define L4_BLOCK_11_BIT_5 (1UL << 5)
#define L4_BLOCK_11_BIT_6 (1UL << 6)
#define L4_BLOCK_11_BIT_7 (1UL << 7)
#define L4_BLOCK_11_BIT_8 (1UL << 8)
#define L4_BLOCK_11_BIT_9 (1UL << 9)
#define L4_BLOCK_11_BIT_10 (1UL << 10)
#define L4_BLOCK_11_BIT_11 (1UL << 11)
#define L4_BLOCK_11_BIT_12 (1UL << 12)
#define L4_BLOCK_11_BIT_13 (1UL << 13)
#define L4_BLOCK_11_BIT_14 (1UL << 14)
#define L4_BLOCK_11_BIT_15 (1UL << 15)
#define L4_BLOCK_11_BIT_16 (1UL << 16)
#define L4_BLOCK_11_BIT_17 (1UL << 17)
#define L4_BLOCK_11_BIT_18 (1UL << 18)
#define L4_BLOCK_11_BIT_19 (1UL << 19)
#define L4_BLOCK_11_BIT_20 (1UL << 20)
#define L4_BLOCK_11_BIT_21 (1UL << 21)
#define L4_BLOCK_11_BIT_22 (1UL << 22)
#define L4_BLOCK_11_BIT_23 (1UL << 23)
#define L4_BLOCK_11_BIT_24 (1UL << 24)
#define L4_BLOCK_11_BIT_25 (1UL << 25)
#define L4_BLOCK_11_BIT_26 (1UL << 26)
#define L4_BLOCK_11_BIT_27 (1UL << 27)
#define L4_BLOCK_11_BIT_28 (1UL << 28)
#define L4_BLOCK_11_BIT_29 (1UL << 29)
#define L4_BLOCK_11_BIT_30 (1UL << 30)
#define L4_BLOCK_11_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 12 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_12_TypeDef;
#define L4_BLOCK_12 ((L4_BLOCK_12_TypeDef *)(0x40008000UL + 12 * 0x400UL))

#define L4_BLOCK_12_BIT_0 (1UL << 0)
#define L4_BLOCK_12_BIT_1 (1UL << 1)
#define L4_BLOCK_12_BIT_2 (1UL << 2)
#define L4_BLOCK_12_BIT_3 (1UL << 3)
#define L4_BLOCK_12_BIT_4 (1UL << 4)
#define L4_BLOCK_12_BIT_5 (1UL << 5)
#define L4_BLOCK_12_BIT_6 (1UL << 6)
#define L4_BLOCK_12_BIT_7 (1UL << 7)
#define L4_BLOCK_12_BIT_8 (1UL << 8)
#define L4_BLOCK_12_BIT_9 (1UL << 9)
#define L4_BLOCK_12_BIT_10 (1UL << 10)
#define L4_BLOCK_12_BIT_11 (1UL << 11)
#define L4_BLOCK_12_BIT_12 (1UL << 12)
#define L4_BLOCK_12_BIT_13 (1UL << 13)
#define L4_BLOCK_12_BIT_14 (1UL << 14)
#define L4_BLOCK_12_BIT_15 (1UL << 15)
#define L4_BLOCK_12_BIT_16 (1UL << 16)
#define L4_BLOCK_12_BIT_17 (1UL << 17)
#define L4_BLOCK_12_BIT_18 (1UL << 18)
#define L4_BLOCK_12_BIT_19 (1UL << 19)
#define L4_BLOCK_12_BIT_20 (1UL << 20)
#define L4_BLOCK_12_BIT_21 (1UL << 21)
#define L4_BLOCK_12_BIT_22 (1UL << 22)
#define L4_BLOCK_12_BIT_23 (1UL << 23)
#define L4_BLOCK_12_BIT_24 (1UL << 24)
#define L4_BLOCK_12_BIT_25 (1UL << 25)
#define L4_BLOCK_12_BIT_26 (1UL << 26)
#define L4_BLOCK_12_BIT_27 (1UL << 27)
#define L4_BLOCK_12_BIT_28 (1UL << 28)
#define L4_BLOCK_12_BIT_29 (1UL << 29)
#define L4_BLOCK_12_BIT_30 (1UL << 30)
#define L4_BLOCK_12_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 13 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_13_TypeDef;
#define L4_BLOCK_13 ((L4_BLOCK_13_TypeDef *)(0x40008000UL + 13 * 0x400UL))

