RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_13_BIT_0 (1UL << 0)
#define L4_BLOCK_13_BIT_1 (1UL << 1)
#define L4_BLOCK_13_BIT_2 (1UL << 2)
#define L4_BLOCK_13_BIT_3 (1UL << 3)
#define L4_BLOCK_13_BIT_4 (1UL << 4)
#define L4_BLOCK_13_BIT_5 (1UL << 5)
#define L4_BLOCK_13_BIT_6 (1UL << 6)
#define L4_BLOCK_13_BIT_7 (1UL << 7)
#define L4_BLOCK_13_BIT_8 (1UL << 8)
#define L4_BLOCK_13_BIT_9 (1UL << 9)
#define L4_BLOCK_13_BIT_10 (1UL << 10)
#define L4_BLOCK_13_BIT_11 (1UL << 11)
#define L4_BLOCK_13_BIT_12 (1UL << 12)
#define L4_BLOCK_13_BIT_13 (1UL << 13)
#define L4_BLOCK_13_BIT_14 (1UL << 14)
#define L4_BLOCK_13_BIT_15 (1UL << 15)
#define L4_BLOCK_13_BIT_16 (1UL << 16)
#define L4_BLOCK_13_BIT_17 (1UL << 17)
#define L4_BLOCK_13_BIT_18 (1UL << 18)
#define L4_BLOCK_13_BIT_19 (1UL << 19)
#define L4_BLOCK_13_BIT_20 (1UL << 20)
#define L4_BLOCK_13_BIT_21 (1UL << 21)
#define L4_BLOCK_13_BIT_22 (1UL << 22)
#define L4_BLOCK_13_BIT_23 (1UL << 23)
#define L4_BLOCK_13_BIT_24 (1UL << 24)
#define L4_BLOCK_13_BIT_25 (1UL << 25)
#define L4_BLOCK_13_BIT_26 (1UL << 26)
#define L4_BLOCK_13_BIT_27 (1UL << 27)
#define L4_BLOCK_13_BIT_28 (1UL << 28)
#define L4_BLOCK_13_BIT_29 (1UL << 29)
#define L4_BLOCK_13_BIT_30 (1UL << 30)
#define L4_BLOCK_13_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 14 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_14_TypeDef;
#define L4_BLOCK_14 ((L4_BLOCK_14_TypeDef *)(0x40008000UL + 14 * 0x400UL))

#define L4_BLOCK_14_BIT_0 (1UL << 0)
#define L4_BLOCK_14_BIT_1 (1UL << 1)
#define L4_BLOCK_14_BIT_2 (1UL << 2)
#define L4_BLOCK_14_BIT_3 (1UL << 3)
#define L4_BLOCK_14_BIT_4 (1UL << 4)
#define L4_BLOCK_14_BIT_5 (1UL << 5)
#define L4_BLOCK_14_BIT_6 (1UL << 6)
#define L4_BLOCK_14_BIT_7 (1UL << 7)
#define L4_BLOCK_14_BIT_8 (1UL << 8)
#define L4_BLOCK_14_BIT_9 (1UL << 9)
#define L4_BLOCK_14_BIT_10 (1UL << 10)
#define L4_BLOCK_14_BIT_11 (1UL << 11)
#define L4_BLOCK_14_BIT_12 (1UL << 12)
#define L4_BLOCK_14_BIT_13 (1UL << 13)
#define L4_BLOCK_14_BIT_14 (1UL << 14)
#define L4_BLOCK_14_BIT_15 (1UL << 15)
#define L4_BLOCK_14_BIT_16 (1UL << 16)
#define L4_BLOCK_14_BIT_17 (1UL << 17)
#define L4_BLOCK_14_BIT_18 (1UL << 18)
#define L4_BLOCK_14_BIT_19 (1UL << 19)
#define L4_BLOCK_14_BIT_20 (1UL << 20)
#define L4_BLOCK_14_BIT_21 (1UL << 21)
#define L4_BLOCK_14_BIT_22 (1UL << 22)
#define L4_BLOCK_14_BIT_23 (1UL << 23)
#define L4_BLOCK_14_BIT_24 (1UL << 24)
#define L4_BLOCK_14_BIT_25 (1UL << 25)
#define L4_BLOCK_14_BIT_26 (1UL << 26)
#define L4_BLOCK_14_BIT_27 (1UL << 27)
#define L4_BLOCK_14_BIT_28 (1UL << 28)
#define L4_BLOCK_14_BIT_29 (1UL << 29)
#define L4_BLOCK_14_BIT_30 (1UL << 30)
#define L4_BLOCK_14_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 15 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_15_TypeDef;
#define L4_BLOCK_15 ((L4_BLOCK_15_TypeDef *)(0x40008000UL + 15 * 0x400UL))

#define L4_BLOCK_15_BIT_0 (1UL << 0)
#define L4_BLOCK_15_BIT_1 (1UL << 1)
#define L4_BLOCK_15_BIT_2 (1UL << 2)
#define L4_BLOCK_15_BIT_3 (1UL << 3)
#define L4_BLOCK_15_BIT_4 (1UL << 4)
#define L4_BLOCK_15_BIT_5 (1UL << 5)
#define L4_BLOCK_15_BIT_6 (1UL << 6)
#define L4_BLOCK_15_BIT_7 (1UL << 7)
#define L4_BLOCK_15_BIT_8 (1UL << 8)
#define L4_BLOCK_15_BIT_9 (1UL << 9)
#define L4_BLOCK_15_BIT_10 (1UL << 10)
#define L4_BLOCK_15_BIT_11 (1UL << 11)
#define L4_BLOCK_15_BIT_12 (1UL << 12)
#define L4_BLOCK_15_BIT_13 (1UL << 13)
#define L4_BLOCK_15_BIT_14 (1UL << 14)
#define L4_BLOCK_15_BIT_15 (1UL << 15)
#define L4_BLOCK_15_BIT_16 (1UL << 16)
#define L4_BLOCK_15_BIT_17 (1UL << 17)
#define L4_BLOCK_15_BIT_18 (1UL << 18)
#define L4_BLOCK_15_BIT_19 (1UL << 19)
#define L4_BLOCK_15_BIT_20 (1UL << 20)
#define L4_BLOCK_15_BIT_21 (1UL << 21)
#define L4_BLOCK_15_BIT_22 (1UL << 22)
#define L4_BLOCK_15_BIT_23 (1UL << 23)
#define L4_BLOCK_15_BIT_24 (1UL << 24)
#define L4_BLOCK_15_BIT_25 (1UL << 25)
#define L4_BLOCK_15_BIT_26 (1UL << 26)
#define L4_BLOCK_15_BIT_27 (1UL << 27)
#define L4_BLOCK_15_BIT_28 (1UL << 28)
#define L4_BLOCK_15_BIT_29 (1UL << 29)
#define L4_BLOCK_15_BIT_30 (1UL << 30)
#define L4_BLOCK_15_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 16 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_16_TypeDef;
#define L4_BLOCK_16 ((L4_BLOCK_16_TypeDef *)(0x40008000UL + 16 * 0x400UL))

#define L4_BLOCK_16_BIT_0 (1UL << 0)
#define L4_BLOCK_16_BIT_1 (1UL << 1)
#define L4_BLOCK_16_BIT_2 (1UL << 2)
#define L4_BLOCK_16_BIT_3 (1UL << 3)
#define L4_BLOCK_16_BIT_4 (1UL << 4)
#define L4_BLOCK_16_BIT_5 (1UL << 5)
#define L4_BLOCK_16_BIT_6 (1UL << 6)
#define L4_BLOCK_16_BIT_7 (1UL << 7)
#define L4_BLOCK_16_BIT_8 (1UL << 8)
#define L4_BLOCK_16_BIT_9 (1UL << 9)
#define L4_BLOCK_16_BIT_10 (1UL << 10)
#define L4_BLOCK_16_BIT_11 (1UL << 11)
#define L4_BLOCK_16_BIT_12 (1UL << 12)
#define L4_BLOCK_16_BIT_13 (1UL << 13)
#define L4_BLOCK_16_BIT_14 (1UL << 14)
#define L4_BLOCK_16_BIT_15 (1UL << 15)
#define L4_BLOCK_16_BIT_16 (1UL << 16)
#define L4_BLOCK_16_BIT_17 (1UL << 17)
#define L4_BLOCK_16_BIT_18 (1UL << 18)
#define L4_BLOCK_16_BIT_19 (1UL << 19)
#define L4_BLOCK_16_BIT_20 (1UL << 20)
#define L4_BLOCK_16_BIT_21 (1UL << 21)
#define L4_BLOCK_16_BIT_22 (1UL << 22)
#define L4_BLOCK_16_BIT_23 (1UL << 23)
#define L4_BLOCK_16_BIT_24 (1UL << 24)
#define L4_BLOCK_16_BIT_25 (1UL << 25)
#define L4_BLOCK_16_BIT_26 (1UL << 26)
#define L4_BLOCK_16_BIT_27 (1UL << 27)
#define L4_BLOCK_16_BIT_28 (1UL << 28)
#define L4_BLOCK_16_BIT_29 (1UL << 29)
#define L4_BLOCK_16_BIT_30 (1UL << 30)
#define L4_BLOCK_16_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 17 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_17_TypeDef;
#define L4_BLOCK_17 ((L4_BLOCK_17_TypeDef *)(0x40008000UL + 17 * 0x400UL))

#define L4_BLOCK_17_BIT_0 (1UL << 0)
#define L4_BLOCK_17_BIT_1 (1UL << 1)
#define L4_BLOCK_17_BIT_2 (1UL << 2)
#define L4_BLOCK_17_BIT_3 (1UL << 3)
#define L4_BLOCK_17_BIT_4 (1UL << 4)
#define L4_BLOCK_17_BIT_5 (1UL << 5)
#define L4_BLOCK_17_BIT_6 (1UL << 6)
#define L4_BLOCK_17_BIT_7 (1UL << 7)
#define L4_BLOCK_17_BIT_8 (1UL << 8)
#define L4_BLOCK_17_BIT_9 (1UL << 9)
#define L4_BLOCK_17_BIT_10 (1UL << 10)
#define L4_BLOCK_17_BIT_11 (1UL << 11)
#define L4_BLOCK_17_BIT_12 (1UL << 12)
#define L4_BLOCK_17_BIT_13 (1UL << 13)
#define L4_BLOCK_17_BIT_14 (1UL << 14)
#define L4_BLOCK_17_BIT_15 (1UL << 15)
#define L4_BLOCK_17_BIT_16 (1UL << 16)
#define L4_BLOCK_17_BIT_17 (1UL << 17)
#define L4_BLOCK_17_BIT_18 (1UL << 18)
#define L4_BLOCK_17_BIT_19 (1UL << 19)
#define L4_BLOCK_17_BIT_20 (1UL << 20)
#define L4_BLOCK_17_BIT_21 (1UL << 21)
#define L4_BLOCK_17_BIT_22 (1UL << 22)
#define L4_BLOCK_17_BIT_23 (1UL << 23)
#define L4_BLOCK_17_BIT_24 (1UL << 24)
#define L4_BLOCK_17_BIT_25 (1UL << 25)
#define L4_BLOCK_17_BIT_26 (1UL << 26)
#define L4_BLOCK_17_BIT_27 (1UL << 27)
#define L4_BLOCK_17_BIT_28 (1UL << 28)
#define L4_BLOCK_17_BIT_29 (1UL << 29)
#define L4_BLOCK_17_BIT_30 (1UL << 30)
#define L4_BLOCK_17_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 18 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_18_TypeDef;
#define L4_BLOCK_18 ((L4_BLOCK_18_TypeDef *)(0x40008000UL + 18 * 0x400UL))

#define L4_BLOCK_18_BIT_0 (1UL << 0)
#define L4_BLOCK_18_BIT_1 (1UL << 1)
#define L4_BLOCK_18_BIT_2 (1UL << 2)
#define L4_BLOCK_18_BIT_3 (1UL << 3)
#define L4_BLOCK_18_BIT_4 (1UL << 4)
#define L4_BLOCK_18_BIT_5 (1UL << 5)
#define L4_BLOCK_18_BIT_6 (1UL << 6)
#define L4_BLOCK_18_BIT_7 (1UL << 7)
#define L4_BLOCK_18_BIT_8 (1UL << 8)
#define L4_BLOCK_18_BIT_9 (1UL << 9)
#define L4_BLOCK_18_BIT_10 (1UL << 10)
#define L4_BLOCK_18_BIT_11 (1UL << 11)
#define L4_BLOCK_18_BIT_12 (1UL << 12)
#define L4_BLOCK_18_BIT_13 (1UL << 13)
#define L4_BLOCK_18_BIT_14 (1UL << 14)
#define L4_BLOCK_18_BIT_15 (1UL << 15)
#define L4_BLOCK_18_BIT_16 (1UL << 16)
#define L4_BLOCK_18_BIT_17 (1UL << 17)
#define L4_BLOCK_18_BIT_18 (1UL << 18)
#define L4_BLOCK_18_BIT_19 (1UL << 19)
#define L4_BLOCK_18_BIT_20 (1UL << 20)
#define L4_BLOCK_18_BIT_21 (1UL << 21)
#define L4_BLOCK_18_BIT_22 (1UL << 22)
#define L4_BLOCK_18_BIT_23 (1UL << 23)
#define L4_BLOCK_18_BIT_24 (1UL << 24)
#define L4_BLOCK_18_BIT_25 (1UL << 25)
#define L4_BLOCK_18_BIT_26 (1UL << 26)
#define L4_BLOCK_18_BIT_27 (1UL << 27)
#define L4_BLOCK_18_BIT_28 (1UL << 28)
#define L4_BLOCK_18_BIT_29 (1UL << 29)
#define L4_BLOCK_18_BIT_30 (1UL << 30)
#define L4_BLOCK_18_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 19 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_19_TypeDef;
#define L4_BLOCK_19 ((L4_BLOCK_19_TypeDef *)(0x40008000UL + 19 * 0x400UL))

#define L4_BLOCK_19_BIT_0 (1UL << 0)
#define L4_BLOCK_19_BIT_1 (1UL << 1)
#define L4_BLOCK_19_BIT_2 (1UL << 2)
#define L4_BLOCK_19_BIT_3 (1UL << 3)
#define L4_BLOCK_19_BIT_4 (1UL << 4)
#define L4_BLOCK_19_BIT_5 (1UL << 5)
#define L4_BLOCK_19_BIT_6 (1UL << 6)
#define L4_BLOCK_19_BIT_7 (1UL << 7)
#define L4_BLOCK_19_BIT_8 (1UL << 8)
#define L4_BLOCK_19_BIT_9 (1UL << 9)
#define L4_BLOCK_19_BIT_10 (1UL << 10)
#define L4_BLOCK_19_BIT_11 (1UL << 11)
#define L4_BLOCK_19_BIT_12 (1UL << 12)
#define L4_BLOCK_19_BIT_13 (1UL << 13)
#define L4_BLOCK_19_BIT_14 (1UL << 14)
#define L4_BLOCK_19_BIT_15 (1UL << 15)
#define L4_BLOCK_19_BIT_16 (1UL << 16)
#define L4_BLOCK_19_BIT_17 (1UL << 17)
#define L4_BLOCK_19_BIT_18 (1UL << 18)
#define L4_BLOCK_19_BIT_19 (1UL << 19)
#define L4_BLOCK_19_BIT_20 (1UL << 20)
#define L4_BLOCK_19_BIT_21 (1UL << 21)
#define L4_BLOCK_19_BIT_22 (1UL << 22)
#define L4_BLOCK_19_BIT_23 (1UL << 23)
#define L4_BLOCK_19_BIT_24 (1UL << 24)
#define L4_BLOCK_19_BIT_25 (1UL << 25)
#define L4_BLOCK_19_BIT_26 (1UL << 26)
#define L4_BLOCK_19_BIT_27 (1UL << 27)
#define L4_BLOCK_19_BIT_28 (1UL << 28)
#define L4_BLOCK_19_BIT_29 (1UL << 29)
#define L4_BLOCK_19_BIT_30 (1UL << 30)
#define L4_BLOCK_19_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 20 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_20_TypeDef;
#define L4_BLOCK_20 ((L4_BLOCK_20_TypeDef *)(0x40008000UL + 20 * 0x400UL))

#define L4_BLOCK_20_BIT_0 (1UL << 0)
#define L4_BLOCK_20_BIT_1 (1UL << 1)
#define L4_BLOCK_20_BIT_2 (1UL << 2)
#define L4_BLOCK_20_BIT_3 (1UL << 3)
#define L4_BLOCK_20_BIT_4 (1UL << 4)
#define L4_BLOCK_20_BIT_5 (1UL << 5)
#define L4_BLOCK_20_BIT_6 (1UL << 6)
#define L4_BLOCK_20_BIT_7 (1UL << 7)
#define L4_BLOCK_20_BIT_8 (1UL << 8)
#define L4_BLOCK_20_BIT_9 (1UL << 9)
#define L4_BLOCK_20_BIT_10 (1UL << 10)
#define L4_BLOCK_20_BIT_11 (1UL << 11)
#define L4_BLOCK_20_BIT_12 (1UL << 12)
#define L4_BLOCK_20_BIT_13 (1UL << 13)
#define L4_BLOCK_20_BIT_14 (1UL << 14)
#define L4_BLOCK_20_BIT_15 (1UL << 15)
#define L4_BLOCK_20_BIT_16 (1UL << 16)
#define L4_BLOCK_20_BIT_17 (1UL << 17)
#define L4_BLOCK_20_BIT_18 (1UL << 18)
#define L4_BLOCK_20_BIT_19 (1UL << 19)
#define L4_BLOCK_20_BIT_20 (1UL << 20)
#define L4_BLOCK_20_BIT_21 (1UL << 21)
#define L4_BLOCK_20_BIT_22 (1UL << 22)
#define L4_BLOCK_20_BIT_23 (1UL << 23)
#define L4_BLOCK_20_BIT_24 (1UL << 24)
#define L4_BLOCK_20_BIT_25 (1UL << 25)
#define L4_BLOCK_20_BIT_26 (1UL << 26)
#define L4_BLOCK_20_BIT_27 (1UL << 27)
#define L4_BLOCK_20_BIT_28 (1UL << 28)
#define L4_BLOCK_20_BIT_29 (1UL << 29)
#define L4_BLOCK_20_BIT_30 (1UL << 30)
#define L4_BLOCK_20_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 21 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_21_TypeDef;
#define L4_BLOCK_21 ((L4_BLOCK_21_TypeDef *)(0x40008000UL + 21 * 0x400UL))

#define L4_BLOCK_21_BIT_0 (1UL << 0)
#define L4_BLOCK_21_BIT_1 (1UL << 1)
#define L4_BLOCK_21_BIT_2 (1UL << 2)
#define L4_BLOCK_21_BIT_3 (1UL << 3)
#define L4_BLOCK_21_BIT_4 (1UL << 4)
#define L4_BLOCK_21_BIT_5 (1UL << 5)
#define L4_BLOCK_21_BIT_6 (1UL << 6)
#define L4_BLOCK_21_BIT_7 (1UL << 7)
#define L4_BLOCK_21_BIT_8 (1UL << 8)
#define L4_BLOCK_21_BIT_9 (1UL << 9)
#define L4_BLOCK_21_BIT_10 (1UL << 10)
#define L4_BLOCK_21_BIT_11 (1UL << 11)
#define L4_BLOCK_21_BIT_12 (1UL << 12)
#define L4_BLOCK_21_BIT_13 (1UL << 13)
#define L4_BLOCK_21_BIT_14 (1UL << 14)
#define L4_BLOCK_21_BIT_15 (1UL << 15)
#define L4_BLOCK_21_BIT_16 (1UL << 16)
#define L4_BLOCK_21_BIT_17 (1UL << 17)
#define L4_BLOCK_21_BIT_18 (1UL << 18)
#define L4_BLOCK_21_BIT_19 (1UL << 19)
#define L4_BLOCK_21_BIT_20 (1UL << 20)
#define L4_BLOCK_21_BIT_21 (1UL << 21)
#define L4_BLOCK_21_BIT_22 (1UL << 22)
#define L4_BLOCK_21_BIT_23 (1UL << 23)
#define L4_BLOCK_21_BIT_24 (1UL << 24)
#define L4_BLOCK_21_BIT_25 (1UL << 25)
#define L4_BLOCK_21_BIT_26 (1UL << 26)
#define L4_BLOCK_21_BIT_27 (1UL << 27)
#define L4_BLOCK_21_BIT_28 (1UL << 28)
#define L4_BLOCK_21_BIT_29 (1UL << 29)
#define L4_BLOCK_21_BIT_30 (1UL << 30)
#define L4_BLOCK_21_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 22 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_22_TypeDef;
#define L4_BLOCK_22 ((L4_BLOCK_22_TypeDef *)(0x40008000UL + 22 * 0x400UL))

