RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_22_BIT_0 (1UL << 0)
#define L4_BLOCK_22_BIT_1 (1UL << 1)
#define L4_BLOCK_22_BIT_2 (1UL << 2)
#define L4_BLOCK_22_BIT_3 (1UL << 3)
#define L4_BLOCK_22_BIT_4 (1UL << 4)
#define L4_BLOCK_22_BIT_5 (1UL << 5)
#define L4_BLOCK_22_BIT_6 (1UL << 6)
#define L4_BLOCK_22_BIT_7 (1UL << 7)
#define L4_BLOCK_22_BIT_8 (1UL << 8)
#define L4_BLOCK_22_BIT_9 (1UL << 9)
#define L4_BLOCK_22_BIT_10 (1UL << 10)
#define L4_BLOCK_22_BIT_11 (1UL << 11)
#define L4_BLOCK_22_BIT_12 (1UL << 12)
#define L4_BLOCK_22_BIT_13 (1UL << 13)
#define L4_BLOCK_22_BIT_14 (1UL << 14)
#define L4_BLOCK_22_BIT_15 (1UL << 15)
#define L4_BLOCK_22_BIT_16 (1UL << 16)
#define L4_BLOCK_22_BIT_17 (1UL << 17)
#define L4_BLOCK_22_BIT_18 (1UL << 18)
#define L4_BLOCK_22_BIT_19 (1UL << 19)
#define L4_BLOCK_22_BIT_20 (1UL << 20)
#define L4_BLOCK_22_BIT_21 (1UL << 21)
#define L4_BLOCK_22_BIT_22 (1UL << 22)
#define L4_BLOCK_22_BIT_23 (1UL << 23)
#define L4_BLOCK_22_BIT_24 (1UL << 24)
#define L4_BLOCK_22_BIT_25 (1UL << 25)
#define L4_BLOCK_22_BIT_26 (1UL << 26)
#define L4_BLOCK_22_BIT_27 (1UL << 27)
#define L4_BLOCK_22_BIT_28 (1UL << 28)
#define L4_BLOCK_22_BIT_29 (1UL << 29)
#define L4_BLOCK_22_BIT_30 (1UL << 30)
#define L4_BLOCK_22_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 23 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_23_TypeDef;
#define L4_BLOCK_23 ((L4_BLOCK_23_TypeDef *)(0x40008000UL + 23 * 0x400UL))

#define L4_BLOCK_23_BIT_0 (1UL << 0)
#define L4_BLOCK_23_BIT_1 (1UL << 1)
#define L4_BLOCK_23_BIT_2 (1UL << 2)
#define L4_BLOCK_23_BIT_3 (1UL << 3)
#define L4_BLOCK_23_BIT_4 (1UL << 4)
#define L4_BLOCK_23_BIT_5 (1UL << 5)
#define L4_BLOCK_23_BIT_6 (1UL << 6)
#define L4_BLOCK_23_BIT_7 (1UL << 7)
#define L4_BLOCK_23_BIT_8 (1UL << 8)
#define L4_BLOCK_23_BIT_9 (1UL << 9)
#define L4_BLOCK_23_BIT_10 (1UL << 10)
#define L4_BLOCK_23_BIT_11 (1UL << 11)
#define L4_BLOCK_23_BIT_12 (1UL << 12)
#define L4_BLOCK_23_BIT_13 (1UL << 13)
#define L4_BLOCK_23_BIT_14 (1UL << 14)
#define L4_BLOCK_23_BIT_15 (1UL << 15)
#define L4_BLOCK_23_BIT_16 (1UL << 16)
#define L4_BLOCK_23_BIT_17 (1UL << 17)
#define L4_BLOCK_23_BIT_18 (1UL << 18)
#define L4_BLOCK_23_BIT_19 (1UL << 19)
#define L4_BLOCK_23_BIT_20 (1UL << 20)
#define L4_BLOCK_23_BIT_21 (1UL << 21)
#define L4_BLOCK_23_BIT_22 (1UL << 22)
#define L4_BLOCK_23_BIT_23 (1UL << 23)
#define L4_BLOCK_23_BIT_24 (1UL << 24)
#define L4_BLOCK_23_BIT_25 (1UL << 25)
#define L4_BLOCK_23_BIT_26 (1UL << 26)
#define L4_BLOCK_23_BIT_27 (1UL << 27)
#define L4_BLOCK_23_BIT_28 (1UL << 28)
#define L4_BLOCK_23_BIT_29 (1UL << 29)
#define L4_BLOCK_23_BIT_30 (1UL << 30)
#define L4_BLOCK_23_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 24 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_24_TypeDef;
#define L4_BLOCK_24 ((L4_BLOCK_24_TypeDef *)(0x40008000UL + 24 * 0x400UL))

#define L4_BLOCK_24_BIT_0 (1UL << 0)
#define L4_BLOCK_24_BIT_1 (1UL << 1)
#define L4_BLOCK_24_BIT_2 (1UL << 2)
#define L4_BLOCK_24_BIT_3 (1UL << 3)
#define L4_BLOCK_24_BIT_4 (1UL << 4)
#define L4_BLOCK_24_BIT_5 (1UL << 5)
#define L4_BLOCK_24_BIT_6 (1UL << 6)
#define L4_BLOCK_24_BIT_7 (1UL << 7)
#define L4_BLOCK_24_BIT_8 (1UL << 8)
#define L4_BLOCK_24_BIT_9 (1UL << 9)
#define L4_BLOCK_24_BIT_10 (1UL << 10)
#define L4_BLOCK_24_BIT_11 (1UL << 11)
#define L4_BLOCK_24_BIT_12 (1UL << 12)
#define L4_BLOCK_24_BIT_13 (1UL << 13)
#define L4_BLOCK_24_BIT_14 (1UL << 14)
#define L4_BLOCK_24_BIT_15 (1UL << 15)
#define L4_BLOCK_24_BIT_16 (1UL << 16)
#define L4_BLOCK_24_BIT_17 (1UL << 17)
#define L4_BLOCK_24_BIT_18 (1UL << 18)
#define L4_BLOCK_24_BIT_19 (1UL << 19)
#define L4_BLOCK_24_BIT_20 (1UL << 20)
#define L4_BLOCK_24_BIT_21 (1UL << 21)
#define L4_BLOCK_24_BIT_22 (1UL << 22)
#define L4_BLOCK_24_BIT_23 (1UL << 23)
#define L4_BLOCK_24_BIT_24 (1UL << 24)
#define L4_BLOCK_24_BIT_25 (1UL << 25)
#define L4_BLOCK_24_BIT_26 (1UL << 26)
#define L4_BLOCK_24_BIT_27 (1UL << 27)
#define L4_BLOCK_24_BIT_28 (1UL << 28)
#define L4_BLOCK_24_BIT_29 (1UL << 29)
#define L4_BLOCK_24_BIT_30 (1UL << 30)
#define L4_BLOCK_24_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 25 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_25_TypeDef;
#define L4_BLOCK_25 ((L4_BLOCK_25_TypeDef *)(0x40008000UL + 25 * 0x400UL))

#define L4_BLOCK_25_BIT_0 (1UL << 0)
#define L4_BLOCK_25_BIT_1 (1UL << 1)
#define L4_BLOCK_25_BIT_2 (1UL << 2)
#define L4_BLOCK_25_BIT_3 (1UL << 3)
#define L4_BLOCK_25_BIT_4 (1UL << 4)
#define L4_BLOCK_25_BIT_5 (1UL << 5)
#define L4_BLOCK_25_BIT_6 (1UL << 6)
#define L4_BLOCK_25_BIT_7 (1UL << 7)
#define L4_BLOCK_25_BIT_8 (1UL << 8)
#define L4_BLOCK_25_BIT_9 (1UL << 9)
#define L4_BLOCK_25_BIT_10 (1UL << 10)
#define L4_BLOCK_25_BIT_11 (1UL << 11)
#define L4_BLOCK_25_BIT_12 (1UL << 12)
#define L4_BLOCK_25_BIT_13 (1UL << 13)
#define L4_BLOCK_25_BIT_14 (1UL << 14)
#define L4_BLOCK_25_BIT_15 (1UL << 15)
#define L4_BLOCK_25_BIT_16 (1UL << 16)
#define L4_BLOCK_25_BIT_17 (1UL << 17)
#define L4_BLOCK_25_BIT_18 (1UL << 18)
#define L4_BLOCK_25_BIT_19 (1UL << 19)
#define L4_BLOCK_25_BIT_20 (1UL << 20)
#define L4_BLOCK_25_BIT_21 (1UL << 21)
#define L4_BLOCK_25_BIT_22 (1UL << 22)
#define L4_BLOCK_25_BIT_23 (1UL << 23)
#define L4_BLOCK_25_BIT_24 (1UL << 24)
#define L4_BLOCK_25_BIT_25 (1UL << 25)
#define L4_BLOCK_25_BIT_26 (1UL << 26)
#define L4_BLOCK_25_BIT_27 (1UL << 27)
#define L4_BLOCK_25_BIT_28 (1UL << 28)
#define L4_BLOCK_25_BIT_29 (1UL << 29)
#define L4_BLOCK_25_BIT_30 (1UL << 30)
#define L4_BLOCK_25_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 26 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_26_TypeDef;
#define L4_BLOCK_26 ((L4_BLOCK_26_TypeDef *)(0x40008000UL + 26 * 0x400UL))

#define L4_BLOCK_26_BIT_0 (1UL << 0)
#define L4_BLOCK_26_BIT_1 (1UL << 1)
#define L4_BLOCK_26_BIT_2 (1UL << 2)
#define L4_BLOCK_26_BIT_3 (1UL << 3)
#define L4_BLOCK_26_BIT_4 (1UL << 4)
#define L4_BLOCK_26_BIT_5 (1UL << 5)
#define L4_BLOCK_26_BIT_6 (1UL << 6)
#define L4_BLOCK_26_BIT_7 (1UL << 7)
#define L4_BLOCK_26_BIT_8 (1UL << 8)
#define L4_BLOCK_26_BIT_9 (1UL << 9)
#define L4_BLOCK_26_BIT_10 (1UL << 10)
#define L4_BLOCK_26_BIT_11 (1UL << 11)
#define L4_BLOCK_26_BIT_12 (1UL << 12)
#define L4_BLOCK_26_BIT_13 (1UL << 13)
#define L4_BLOCK_26_BIT_14 (1UL << 14)
#define L4_BLOCK_26_BIT_15 (1UL << 15)
#define L4_BLOCK_26_BIT_16 (1UL << 16)
#define L4_BLOCK_26_BIT_17 (1UL << 17)
#define L4_BLOCK_26_BIT_18 (1UL << 18)
#define L4_BLOCK_26_BIT_19 (1UL << 19)
#define L4_BLOCK_26_BIT_20 (1UL << 20)
#define L4_BLOCK_26_BIT_21 (1UL << 21)
#define L4_BLOCK_26_BIT_22 (1UL << 22)
#define L4_BLOCK_26_BIT_23 (1UL << 23)
#define L4_BLOCK_26_BIT_24 (1UL << 24)
#define L4_BLOCK_26_BIT_25 (1UL << 25)
#define L4_BLOCK_26_BIT_26 (1UL << 26)
#define L4_BLOCK_26_BIT_27 (1UL << 27)
#define L4_BLOCK_26_BIT_28 (1UL << 28)
#define L4_BLOCK_26_BIT_29 (1UL << 29)
#define L4_BLOCK_26_BIT_30 (1UL << 30)
#define L4_BLOCK_26_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 27 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_27_TypeDef;
#define L4_BLOCK_27 ((L4_BLOCK_27_TypeDef *)(0x40008000UL + 27 * 0x400UL))

#define L4_BLOCK_27_BIT_0 (1UL << 0)
#define L4_BLOCK_27_BIT_1 (1UL << 1)
#define L4_BLOCK_27_BIT_2 (1UL << 2)
#define L4_BLOCK_27_BIT_3 (1UL << 3)
#define L4_BLOCK_27_BIT_4 (1UL << 4)
#define L4_BLOCK_27_BIT_5 (1UL << 5)
#define L4_BLOCK_27_BIT_6 (1UL << 6)
#define L4_BLOCK_27_BIT_7 (1UL << 7)
#define L4_BLOCK_27_BIT_8 (1UL << 8)
#define L4_BLOCK_27_BIT_9 (1UL << 9)
#define L4_BLOCK_27_BIT_10 (1UL << 10)
#define L4_BLOCK_27_BIT_11 (1UL << 11)
#define L4_BLOCK_27_BIT_12 (1UL << 12)
#define L4_BLOCK_27_BIT_13 (1UL << 13)
#define L4_BLOCK_27_BIT_14 (1UL << 14)
#define L4_BLOCK_27_BIT_15 (1UL << 15)
#define L4_BLOCK_27_BIT_16 (1UL << 16)
#define L4_BLOCK_27_BIT_17 (1UL << 17)
#define L4_BLOCK_27_BIT_18 (1UL << 18)
#define L4_BLOCK_27_BIT_19 (1UL << 19)
#define L4_BLOCK_27_BIT_20 (1UL << 20)
#define L4_BLOCK_27_BIT_21 (1UL << 21)
#define L4_BLOCK_27_BIT_22 (1UL << 22)
#define L4_BLOCK_27_BIT_23 (1UL << 23)
#define L4_BLOCK_27_BIT_24 (1UL << 24)
#define L4_BLOCK_27_BIT_25 (1UL << 25)
#define L4_BLOCK_27_BIT_26 (1UL << 26)
#define L4_BLOCK_27_BIT_27 (1UL << 27)
#define L4_BLOCK_27_BIT_28 (1UL << 28)
#define L4_BLOCK_27_BIT_29 (1UL << 29)
#define L4_BLOCK_27_BIT_30 (1UL << 30)
#define L4_BLOCK_27_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 28 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_28_TypeDef;
#define L4_BLOCK_28 ((L4_BLOCK_28_TypeDef *)(0x40008000UL + 28 * 0x400UL))

#define L4_BLOCK_28_BIT_0 (1UL << 0)
#define L4_BLOCK_28_BIT_1 (1UL << 1)
#define L4_BLOCK_28_BIT_2 (1UL << 2)
#define L4_BLOCK_28_BIT_3 (1UL << 3)
#define L4_BLOCK_28_BIT_4 (1UL << 4)
#define L4_BLOCK_28_BIT_5 (1UL << 5)
#define L4_BLOCK_28_BIT_6 (1UL << 6)
#define L4_BLOCK_28_BIT_7 (1UL << 7)
#define L4_BLOCK_28_BIT_8 (1UL << 8)
#define L4_BLOCK_28_BIT_9 (1UL << 9)
#define L4_BLOCK_28_BIT_10 (1UL << 10)
#define L4_BLOCK_28_BIT_11 (1UL << 11)
#define L4_BLOCK_28_BIT_12 (1UL << 12)
#define L4_BLOCK_28_BIT_13 (1UL << 13)
#define L4_BLOCK_28_BIT_14 (1UL << 14)
#define L4_BLOCK_28_BIT_15 (1UL << 15)
#define L4_BLOCK_28_BIT_16 (1UL << 16)
#define L4_BLOCK_28_BIT_17 (1UL << 17)
#define L4_BLOCK_28_BIT_18 (1UL << 18)
#define L4_BLOCK_28_BIT_19 (1UL << 19)
#define L4_BLOCK_28_BIT_20 (1UL << 20)
#define L4_BLOCK_28_BIT_21 (1UL << 21)
#define L4_BLOCK_28_BIT_22 (1UL << 22)
#define L4_BLOCK_28_BIT_23 (1UL << 23)
#define L4_BLOCK_28_BIT_24 (1UL << 24)
#define L4_BLOCK_28_BIT_25 (1UL << 25)
#define L4_BLOCK_28_BIT_26 (1UL << 26)
#define L4_BLOCK_28_BIT_27 (1UL << 27)
#define L4_BLOCK_28_BIT_28 (1UL << 28)
#define L4_BLOCK_28_BIT_29 (1UL << 29)
#define L4_BLOCK_28_BIT_30 (1UL << 30)
#define L4_BLOCK_28_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 29 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_29_TypeDef;
#define L4_BLOCK_29 ((L4_BLOCK_29_TypeDef *)(0x40008000UL + 29 * 0x400UL))

#define L4_BLOCK_29_BIT_0 (1UL << 0)
#define L4_BLOCK_29_BIT_1 (1UL << 1)
#define L4_BLOCK_29_BIT_2 (1UL << 2)
#define L4_BLOCK_29_BIT_3 (1UL << 3)
#define L4_BLOCK_29_BIT_4 (1UL << 4)
#define L4_BLOCK_29_BIT_5 (1UL << 5)
#define L4_BLOCK_29_BIT_6 (1UL << 6)
#define L4_BLOCK_29_BIT_7 (1UL << 7)
#define L4_BLOCK_29_BIT_8 (1UL << 8)
#define L4_BLOCK_29_BIT_9 (1UL << 9)
#define L4_BLOCK_29_BIT_10 (1UL << 10)
#define L4_BLOCK_29_BIT_11 (1UL << 11)
#define L4_BLOCK_29_BIT_12 (1UL << 12)
#define L4_BLOCK_29_BIT_13 (1UL << 13)
#define L4_BLOCK_29_BIT_14 (1UL << 14)
#define L4_BLOCK_29_BIT_15 (1UL << 15)
#define L4_BLOCK_29_BIT_16 (1UL << 16)
#define L4_BLOCK_29_BIT_17 (1UL << 17)
#define L4_BLOCK_29_BIT_18 (1UL << 18)
#define L4_BLOCK_29_BIT_19 (1UL << 19)
#define L4_BLOCK_29_BIT_20 (1UL << 20)
#define L4_BLOCK_29_BIT_21 (1UL << 21)
#define L4_BLOCK_29_BIT_22 (1UL << 22)
#define L4_BLOCK_29_BIT_23 (1UL << 23)
#define L4_BLOCK_29_BIT_24 (1UL << 24)
#define L4_BLOCK_29_BIT_25 (1UL << 25)
#define L4_BLOCK_29_BIT_26 (1UL << 26)
#define L4_BLOCK_29_BIT_27 (1UL << 27)
#define L4_BLOCK_29_BIT_28 (1UL << 28)
#define L4_BLOCK_29_BIT_29 (1UL << 29)
#define L4_BLOCK_29_BIT_30 (1UL << 30)
#define L4_BLOCK_29_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 30 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_30_TypeDef;
#define L4_BLOCK_30 ((L4_BLOCK_30_TypeDef *)(0x40008000UL + 30 * 0x400UL))

#define L4_BLOCK_30_BIT_0 (1UL << 0)
#define L4_BLOCK_30_BIT_1 (1UL << 1)
#define L4_BLOCK_30_BIT_2 (1UL << 2)
#define L4_BLOCK_30_BIT_3 (1UL << 3)
#define L4_BLOCK_30_BIT_4 (1UL << 4)
#define L4_BLOCK_30_BIT_5 (1UL << 5)
#define L4_BLOCK_30_BIT_6 (1UL << 6)
#define L4_BLOCK_30_BIT_7 (1UL << 7)
#define L4_BLOCK_30_BIT_8 (1UL << 8)
#define L4_BLOCK_30_BIT_9 (1UL << 9)
#define L4_BLOCK_30_BIT_10 (1UL << 10)
#define L4_BLOCK_30_BIT_11 (1UL << 11)
#define L4_BLOCK_30_BIT_12 (1UL << 12)
#define L4_BLOCK_30_BIT_13 (1UL << 13)
#define L4_BLOCK_30_BIT_14 (1UL << 14)
#define L4_BLOCK_30_BIT_15 (1UL << 15)
#define L4_BLOCK_30_BIT_16 (1UL << 16)
#define L4_BLOCK_30_BIT_17 (1UL << 17)
#define L4_BLOCK_30_BIT_18 (1UL << 18)
#define L4_BLOCK_30_BIT_19 (1UL << 19)
#define L4_BLOCK_30_BIT_20 (1UL << 20)
#define L4_BLOCK_30_BIT_21 (1UL << 21)
#define L4_BLOCK_30_BIT_22 (1UL << 22)
#define L4_BLOCK_30_BIT_23 (1UL << 23)
#define L4_BLOCK_30_BIT_24 (1UL << 24)
#define L4_BLOCK_30_BIT_25 (1UL << 25)
#define L4_BLOCK_30_BIT_26 (1UL << 26)
#define L4_BLOCK_30_BIT_27 (1UL << 27)
#define L4_BLOCK_30_BIT_28 (1UL << 28)
#define L4_BLOCK_30_BIT_29 (1UL << 29)
#define L4_BLOCK_30_BIT_30 (1UL << 30)
#define L4_BLOCK_30_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 31 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_31_TypeDef;
#define L4_BLOCK_31 ((L4_BLOCK_31_TypeDef *)(0x40008000UL + 31 * 0x400UL))

#define L4_BLOCK_31_BIT_0 (1UL << 0)
#define L4_BLOCK_31_BIT_1 (1UL << 1)
#define L4_BLOCK_31_BIT_2 (1UL << 2)
#define L4_BLOCK_31_BIT_3 (1UL << 3)
#define L4_BLOCK_31_BIT_4 (1UL << 4)
#define L4_BLOCK_31_BIT_5 (1UL << 5)
#define L4_BLOCK_31_BIT_6 (1UL << 6)
#define L4_BLOCK_31_BIT_7 (1UL << 7)
#define L4_BLOCK_31_BIT_8 (1UL << 8)
#define L4_BLOCK_31_BIT_9 (1UL << 9)
#define L4_BLOCK_31_BIT_10 (1UL << 10)
#define L4_BLOCK_31_BIT_11 (1UL << 11)
#define L4_BLOCK_31_BIT_12 (1UL << 12)
#define L4_BLOCK_31_BIT_13 (1UL << 13)
#define L4_BLOCK_31_BIT_14 (1UL << 14)
#define L4_BLOCK_31_BIT_15 (1UL << 15)
#define L4_BLOCK_31_BIT_16 (1UL << 16)
#define L4_BLOCK_31_BIT_17 (1UL << 17)
#define L4_BLOCK_31_BIT_18 (1UL << 18)
#define L4_BLOCK_31_BIT_19 (1UL << 19)
#define L4_BLOCK_31_BIT_20 (1UL << 20)
#define L4_BLOCK_31_BIT_21 (1UL << 21)
#define L4_BLOCK_31_BIT_22 (1UL << 22)
#define L4_BLOCK_31_BIT_23 (1UL << 23)
#define L4_BLOCK_31_BIT_24 (1UL << 24)
#define L4_BLOCK_31_BIT_25 (1UL << 25)
#define L4_BLOCK_31_BIT_26 (1UL << 26)
#define L4_BLOCK_31_BIT_27 (1UL << 27)
#define L4_BLOCK_31_BIT_28 (1UL << 28)
#define L4_BLOCK_31_BIT_29 (1UL << 29)
#define L4_BLOCK_31_BIT_30 (1UL << 30)
#define L4_BLOCK_31_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 32 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_32_TypeDef;
#define L4_BLOCK_32 ((L4_BLOCK_32_TypeDef *)(0x40008000UL + 32 * 0x400UL))

