RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_32_BIT_0 (1UL << 0)
#define L4_BLOCK_32_BIT_1 (1UL << 1)
#define L4_BLOCK_32_BIT_2 (1UL << 2)
#define L4_BLOCK_32_BIT_3 (1UL << 3)
#define L4_BLOCK_32_BIT_4 (1UL << 4)
#define L4_BLOCK_32_BIT_5 (1UL << 5)
#define L4_BLOCK_32_BIT_6 (1UL << 6)
#define L4_BLOCK_32_BIT_7 (1UL << 7)
#define L4_BLOCK_32_BIT_8 (1UL << 8)
#define L4_BLOCK_32_BIT_9 (1UL << 9)
#define L4_BLOCK_32_BIT_10 (1UL << 10)
#define L4_BLOCK_32_BIT_11 (1UL << 11)
#define L4_BLOCK_32_BIT_12 (1UL << 12)
#define L4_BLOCK_32_BIT_13 (1UL << 13)
#define L4_BLOCK_32_BIT_14 (1UL << 14)
#define L4_BLOCK_32_BIT_15 (1UL << 15)
#define L4_BLOCK_32_BIT_16 (1UL << 16)
#define L4_BLOCK_32_BIT_17 (1UL << 17)
#define L4_BLOCK_32_BIT_18 (1UL << 18)
#define L4_BLOCK_32_BIT_19 (1UL << 19)
#define L4_BLOCK_32_BIT_20 (1UL << 20)
#define L4_BLOCK_32_BIT_21 (1UL << 21)
#define L4_BLOCK_32_BIT_22 (1UL << 22)
#define L4_BLOCK_32_BIT_23 (1UL << 23)
#define L4_BLOCK_32_BIT_24 (1UL << 24)
#define L4_BLOCK_32_BIT_25 (1UL << 25)
#define L4_BLOCK_32_BIT_26 (1UL << 26)
#define L4_BLOCK_32_BIT_27 (1UL << 27)
#define L4_BLOCK_32_BIT_28 (1UL << 28)
#define L4_BLOCK_32_BIT_29 (1UL << 29)
#define L4_BLOCK_32_BIT_30 (1UL << 30)
#define L4_BLOCK_32_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 33 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_33_TypeDef;
#define L4_BLOCK_33 ((L4_BLOCK_33_TypeDef *)(0x40008000UL + 33 * 0x400UL))

#define L4_BLOCK_33_BIT_0 (1UL << 0)
#define L4_BLOCK_33_BIT_1 (1UL << 1)
#define L4_BLOCK_33_BIT_2 (1UL << 2)
#define L4_BLOCK_33_BIT_3 (1UL << 3)
#define L4_BLOCK_33_BIT_4 (1UL << 4)
#define L4_BLOCK_33_BIT_5 (1UL << 5)
#define L4_BLOCK_33_BIT_6 (1UL << 6)
#define L4_BLOCK_33_BIT_7 (1UL << 7)
#define L4_BLOCK_33_BIT_8 (1UL << 8)
#define L4_BLOCK_33_BIT_9 (1UL << 9)
#define L4_BLOCK_33_BIT_10 (1UL << 10)
#define L4_BLOCK_33_BIT_11 (1UL << 11)
#define L4_BLOCK_33_BIT_12 (1UL << 12)
#define L4_BLOCK_33_BIT_13 (1UL << 13)
#define L4_BLOCK_33_BIT_14 (1UL << 14)
#define L4_BLOCK_33_BIT_15 (1UL << 15)
#define L4_BLOCK_33_BIT_16 (1UL << 16)
#define L4_BLOCK_33_BIT_17 (1UL << 17)
#define L4_BLOCK_33_BIT_18 (1UL << 18)
#define L4_BLOCK_33_BIT_19 (1UL << 19)
#define L4_BLOCK_33_BIT_20 (1UL << 20)
#define L4_BLOCK_33_BIT_21 (1UL << 21)
#define L4_BLOCK_33_BIT_22 (1UL << 22)
#define L4_BLOCK_33_BIT_23 (1UL << 23)
#define L4_BLOCK_33_BIT_24 (1UL << 24)
#define L4_BLOCK_33_BIT_25 (1UL << 25)
#define L4_BLOCK_33_BIT_26 (1UL << 26)
#define L4_BLOCK_33_BIT_27 (1UL << 27)
#define L4_BLOCK_33_BIT_28 (1UL << 28)
#define L4_BLOCK_33_BIT_29 (1UL << 29)
#define L4_BLOCK_33_BIT_30 (1UL << 30)
#define L4_BLOCK_33_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 34 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_34_TypeDef;
#define L4_BLOCK_34 ((L4_BLOCK_34_TypeDef *)(0x40008000UL + 34 * 0x400UL))

#define L4_BLOCK_34_BIT_0 (1UL << 0)
#define L4_BLOCK_34_BIT_1 (1UL << 1)
#define L4_BLOCK_34_BIT_2 (1UL << 2)
#define L4_BLOCK_34_BIT_3 (1UL << 3)
#define L4_BLOCK_34_BIT_4 (1UL << 4)
#define L4_BLOCK_34_BIT_5 (1UL << 5)
#define L4_BLOCK_34_BIT_6 (1UL << 6)
#define L4_BLOCK_34_BIT_7 (1UL << 7)
#define L4_BLOCK_34_BIT_8 (1UL << 8)
#define L4_BLOCK_34_BIT_9 (1UL << 9)
#define L4_BLOCK_34_BIT_10 (1UL << 10)
#define L4_BLOCK_34_BIT_11 (1UL << 11)
#define L4_BLOCK_34_BIT_12 (1UL << 12)
#define L4_BLOCK_34_BIT_13 (1UL << 13)
#define L4_BLOCK_34_BIT_14 (1UL << 14)
#define L4_BLOCK_34_BIT_15 (1UL << 15)
#define L4_BLOCK_34_BIT_16 (1UL << 16)
#define L4_BLOCK_34_BIT_17 (1UL << 17)
#define L4_BLOCK_34_BIT_18 (1UL << 18)
#define L4_BLOCK_34_BIT_19 (1UL << 19)
#define L4_BLOCK_34_BIT_20 (1UL << 20)
#define L4_BLOCK_34_BIT_21 (1UL << 21)
#define L4_BLOCK_34_BIT_22 (1UL << 22)
#define L4_BLOCK_34_BIT_23 (1UL << 23)
#define L4_BLOCK_34_BIT_24 (1UL << 24)
#define L4_BLOCK_34_BIT_25 (1UL << 25)
#define L4_BLOCK_34_BIT_26 (1UL << 26)
#define L4_BLOCK_34_BIT_27 (1UL << 27)
#define L4_BLOCK_34_BIT_28 (1UL << 28)
#define L4_BLOCK_34_BIT_29 (1UL << 29)
#define L4_BLOCK_34_BIT_30 (1UL << 30)
#define L4_BLOCK_34_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 35 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_35_TypeDef;
#define L4_BLOCK_35 ((L4_BLOCK_35_TypeDef *)(0x40008000UL + 35 * 0x400UL))

#define L4_BLOCK_35_BIT_0 (1UL << 0)
#define L4_BLOCK_35_BIT_1 (1UL << 1)
#define L4_BLOCK_35_BIT_2 (1UL << 2)
#define L4_BLOCK_35_BIT_3 (1UL << 3)
#define L4_BLOCK_35_BIT_4 (1UL << 4)
#define L4_BLOCK_35_BIT_5 (1UL << 5)
#define L4_BLOCK_35_BIT_6 (1UL << 6)
#define L4_BLOCK_35_BIT_7 (1UL << 7)
#define L4_BLOCK_35_BIT_8 (1UL << 8)
#define L4_BLOCK_35_BIT_9 (1UL << 9)
#define L4_BLOCK_35_BIT_10 (1UL << 10)
#define L4_BLOCK_35_BIT_11 (1UL << 11)
#define L4_BLOCK_35_BIT_12 (1UL << 12)
#define L4_BLOCK_35_BIT_13 (1UL << 13)
#define L4_BLOCK_35_BIT_14 (1UL << 14)
#define L4_BLOCK_35_BIT_15 (1UL << 15)
#define L4_BLOCK_35_BIT_16 (1UL << 16)
#define L4_BLOCK_35_BIT_17 (1UL << 17)
#define L4_BLOCK_35_BIT_18 (1UL << 18)
#define L4_BLOCK_35_BIT_19 (1UL << 19)
#define L4_BLOCK_35_BIT_20 (1UL << 20)
#define L4_BLOCK_35_BIT_21 (1UL << 21)
#define L4_BLOCK_35_BIT_22 (1UL << 22)
#define L4_BLOCK_35_BIT_23 (1UL << 23)
#define L4_BLOCK_35_BIT_24 (1UL << 24)
#define L4_BLOCK_35_BIT_25 (1UL << 25)
#define L4_BLOCK_35_BIT_26 (1UL << 26)
#define L4_BLOCK_35_BIT_27 (1UL << 27)
#define L4_BLOCK_35_BIT_28 (1UL << 28)
#define L4_BLOCK_35_BIT_29 (1UL << 29)
#define L4_BLOCK_35_BIT_30 (1UL << 30)
#define L4_BLOCK_35_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 36 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_36_TypeDef;
#define L4_BLOCK_36 ((L4_BLOCK_36_TypeDef *)(0x40008000UL + 36 * 0x400UL))

#define L4_BLOCK_36_BIT_0 (1UL << 0)
#define L4_BLOCK_36_BIT_1 (1UL << 1)
#define L4_BLOCK_36_BIT_2 (1UL << 2)
#define L4_BLOCK_36_BIT_3 (1UL << 3)
#define L4_BLOCK_36_BIT_4 (1UL << 4)
#define L4_BLOCK_36_BIT_5 (1UL << 5)
#define L4_BLOCK_36_BIT_6 (1UL << 6)
#define L4_BLOCK_36_BIT_7 (1UL << 7)
#define L4_BLOCK_36_BIT_8 (1UL << 8)
#define L4_BLOCK_36_BIT_9 (1UL << 9)
#define L4_BLOCK_36_BIT_10 (1UL << 10)
#define L4_BLOCK_36_BIT_11 (1UL << 11)
#define L4_BLOCK_36_BIT_12 (1UL << 12)
#define L4_BLOCK_36_BIT_13 (1UL << 13)
#define L4_BLOCK_36_BIT_14 (1UL << 14)
#define L4_BLOCK_36_BIT_15 (1UL << 15)
#define L4_BLOCK_36_BIT_16 (1UL << 16)
#define L4_BLOCK_36_BIT_17 (1UL << 17)
#define L4_BLOCK_36_BIT_18 (1UL << 18)
#define L4_BLOCK_36_BIT_19 (1UL << 19)
#define L4_BLOCK_36_BIT_20 (1UL << 20)
#define L4_BLOCK_36_BIT_21 (1UL << 21)
#define L4_BLOCK_36_BIT_22 (1UL << 22)
#define L4_BLOCK_36_BIT_23 (1UL << 23)
#define L4_BLOCK_36_BIT_24 (1UL << 24)
#define L4_BLOCK_36_BIT_25 (1UL << 25)
#define L4_BLOCK_36_BIT_26 (1UL << 26)
#define L4_BLOCK_36_BIT_27 (1UL << 27)
#define L4_BLOCK_36_BIT_28 (1UL << 28)
#define L4_BLOCK_36_BIT_29 (1UL << 29)
#define L4_BLOCK_36_BIT_30 (1UL << 30)
#define L4_BLOCK_36_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 37 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_37_TypeDef;
#define L4_BLOCK_37 ((L4_BLOCK_37_TypeDef *)(0x40008000UL + 37 * 0x400UL))

#define L4_BLOCK_37_BIT_0 (1UL << 0)
#define L4_BLOCK_37_BIT_1 (1UL << 1)
#define L4_BLOCK_37_BIT_2 (1UL << 2)
#define L4_BLOCK_37_BIT_3 (1UL << 3)
#define L4_BLOCK_37_BIT_4 (1UL << 4)
#define L4_BLOCK_37_BIT_5 (1UL << 5)
#define L4_BLOCK_37_BIT_6 (1UL << 6)
#define L4_BLOCK_37_BIT_7 (1UL << 7)
#define L4_BLOCK_37_BIT_8 (1UL << 8)
#define L4_BLOCK_37_BIT_9 (1UL << 9)
#define L4_BLOCK_37_BIT_10 (1UL << 10)
#define L4_BLOCK_37_BIT_11 (1UL << 11)
#define L4_BLOCK_37_BIT_12 (1UL << 12)
#define L4_BLOCK_37_BIT_13 (1UL << 13)
#define L4_BLOCK_37_BIT_14 (1UL << 14)
#define L4_BLOCK_37_BIT_15 (1UL << 15)
#define L4_BLOCK_37_BIT_16 (1UL << 16)
#define L4_BLOCK_37_BIT_17 (1UL << 17)
#define L4_BLOCK_37_BIT_18 (1UL << 18)
#define L4_BLOCK_37_BIT_19 (1UL << 19)
#define L4_BLOCK_37_BIT_20 (1UL << 20)
#define L4_BLOCK_37_BIT_21 (1UL << 21)
#define L4_BLOCK_37_BIT_22 (1UL << 22)
#define L4_BLOCK_37_BIT_23 (1UL << 23)
#define L4_BLOCK_37_BIT_24 (1UL << 24)
#define L4_BLOCK_37_BIT_25 (1UL << 25)
#define L4_BLOCK_37_BIT_26 (1UL << 26)
#define L4_BLOCK_37_BIT_27 (1UL << 27)
#define L4_BLOCK_37_BIT_28 (1UL << 28)
#define L4_BLOCK_37_BIT_29 (1UL << 29)
#define L4_BLOCK_37_BIT_30 (1UL << 30)
#define L4_BLOCK_37_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 38 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_38_TypeDef;
#define L4_BLOCK_38 ((L4_BLOCK_38_TypeDef *)(0x40008000UL + 38 * 0x400UL))

#define L4_BLOCK_38_BIT_0 (1UL << 0)
#define L4_BLOCK_38_BIT_1 (1UL << 1)
#define L4_BLOCK_38_BIT_2 (1UL << 2)
#define L4_BLOCK_38_BIT_3 (1UL << 3)
#define L4_BLOCK_38_BIT_4 (1UL << 4)
#define L4_BLOCK_38_BIT_5 (1UL << 5)
#define L4_BLOCK_38_BIT_6 (1UL << 6)
#define L4_BLOCK_38_BIT_7 (1UL << 7)
#define L4_BLOCK_38_BIT_8 (1UL << 8)
#define L4_BLOCK_38_BIT_9 (1UL << 9)
#define L4_BLOCK_38_BIT_10 (1UL << 10)
#define L4_BLOCK_38_BIT_11 (1UL << 11)
#define L4_BLOCK_38_BIT_12 (1UL << 12)
#define L4_BLOCK_38_BIT_13 (1UL << 13)
#define L4_BLOCK_38_BIT_14 (1UL << 14)
#define L4_BLOCK_38_BIT_15 (1UL << 15)
#define L4_BLOCK_38_BIT_16 (1UL << 16)
#define L4_BLOCK_38_BIT_17 (1UL << 17)
#define L4_BLOCK_38_BIT_18 (1UL << 18)
#define L4_BLOCK_38_BIT_19 (1UL << 19)
#define L4_BLOCK_38_BIT_20 (1UL << 20)
#define L4_BLOCK_38_BIT_21 (1UL << 21)
#define L4_BLOCK_38_BIT_22 (1UL << 22)
#define L4_BLOCK_38_BIT_23 (1UL << 23)
#define L4_BLOCK_38_BIT_24 (1UL << 24)
#define L4_BLOCK_38_BIT_25 (1UL << 25)
#define L4_BLOCK_38_BIT_26 (1UL << 26)
#define L4_BLOCK_38_BIT_27 (1UL << 27)
#define L4_BLOCK_38_BIT_28 (1UL << 28)
#define L4_BLOCK_38_BIT_29 (1UL << 29)
#define L4_BLOCK_38_BIT_30 (1UL << 30)
#define L4_BLOCK_38_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 39 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_39_TypeDef;
#define L4_BLOCK_39 ((L4_BLOCK_39_TypeDef *)(0x40008000UL + 39 * 0x400UL))

#define L4_BLOCK_39_BIT_0 (1UL << 0)
#define L4_BLOCK_39_BIT_1 (1UL << 1)
#define L4_BLOCK_39_BIT_2 (1UL << 2)
#define L4_BLOCK_39_BIT_3 (1UL << 3)
#define L4_BLOCK_39_BIT_4 (1UL << 4)
#define L4_BLOCK_39_BIT_5 (1UL << 5)
#define L4_BLOCK_39_BIT_6 (1UL << 6)
#define L4_BLOCK_39_BIT_7 (1UL << 7)
#define L4_BLOCK_39_BIT_8 (1UL << 8)
#define L4_BLOCK_39_BIT_9 (1UL << 9)
#define L4_BLOCK_39_BIT_10 (1UL << 10)
#define L4_BLOCK_39_BIT_11 (1UL << 11)
#define L4_BLOCK_39_BIT_12 (1UL << 12)
#define L4_BLOCK_39_BIT_13 (1UL << 13)
#define L4_BLOCK_39_BIT_14 (1UL << 14)
#define L4_BLOCK_39_BIT_15 (1UL << 15)
#define L4_BLOCK_39_BIT_16 (1UL << 16)
#define L4_BLOCK_39_BIT_17 (1UL << 17)
#define L4_BLOCK_39_BIT_18 (1UL << 18)
#define L4_BLOCK_39_BIT_19 (1UL << 19)
#define L4_BLOCK_39_BIT_20 (1UL << 20)
#define L4_BLOCK_39_BIT_21 (1UL << 21)
#define L4_BLOCK_39_BIT_22 (1UL << 22)
#define L4_BLOCK_39_BIT_23 (1UL << 23)
#define L4_BLOCK_39_BIT_24 (1UL << 24)
#define L4_BLOCK_39_BIT_25 (1UL << 25)
#define L4_BLOCK_39_BIT_26 (1UL << 26)
#define L4_BLOCK_39_BIT_27 (1UL << 27)
#define L4_BLOCK_39_BIT_28 (1UL << 28)
#define L4_BLOCK_39_BIT_29 (1UL << 29)
#define L4_BLOCK_39_BIT_30 (1UL << 30)
#define L4_BLOCK_39_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 40 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_40_TypeDef;
#define L4_BLOCK_40 ((L4_BLOCK_40_TypeDef *)(0x40008000UL + 40 * 0x400UL))

