RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_40_BIT_0 (1UL << 0)
#define L4_BLOCK_40_BIT_1 (1UL << 1)
#define L4_BLOCK_40_BIT_2 (1UL << 2)
#define L4_BLOCK_40_BIT_3 (1UL << 3)
#define L4_BLOCK_40_BIT_4 (1UL << 4)
#define L4_BLOCK_40_BIT_5 (1UL << 5)
#define L4_BLOCK_40_BIT_6 (1UL << 6)
#define L4_BLOCK_40_BIT_7 (1UL << 7)
#define L4_BLOCK_40_BIT_8 (1UL << 8)
#define L4_BLOCK_40_BIT_9 (1UL << 9)
#define L4_BLOCK_40_BIT_10 (1UL << 10)
#define L4_BLOCK_40_BIT_11 (1UL << 11)
#define L4_BLOCK_40_BIT_12 (1UL << 12)
#define L4_BLOCK_40_BIT_13 (1UL << 13)
#define L4_BLOCK_40_BIT_14 (1UL << 14)
#define L4_BLOCK_40_BIT_15 (1UL << 15)
#define L4_BLOCK_40_BIT_16 (1UL << 16)
#define L4_BLOCK_40_BIT_17 (1UL << 17)
#define L4_BLOCK_40_BIT_18 (1UL << 18)
#define L4_BLOCK_40_BIT_19 (1UL << 19)
#define L4_BLOCK_40_BIT_20 (1UL << 20)
#define L4_BLOCK_40_BIT_21 (1UL << 21)
#define L4_BLOCK_40_BIT_22 (1UL << 22)
#define L4_BLOCK_40_BIT_23 (1UL << 23)
#define L4_BLOCK_40_BIT_24 (1UL << 24)
#define L4_BLOCK_40_BIT_25 (1UL << 25)
#define L4_BLOCK_40_BIT_26 (1UL << 26)
#define L4_BLOCK_40_BIT_27 (1UL << 27)
#define L4_BLOCK_40_BIT_28 (1UL << 28)
#define L4_BLOCK_40_BIT_29 (1UL << 29)
#define L4_BLOCK_40_BIT_30 (1UL << 30)
#define L4_BLOCK_40_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 41 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_41_TypeDef;
#define L4_BLOCK_41 ((L4_BLOCK_41_TypeDef *)(0x40008000UL + 41 * 0x400UL))

#define L4_BLOCK_41_BIT_0 (1UL << 0)
#define L4_BLOCK_41_BIT_1 (1UL << 1)
#define L4_BLOCK_41_BIT_2 (1UL << 2)
#define L4_BLOCK_41_BIT_3 (1UL << 3)
#define L4_BLOCK_41_BIT_4 (1UL << 4)
#define L4_BLOCK_41_BIT_5 (1UL << 5)
#define L4_BLOCK_41_BIT_6 (1UL << 6)
#define L4_BLOCK_41_BIT_7 (1UL << 7)
#define L4_BLOCK_41_BIT_8 (1UL << 8)
#define L4_BLOCK_41_BIT_9 (1UL << 9)
#define L4_BLOCK_41_BIT_10 (1UL << 10)
#define L4_BLOCK_41_BIT_11 (1UL << 11)
#define L4_BLOCK_41_BIT_12 (1UL << 12)
#define L4_BLOCK_41_BIT_13 (1UL << 13)
#define L4_BLOCK_41_BIT_14 (1UL << 14)
#define L4_BLOCK_41_BIT_15 (1UL << 15)
#define L4_BLOCK_41_BIT_16 (1UL << 16)
#define L4_BLOCK_41_BIT_17 (1UL << 17)
#define L4_BLOCK_41_BIT_18 (1UL << 18)
#define L4_BLOCK_41_BIT_19 (1UL << 19)
#define L4_BLOCK_41_BIT_20 (1UL << 20)
#define L4_BLOCK_41_BIT_21 (1UL << 21)
#define L4_BLOCK_41_BIT_22 (1UL << 22)
#define L4_BLOCK_41_BIT_23 (1UL << 23)
#define L4_BLOCK_41_BIT_24 (1UL << 24)
#define L4_BLOCK_41_BIT_25 (1UL << 25)
#define L4_BLOCK_41_BIT_26 (1UL << 26)
#define L4_BLOCK_41_BIT_27 (1UL << 27)
#define L4_BLOCK_41_BIT_28 (1UL << 28)
#define L4_BLOCK_41_BIT_29 (1UL << 29)
#define L4_BLOCK_41_BIT_30 (1UL << 30)
#define L4_BLOCK_41_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 42 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_42_TypeDef;
#define L4_BLOCK_42 ((L4_BLOCK_42_TypeDef *)(0x40008000UL + 42 * 0x400UL))

#define L4_BLOCK_42_BIT_0 (1UL << 0)
#define L4_BLOCK_42_BIT_1 (1UL << 1)
#define L4_BLOCK_42_BIT_2 (1UL << 2)
#define L4_BLOCK_42_BIT_3 (1UL << 3)
#define L4_BLOCK_42_BIT_4 (1UL << 4)
#define L4_BLOCK_42_BIT_5 (1UL << 5)
#define L4_BLOCK_42_BIT_6 (1UL << 6)
#define L4_BLOCK_42_BIT_7 (1UL << 7)
#define L4_BLOCK_42_BIT_8 (1UL << 8)
#define L4_BLOCK_42_BIT_9 (1UL << 9)
#define L4_BLOCK_42_BIT_10 (1UL << 10)
#define L4_BLOCK_42_BIT_11 (1UL << 11)
#define L4_BLOCK_42_BIT_12 (1UL << 12)
#define L4_BLOCK_42_BIT_13 (1UL << 13)
#define L4_BLOCK_42_BIT_14 (1UL << 14)
#define L4_BLOCK_42_BIT_15 (1UL << 15)
#define L4_BLOCK_42_BIT_16 (1UL << 16)
#define L4_BLOCK_42_BIT_17 (1UL << 17)
#define L4_BLOCK_42_BIT_18 (1UL << 18)
#define L4_BLOCK_42_BIT_19 (1UL << 19)
#define L4_BLOCK_42_BIT_20 (1UL << 20)
#define L4_BLOCK_42_BIT_21 (1UL << 21)
#define L4_BLOCK_42_BIT_22 (1UL << 22)
#define L4_BLOCK_42_BIT_23 (1UL << 23)
#define L4_BLOCK_42_BIT_24 (1UL << 24)
#define L4_BLOCK_42_BIT_25 (1UL << 25)
#define L4_BLOCK_42_BIT_26 (1UL << 26)
#define L4_BLOCK_42_BIT_27 (1UL << 27)
#define L4_BLOCK_42_BIT_28 (1UL << 28)
#define L4_BLOCK_42_BIT_29 (1UL << 29)
#define L4_BLOCK_42_BIT_30 (1UL << 30)
#define L4_BLOCK_42_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 43 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_43_TypeDef;
#define L4_BLOCK_43 ((L4_BLOCK_43_TypeDef *)(0x40008000UL + 43 * 0x400UL))

#define L4_BLOCK_43_BIT_0 (1UL << 0)
#define L4_BLOCK_43_BIT_1 (1UL << 1)
#define L4_BLOCK_43_BIT_2 (1UL << 2)
#define L4_BLOCK_43_BIT_3 (1UL << 3)
#define L4_BLOCK_43_BIT_4 (1UL << 4)
#define L4_BLOCK_43_BIT_5 (1UL << 5)
#define L4_BLOCK_43_BIT_6 (1UL << 6)
#define L4_BLOCK_43_BIT_7 (1UL << 7)
#define L4_BLOCK_43_BIT_8 (1UL << 8)
#define L4_BLOCK_43_BIT_9 (1UL << 9)
#define L4_BLOCK_43_BIT_10 (1UL << 10)
#define L4_BLOCK_43_BIT_11 (1UL << 11)
#define L4_BLOCK_43_BIT_12 (1UL << 12)
#define L4_BLOCK_43_BIT_13 (1UL << 13)
#define L4_BLOCK_43_BIT_14 (1UL << 14)
#define L4_BLOCK_43_BIT_15 (1UL << 15)
#define L4_BLOCK_43_BIT_16 (1UL << 16)
#define L4_BLOCK_43_BIT_17 (1UL << 17)
#define L4_BLOCK_43_BIT_18 (1UL << 18)
#define L4_BLOCK_43_BIT_19 (1UL << 19)
#define L4_BLOCK_43_BIT_20 (1UL << 20)
#define L4_BLOCK_43_BIT_21 (1UL << 21)
#define L4_BLOCK_43_BIT_22 (1UL << 22)
#define L4_BLOCK_43_BIT_23 (1UL << 23)
#define L4_BLOCK_43_BIT_24 (1UL << 24)
#define L4_BLOCK_43_BIT_25 (1UL << 25)
#define L4_BLOCK_43_BIT_26 (1UL << 26)
#define L4_BLOCK_43_BIT_27 (1UL << 27)
#define L4_BLOCK_43_BIT_28 (1UL << 28)
#define L4_BLOCK_43_BIT_29 (1UL << 29)
#define L4_BLOCK_43_BIT_30 (1UL << 30)
#define L4_BLOCK_43_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 44 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_44_TypeDef;
#define L4_BLOCK_44 ((L4_BLOCK_44_TypeDef *)(0x40008000UL + 44 * 0x400UL))

#define L4_BLOCK_44_BIT_0 (1UL << 0)
#define L4_BLOCK_44_BIT_1 (1UL << 1)
#define L4_BLOCK_44_BIT_2 (1UL << 2)
#define L4_BLOCK_44_BIT_3 (1UL << 3)
#define L4_BLOCK_44_BIT_4 (1UL << 4)
#define L4_BLOCK_44_BIT_5 (1UL << 5)
#define L4_BLOCK_44_BIT_6 (1UL << 6)
#define L4_BLOCK_44_BIT_7 (1UL << 7)
#define L4_BLOCK_44_BIT_8 (1UL << 8)
#define L4_BLOCK_44_BIT_9 (1UL << 9)
#define L4_BLOCK_44_BIT_10 (1UL << 10)
#define L4_BLOCK_44_BIT_11 (1UL << 11)
#define L4_BLOCK_44_BIT_12 (1UL << 12)
#define L4_BLOCK_44_BIT_13 (1UL << 13)
#define L4_BLOCK_44_BIT_14 (1UL << 14)
#define L4_BLOCK_44_BIT_15 (1UL << 15)
#define L4_BLOCK_44_BIT_16 (1UL << 16)
#define L4_BLOCK_44_BIT_17 (1UL << 17)
#define L4_BLOCK_44_BIT_18 (1UL << 18)
#define L4_BLOCK_44_BIT_19 (1UL << 19)
#define L4_BLOCK_44_BIT_20 (1UL << 20)
#define L4_BLOCK_44_BIT_21 (1UL << 21)
#define L4_BLOCK_44_BIT_22 (1UL << 22)
#define L4_BLOCK_44_BIT_23 (1UL << 23)
#define L4_BLOCK_44_BIT_24 (1UL << 24)
#define L4_BLOCK_44_BIT_25 (1UL << 25)
#define L4_BLOCK_44_BIT_26 (1UL << 26)
#define L4_BLOCK_44_BIT_27 (1UL << 27)
#define L4_BLOCK_44_BIT_28 (1UL << 28)
#define L4_BLOCK_44_BIT_29 (1UL << 29)
#define L4_BLOCK_44_BIT_30 (1UL << 30)
#define L4_BLOCK_44_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 45 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_45_TypeDef;
#define L4_BLOCK_45 ((L4_BLOCK_45_TypeDef *)(0x40008000UL + 45 * 0x400UL))

#define L4_BLOCK_45_BIT_0 (1UL << 0)
#define L4_BLOCK_45_BIT_1 (1UL << 1)
#define L4_BLOCK_45_BIT_2 (1UL << 2)
#define L4_BLOCK_45_BIT_3 (1UL << 3)
#define L4_BLOCK_45_BIT_4 (1UL << 4)
#define L4_BLOCK_45_BIT_5 (1UL << 5)
#define L4_BLOCK_45_BIT_6 (1UL << 6)
#define L4_BLOCK_45_BIT_7 (1UL << 7)
#define L4_BLOCK_45_BIT_8 (1UL << 8)
#define L4_BLOCK_45_BIT_9 (1UL << 9)
#define L4_BLOCK_45_BIT_10 (1UL << 10)
#define L4_BLOCK_45_BIT_11 (1UL << 11)
#define L4_BLOCK_45_BIT_12 (1UL << 12)
#define L4_BLOCK_45_BIT_13 (1UL << 13)
#define L4_BLOCK_45_BIT_14 (1UL << 14)
#define L4_BLOCK_45_BIT_15 (1UL << 15)
#define L4_BLOCK_45_BIT_16 (1UL << 16)
#define L4_BLOCK_45_BIT_17 (1UL << 17)
#define L4_BLOCK_45_BIT_18 (1UL << 18)
#define L4_BLOCK_45_BIT_19 (1UL << 19)
#define L4_BLOCK_45_BIT_20 (1UL << 20)
#define L4_BLOCK_45_BIT_21 (1UL << 21)
#define L4_BLOCK_45_BIT_22 (1UL << 22)
#define L4_BLOCK_45_BIT_23 (1UL << 23)
#define L4_BLOCK_45_BIT_24 (1UL << 24)
#define L4_BLOCK_45_BIT_25 (1UL << 25)
#define L4_BLOCK_45_BIT_26 (1UL << 26)
#define L4_BLOCK_45_BIT_27 (1UL << 27)
#define L4_BLOCK_45_BIT_28 (1UL << 28)
#define L4_BLOCK_45_BIT_29 (1UL << 29)
#define L4_BLOCK_45_BIT_30 (1UL << 30)
#define L4_BLOCK_45_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 46 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_46_TypeDef;
#define L4_BLOCK_46 ((L4_BLOCK_46_TypeDef *)(0x40008000UL + 46 * 0x400UL))

#define L4_BLOCK_46_BIT_0 (1UL << 0)
#define L4_BLOCK_46_BIT_1 (1UL << 1)
#define L4_BLOCK_46_BIT_2 (1UL << 2)
#define L4_BLOCK_46_BIT_3 (1UL << 3)
#define L4_BLOCK_46_BIT_4 (1UL << 4)
#define L4_BLOCK_46_BIT_5 (1UL << 5)
#define L4_BLOCK_46_BIT_6 (1UL << 6)
#define L4_BLOCK_46_BIT_7 (1UL << 7)
#define L4_BLOCK_46_BIT_8 (1UL << 8)
#define L4_BLOCK_46_BIT_9 (1UL << 9)
#define L4_BLOCK_46_BIT_10 (1UL << 10)
#define L4_BLOCK_46_BIT_11 (1UL << 11)
#define L4_BLOCK_46_BIT_12 (1UL << 12)
#define L4_BLOCK_46_BIT_13 (1UL << 13)
#define L4_BLOCK_46_BIT_14 (1UL << 14)
#define L4_BLOCK_46_BIT_15 (1UL << 15)
#define L4_BLOCK_46_BIT_16 (1UL << 16)
#define L4_BLOCK_46_BIT_17 (1UL << 17)
#define L4_BLOCK_46_BIT_18 (1UL << 18)
#define L4_BLOCK_46_BIT_19 (1UL << 19)
#define L4_BLOCK_46_BIT_20 (1UL << 20)
#define L4_BLOCK_46_BIT_21 (1UL << 21)
#define L4_BLOCK_46_BIT_22 (1UL << 22)
#define L4_BLOCK_46_BIT_23 (1UL << 23)
#define L4_BLOCK_46_BIT_24 (1UL << 24)
#define L4_BLOCK_46_BIT_25 (1UL << 25)
#define L4_BLOCK_46_BIT_26 (1UL << 26)
#define L4_BLOCK_46_BIT_27 (1UL << 27)
#define L4_BLOCK_46_BIT_28 (1UL << 28)
#define L4_BLOCK_46_BIT_29 (1UL << 29)
#define L4_BLOCK_46_BIT_30 (1UL << 30)
#define L4_BLOCK_46_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 47 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_47_TypeDef;
#define L4_BLOCK_47 ((L4_BLOCK_47_TypeDef *)(0x40008000UL + 47 * 0x400UL))

