RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_47_BIT_0 (1UL << 0)
#define L4_BLOCK_47_BIT_1 (1UL << 1)
#define L4_BLOCK_47_BIT_2 (1UL << 2)
#define L4_BLOCK_47_BIT_3 (1UL << 3)
#define L4_BLOCK_47_BIT_4 (1UL << 4)
#define L4_BLOCK_47_BIT_5 (1UL << 5)
#define L4_BLOCK_47_BIT_6 (1UL << 6)
#define L4_BLOCK_47_BIT_7 (1UL << 7)
#define L4_BLOCK_47_BIT_8 (1UL << 8)
#define L4_BLOCK_47_BIT_9 (1UL << 9)
#define L4_BLOCK_47_BIT_10 (1UL << 10)
#define L4_BLOCK_47_BIT_11 (1UL << 11)
#define L4_BLOCK_47_BIT_12 (1UL << 12)
#define L4_BLOCK_47_BIT_13 (1UL << 13)
#define L4_BLOCK_47_BIT_14 (1UL << 14)
#define L4_BLOCK_47_BIT_15 (1UL << 15)
#define L4_BLOCK_47_BIT_16 (1UL << 16)
#define L4_BLOCK_47_BIT_17 (1UL << 17)
#define L4_BLOCK_47_BIT_18 (1UL << 18)
#define L4_BLOCK_47_BIT_19 (1UL << 19)
#define L4_BLOCK_47_BIT_20 (1UL << 20)
#define L4_BLOCK_47_BIT_21 (1UL << 21)
#define L4_BLOCK_47_BIT_22 (1UL << 22)
#define L4_BLOCK_47_BIT_23 (1UL << 23)
#define L4_BLOCK_47_BIT_24 (1UL << 24)
#define L4_BLOCK_47_BIT_25 (1UL << 25)
#define L4_BLOCK_47_BIT_26 (1UL << 26)
#define L4_BLOCK_47_BIT_27 (1UL << 27)
#define L4_BLOCK_47_BIT_28 (1UL << 28)
#define L4_BLOCK_47_BIT_29 (1UL << 29)
#define L4_BLOCK_47_BIT_30 (1UL << 30)
#define L4_BLOCK_47_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 48 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_48_TypeDef;
#define L4_BLOCK_48 ((L4_BLOCK_48_TypeDef *)(0x40008000UL + 48 * 0x400UL))

#define L4_BLOCK_48_BIT_0 (1UL << 0)
#define L4_BLOCK_48_BIT_1 (1UL << 1)
#define L4_BLOCK_48_BIT_2 (1UL << 2)
#define L4_BLOCK_48_BIT_3 (1UL << 3)
#define L4_BLOCK_48_BIT_4 (1UL << 4)
#define L4_BLOCK_48_BIT_5 (1UL << 5)
#define L4_BLOCK_48_BIT_6 (1UL << 6)
#define L4_BLOCK_48_BIT_7 (1UL << 7)
#define L4_BLOCK_48_BIT_8 (1UL << 8)
#define L4_BLOCK_48_BIT_9 (1UL << 9)
#define L4_BLOCK_48_BIT_10 (1UL << 10)
#define L4_BLOCK_48_BIT_11 (1UL << 11)
#define L4_BLOCK_48_BIT_12 (1UL << 12)
#define L4_BLOCK_48_BIT_13 (1UL << 13)
#define L4_BLOCK_48_BIT_14 (1UL << 14)
#define L4_BLOCK_48_BIT_15 (1UL << 15)
#define L4_BLOCK_48_BIT_16 (1UL << 16)
#define L4_BLOCK_48_BIT_17 (1UL << 17)
#define L4_BLOCK_48_BIT_18 (1UL << 18)
#define L4_BLOCK_48_BIT_19 (1UL << 19)
#define L4_BLOCK_48_BIT_20 (1UL << 20)
#define L4_BLOCK_48_BIT_21 (1UL << 21)
#define L4_BLOCK_48_BIT_22 (1UL << 22)
#define L4_BLOCK_48_BIT_23 (1UL << 23)
#define L4_BLOCK_48_BIT_24 (1UL << 24)
#define L4_BLOCK_48_BIT_25 (1UL << 25)
#define L4_BLOCK_48_BIT_26 (1UL << 26)
#define L4_BLOCK_48_BIT_27 (1UL << 27)
#define L4_BLOCK_48_BIT_28 (1UL << 28)
#define L4_BLOCK_48_BIT_29 (1UL << 29)
#define L4_BLOCK_48_BIT_30 (1UL << 30)
#define L4_BLOCK_48_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 49 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_49_TypeDef;
#define L4_BLOCK_49 ((L4_BLOCK_49_TypeDef *)(0x40008000UL + 49 * 0x400UL))

#define L4_BLOCK_49_BIT_0 (1UL << 0)
#define L4_BLOCK_49_BIT_1 (1UL << 1)
#define L4_BLOCK_49_BIT_2 (1UL << 2)
#define L4_BLOCK_49_BIT_3 (1UL << 3)
#define L4_BLOCK_49_BIT_4 (1UL << 4)
#define L4_BLOCK_49_BIT_5 (1UL << 5)
#define L4_BLOCK_49_BIT_6 (1UL << 6)
#define L4_BLOCK_49_BIT_7 (1UL << 7)
#define L4_BLOCK_49_BIT_8 (1UL << 8)
#define L4_BLOCK_49_BIT_9 (1UL << 9)
#define L4_BLOCK_49_BIT_10 (1UL << 10)
#define L4_BLOCK_49_BIT_11 (1UL << 11)
#define L4_BLOCK_49_BIT_12 (1UL << 12)
#define L4_BLOCK_49_BIT_13 (1UL << 13)
#define L4_BLOCK_49_BIT_14 (1UL << 14)
#define L4_BLOCK_49_BIT_15 (1UL << 15)
#define L4_BLOCK_49_BIT_16 (1UL << 16)
#define L4_BLOCK_49_BIT_17 (1UL << 17)
#define L4_BLOCK_49_BIT_18 (1UL << 18)
#define L4_BLOCK_49_BIT_19 (1UL << 19)
#define L4_BLOCK_49_BIT_20 (1UL << 20)
#define L4_BLOCK_49_BIT_21 (1UL << 21)
#define L4_BLOCK_49_BIT_22 (1UL << 22)
#define L4_BLOCK_49_BIT_23 (1UL << 23)
#define L4_BLOCK_49_BIT_24 (1UL << 24)
#define L4_BLOCK_49_BIT_25 (1UL << 25)
#define L4_BLOCK_49_BIT_26 (1UL << 26)
#define L4_BLOCK_49_BIT_27 (1UL << 27)
#define L4_BLOCK_49_BIT_28 (1UL << 28)
#define L4_BLOCK_49_BIT_29 (1UL << 29)
#define L4_BLOCK_49_BIT_30 (1UL << 30)
#define L4_BLOCK_49_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 50 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_50_TypeDef;
#define L4_BLOCK_50 ((L4_BLOCK_50_TypeDef *)(0x40008000UL + 50 * 0x400UL))

#define L4_BLOCK_50_BIT_0 (1UL << 0)
#define L4_BLOCK_50_BIT_1 (1UL << 1)
#define L4_BLOCK_50_BIT_2 (1UL << 2)
#define L4_BLOCK_50_BIT_3 (1UL << 3)
#define L4_BLOCK_50_BIT_4 (1UL << 4)
#define L4_BLOCK_50_BIT_5 (1UL << 5)
#define L4_BLOCK_50_BIT_6 (1UL << 6)
#define L4_BLOCK_50_BIT_7 (1UL << 7)
#define L4_BLOCK_50_BIT_8 (1UL << 8)
#define L4_BLOCK_50_BIT_9 (1UL << 9)
#define L4_BLOCK_50_BIT_10 (1UL << 10)
#define L4_BLOCK_50_BIT_11 (1UL << 11)
#define L4_BLOCK_50_BIT_12 (1UL << 12)
#define L4_BLOCK_50_BIT_13 (1UL << 13)
#define L4_BLOCK_50_BIT_14 (1UL << 14)
#define L4_BLOCK_50_BIT_15 (1UL << 15)
#define L4_BLOCK_50_BIT_16 (1UL << 16)
#define L4_BLOCK_50_BIT_17 (1UL << 17)
#define L4_BLOCK_50_BIT_18 (1UL << 18)
#define L4_BLOCK_50_BIT_19 (1UL << 19)
#define L4_BLOCK_50_BIT_20 (1UL << 20)
#define L4_BLOCK_50_BIT_21 (1UL << 21)
#define L4_BLOCK_50_BIT_22 (1UL << 22)
#define L4_BLOCK_50_BIT_23 (1UL << 23)
#define L4_BLOCK_50_BIT_24 (1UL << 24)
#define L4_BLOCK_50_BIT_25 (1UL << 25)
#define L4_BLOCK_50_BIT_26 (1UL << 26)
#define L4_BLOCK_50_BIT_27 (1UL << 27)
#define L4_BLOCK_50_BIT_28 (1UL << 28)
#define L4_BLOCK_50_BIT_29 (1UL << 29)
#define L4_BLOCK_50_BIT_30 (1UL << 30)
#define L4_BLOCK_50_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 51 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_51_TypeDef;
#define L4_BLOCK_51 ((L4_BLOCK_51_TypeDef *)(0x40008000UL + 51 * 0x400UL))

#define L4_BLOCK_51_BIT_0 (1UL << 0)
#define L4_BLOCK_51_BIT_1 (1UL << 1)
#define L4_BLOCK_51_BIT_2 (1UL << 2)
#define L4_BLOCK_51_BIT_3 (1UL << 3)
#define L4_BLOCK_51_BIT_4 (1UL << 4)
#define L4_BLOCK_51_BIT_5 (1UL << 5)
#define L4_BLOCK_51_BIT_6 (1UL << 6)
#define L4_BLOCK_51_BIT_7 (1UL << 7)
#define L4_BLOCK_51_BIT_8 (1UL << 8)
#define L4_BLOCK_51_BIT_9 (1UL << 9)
#define L4_BLOCK_51_BIT_10 (1UL << 10)
#define L4_BLOCK_51_BIT_11 (1UL << 11)
#define L4_BLOCK_51_BIT_12 (1UL << 12)
#define L4_BLOCK_51_BIT_13 (1UL << 13)
#define L4_BLOCK_51_BIT_14 (1UL << 14)
#define L4_BLOCK_51_BIT_15 (1UL << 15)
#define L4_BLOCK_51_BIT_16 (1UL << 16)
#define L4_BLOCK_51_BIT_17 (1UL << 17)
#define L4_BLOCK_51_BIT_18 (1UL << 18)
#define L4_BLOCK_51_BIT_19 (1UL << 19)
#define L4_BLOCK_51_BIT_20 (1UL << 20)
#define L4_BLOCK_51_BIT_21 (1UL << 21)
#define L4_BLOCK_51_BIT_22 (1UL << 22)
#define L4_BLOCK_51_BIT_23 (1UL << 23)
#define L4_BLOCK_51_BIT_24 (1UL << 24)
#define L4_BLOCK_51_BIT_25 (1UL << 25)
#define L4_BLOCK_51_BIT_26 (1UL << 26)
#define L4_BLOCK_51_BIT_27 (1UL << 27)
#define L4_BLOCK_51_BIT_28 (1UL << 28)
#define L4_BLOCK_51_BIT_29 (1UL << 29)
#define L4_BLOCK_51_BIT_30 (1UL << 30)
#define L4_BLOCK_51_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 52 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_52_TypeDef;
#define L4_BLOCK_52 ((L4_BLOCK_52_TypeDef *)(0x40008000UL + 52 * 0x400UL))

#define L4_BLOCK_52_BIT_0 (1UL << 0)
#define L4_BLOCK_52_BIT_1 (1UL << 1)
#define L4_BLOCK_52_BIT_2 (1UL << 2)
#define L4_BLOCK_52_BIT_3 (1UL << 3)
#define L4_BLOCK_52_BIT_4 (1UL << 4)
#define L4_BLOCK_52_BIT_5 (1UL << 5)
#define L4_BLOCK_52_BIT_6 (1UL << 6)
#define L4_BLOCK_52_BIT_7 (1UL << 7)
#define L4_BLOCK_52_BIT_8 (1UL << 8)
#define L4_BLOCK_52_BIT_9 (1UL << 9)
#define L4_BLOCK_52_BIT_10 (1UL << 10)
#define L4_BLOCK_52_BIT_11 (1UL << 11)
#define L4_BLOCK_52_BIT_12 (1UL << 12)
#define L4_BLOCK_52_BIT_13 (1UL << 13)
#define L4_BLOCK_52_BIT_14 (1UL << 14)
#define L4_BLOCK_52_BIT_15 (1UL << 15)
#define L4_BLOCK_52_BIT_16 (1UL << 16)
#define L4_BLOCK_52_BIT_17 (1UL << 17)
#define L4_BLOCK_52_BIT_18 (1UL << 18)
#define L4_BLOCK_52_BIT_19 (1UL << 19)
#define L4_BLOCK_52_BIT_20 (1UL << 20)
#define L4_BLOCK_52_BIT_21 (1UL << 21)
#define L4_BLOCK_52_BIT_22 (1UL << 22)
#define L4_BLOCK_52_BIT_23 (1UL << 23)
#define L4_BLOCK_52_BIT_24 (1UL << 24)
#define L4_BLOCK_52_BIT_25 (1UL << 25)
#define L4_BLOCK_52_BIT_26 (1UL << 26)
#define L4_BLOCK_52_BIT_27 (1UL << 27)
#define L4_BLOCK_52_BIT_28 (1UL << 28)
#define L4_BLOCK_52_BIT_29 (1UL << 29)
#define L4_BLOCK_52_BIT_30 (1UL << 30)
#define L4_BLOCK_52_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 53 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_53_TypeDef;
#define L4_BLOCK_53 ((L4_BLOCK_53_TypeDef *)(0x40008000UL + 53 * 0x400UL))

#define L4_BLOCK_53_BIT_0 (1UL << 0)
#define L4_BLOCK_53_BIT_1 (1UL << 1)
#define L4_BLOCK_53_BIT_2 (1UL << 2)
#define L4_BLOCK_53_BIT_3 (1UL << 3)
#define L4_BLOCK_53_BIT_4 (1UL << 4)
#define L4_BLOCK_53_BIT_5 (1UL << 5)
#define L4_BLOCK_53_BIT_6 (1UL << 6)
#define L4_BLOCK_53_BIT_7 (1UL << 7)
#define L4_BLOCK_53_BIT_8 (1UL << 8)
#define L4_BLOCK_53_BIT_9 (1UL << 9)
#define L4_BLOCK_53_BIT_10 (1UL << 10)
#define L4_BLOCK_53_BIT_11 (1UL << 11)
#define L4_BLOCK_53_BIT_12 (1UL << 12)
#define L4_BLOCK_53_BIT_13 (1UL << 13)
#define L4_BLOCK_53_BIT_14 (1UL << 14)
#define L4_BLOCK_53_BIT_15 (1UL << 15)
#define L4_BLOCK_53_BIT_16 (1UL << 16)
#define L4_BLOCK_53_BIT_17 (1UL << 17)
#define L4_BLOCK_53_BIT_18 (1UL << 18)
#define L4_BLOCK_53_BIT_19 (1UL << 19)
#define L4_BLOCK_53_BIT_20 (1UL << 20)
#define L4_BLOCK_53_BIT_21 (1UL << 21)
#define L4_BLOCK_53_BIT_22 (1UL << 22)
#define L4_BLOCK_53_BIT_23 (1UL << 23)
#define L4_BLOCK_53_BIT_24 (1UL << 24)
#define L4_BLOCK_53_BIT_25 (1UL << 25)
#define L4_BLOCK_53_BIT_26 (1UL << 26)
#define L4_BLOCK_53_BIT_27 (1UL << 27)
#define L4_BLOCK_53_BIT_28 (1UL << 28)
#define L4_BLOCK_53_BIT_29 (1UL << 29)
#define L4_BLOCK_53_BIT_30 (1UL << 30)
#define L4_BLOCK_53_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 54 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_54_TypeDef;
#define L4_BLOCK_54 ((L4_BLOCK_54_TypeDef *)(0x40008000UL + 54 * 0x400UL))

#define L4_BLOCK_54_BIT_0 (1UL << 0)
#define L4_BLOCK_54_BIT_1 (1UL << 1)
#define L4_BLOCK_54_BIT_2 (1UL << 2)
#define L4_BLOCK_54_BIT_3 (1UL << 3)
#define L4_BLOCK_54_BIT_4 (1UL << 4)
#define L4_BLOCK_54_BIT_5 (1UL << 5)
#define L4_BLOCK_54_BIT_6 (1UL << 6)
#define L4_BLOCK_54_BIT_7 (1UL << 7)
#define L4_BLOCK_54_BIT_8 (1UL << 8)
#define L4_BLOCK_54_BIT_9 (1UL << 9)
#define L4_BLOCK_54_BIT_10 (1UL << 10)
#define L4_BLOCK_54_BIT_11 (1UL << 11)
#define L4_BLOCK_54_BIT_12 (1UL << 12)
#define L4_BLOCK_54_BIT_13 (1UL << 13)
#define L4_BLOCK_54_BIT_14 (1UL << 14)
#define L4_BLOCK_54_BIT_15 (1UL << 15)
#define L4_BLOCK_54_BIT_16 (1UL << 16)
#define L4_BLOCK_54_BIT_17 (1UL << 17)
#define L4_BLOCK_54_BIT_18 (1UL << 18)
#define L4_BLOCK_54_BIT_19 (1UL << 19)
#define L4_BLOCK_54_BIT_20 (1UL << 20)
#define L4_BLOCK_54_BIT_21 (1UL << 21)
#define L4_BLOCK_54_BIT_22 (1UL << 22)
#define L4_BLOCK_54_BIT_23 (1UL << 23)
#define L4_BLOCK_54_BIT_24 (1UL << 24)
#define L4_BLOCK_54_BIT_25 (1UL << 25)
#define L4_BLOCK_54_BIT_26 (1UL << 26)
#define L4_BLOCK_54_BIT_27 (1UL << 27)
#define L4_BLOCK_54_BIT_28 (1UL << 28)
#define L4_BLOCK_54_BIT_29 (1UL << 29)
#define L4_BLOCK_54_BIT_30 (1UL << 30)
#define L4_BLOCK_54_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 55 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_55_TypeDef;
#define L4_BLOCK_55 ((L4_BLOCK_55_TypeDef *)(0x40008000UL + 55 * 0x400UL))

#define L4_BLOCK_55_BIT_0 (1UL << 0)
#define L4_BLOCK_55_BIT_1 (1UL << 1)
#define L4_BLOCK_55_BIT_2 (1UL << 2)
#define L4_BLOCK_55_BIT_3 (1UL << 3)
#define L4_BLOCK_55_BIT_4 (1UL << 4)
#define L4_BLOCK_55_BIT_5 (1UL << 5)
#define L4_BLOCK_55_BIT_6 (1UL << 6)
#define L4_BLOCK_55_BIT_7 (1UL << 7)
#define L4_BLOCK_55_BIT_8 (1UL << 8)
#define L4_BLOCK_55_BIT_9 (1UL << 9)
#define L4_BLOCK_55_BIT_10 (1UL << 10)
#define L4_BLOCK_55_BIT_11 (1UL << 11)
#define L4_BLOCK_55_BIT_12 (1UL << 12)
#define L4_BLOCK_55_BIT_13 (1UL << 13)
#define L4_BLOCK_55_BIT_14 (1UL << 14)
#define L4_BLOCK_55_BIT_15 (1UL << 15)
#define L4_BLOCK_55_BIT_16 (1UL << 16)
#define L4_BLOCK_55_BIT_17 (1UL << 17)
#define L4_BLOCK_55_BIT_18 (1UL << 18)
#define L4_BLOCK_55_BIT_19 (1UL << 19)
#define L4_BLOCK_55_BIT_20 (1UL << 20)
#define L4_BLOCK_55_BIT_21 (1UL << 21)
#define L4_BLOCK_55_BIT_22 (1UL << 22)
#define L4_BLOCK_55_BIT_23 (1UL << 23)
#define L4_BLOCK_55_BIT_24 (1UL << 24)
#define L4_BLOCK_55_BIT_25 (1UL << 25)
#define L4_BLOCK_55_BIT_26 (1UL << 26)
#define L4_BLOCK_55_BIT_27 (1UL << 27)
#define L4_BLOCK_55_BIT_28 (1UL << 28)
#define L4_BLOCK_55_BIT_29 (1UL << 29)
#define L4_BLOCK_55_BIT_30 (1UL << 30)
#define L4_BLOCK_55_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 56 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_56_TypeDef;
#define L4_BLOCK_56 ((L4_BLOCK_56_TypeDef *)(0x40008000UL + 56 * 0x400UL))

#define L4_BLOCK_56_BIT_0 (1UL << 0)
#define L4_BLOCK_56_BIT_1 (1UL << 1)
#define L4_BLOCK_56_BIT_2 (1UL << 2)
#define L4_BLOCK_56_BIT_3 (1UL << 3)
#define L4_BLOCK_56_BIT_4 (1UL << 4)
#define L4_BLOCK_56_BIT_5 (1UL << 5)
#define L4_BLOCK_56_BIT_6 (1UL << 6)
#define L4_BLOCK_56_BIT_7 (1UL << 7)
#define L4_BLOCK_56_BIT_8 (1UL << 8)
#define L4_BLOCK_56_BIT_9 (1UL << 9)
#define L4_BLOCK_56_BIT_10 (1UL << 10)
#define L4_BLOCK_56_BIT_11 (1UL << 11)
#define L4_BLOCK_56_BIT_12 (1UL << 12)
#define L4_BLOCK_56_BIT_13 (1UL << 13)
#define L4_BLOCK_56_BIT_14 (1UL << 14)
#define L4_BLOCK_56_BIT_15 (1UL << 15)
#define L4_BLOCK_56_BIT_16 (1UL << 16)
#define L4_BLOCK_56_BIT_17 (1UL << 17)
#define L4_BLOCK_56_BIT_18 (1UL << 18)
#define L4_BLOCK_56_BIT_19 (1UL << 19)
#define L4_BLOCK_56_BIT_20 (1UL << 20)
#define L4_BLOCK_56_BIT_21 (1UL << 21)
#define L4_BLOCK_56_BIT_22 (1UL << 22)
#define L4_BLOCK_56_BIT_23 (1UL << 23)
#define L4_BLOCK_56_BIT_24 (1UL << 24)
#define L4_BLOCK_56_BIT_25 (1UL << 25)
#define L4_BLOCK_56_BIT_26 (1UL << 26)
#define L4_BLOCK_56_BIT_27 (1UL << 27)
#define L4_BLOCK_56_BIT_28 (1UL << 28)
#define L4_BLOCK_56_BIT_29 (1UL << 29)
#define L4_BLOCK_56_BIT_30 (1UL << 30)
#define L4_BLOCK_56_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 57 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_57_TypeDef;
#define L4_BLOCK_57 ((L4_BLOCK_57_TypeDef *)(0x40008000UL + 57 * 0x400UL))

