RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_57_BIT_0 (1UL << 0)
#define L4_BLOCK_57_BIT_1 (1UL << 1)
#define L4_BLOCK_57_BIT_2 (1UL << 2)
#define L4_BLOCK_57_BIT_3 (1UL << 3)
#define L4_BLOCK_57_BIT_4 (1UL << 4)
#define L4_BLOCK_57_BIT_5 (1UL << 5)
#define L4_BLOCK_57_BIT_6 (1UL << 6)
#define L4_BLOCK_57_BIT_7 (1UL << 7)
#define L4_BLOCK_57_BIT_8 (1UL << 8)
#define L4_BLOCK_57_BIT_9 (1UL << 9)
#define L4_BLOCK_57_BIT_10 (1UL << 10)
#define L4_BLOCK_57_BIT_11 (1UL << 11)
#define L4_BLOCK_57_BIT_12 (1UL << 12)
#define L4_BLOCK_57_BIT_13 (1UL << 13)
#define L4_BLOCK_57_BIT_14 (1UL << 14)
#define L4_BLOCK_57_BIT_15 (1UL << 15)
#define L4_BLOCK_57_BIT_16 (1UL << 16)
#define L4_BLOCK_57_BIT_17 (1UL << 17)
#define L4_BLOCK_57_BIT_18 (1UL << 18)
#define L4_BLOCK_57_BIT_19 (1UL << 19)
#define L4_BLOCK_57_BIT_20 (1UL << 20)
#define L4_BLOCK_57_BIT_21 (1UL << 21)
#define L4_BLOCK_57_BIT_22 (1UL << 22)
#define L4_BLOCK_57_BIT_23 (1UL << 23)
#define L4_BLOCK_57_BIT_24 (1UL << 24)
#define L4_BLOCK_57_BIT_25 (1UL << 25)
#define L4_BLOCK_57_BIT_26 (1UL << 26)
#define L4_BLOCK_57_BIT_27 (1UL << 27)
#define L4_BLOCK_57_BIT_28 (1UL << 28)
#define L4_BLOCK_57_BIT_29 (1UL << 29)
#define L4_BLOCK_57_BIT_30 (1UL << 30)
#define L4_BLOCK_57_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 58 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_58_TypeDef;
#define L4_BLOCK_58 ((L4_BLOCK_58_TypeDef *)(0x40008000UL + 58 * 0x400UL))

#define L4_BLOCK_58_BIT_0 (1UL << 0)
#define L4_BLOCK_58_BIT_1 (1UL << 1)
#define L4_BLOCK_58_BIT_2 (1UL << 2)
#define L4_BLOCK_58_BIT_3 (1UL << 3)
#define L4_BLOCK_58_BIT_4 (1UL << 4)
#define L4_BLOCK_58_BIT_5 (1UL << 5)
#define L4_BLOCK_58_BIT_6 (1UL << 6)
#define L4_BLOCK_58_BIT_7 (1UL << 7)
#define L4_BLOCK_58_BIT_8 (1UL << 8)
#define L4_BLOCK_58_BIT_9 (1UL << 9)
#define L4_BLOCK_58_BIT_10 (1UL << 10)
#define L4_BLOCK_58_BIT_11 (1UL << 11)
#define L4_BLOCK_58_BIT_12 (1UL << 12)
#define L4_BLOCK_58_BIT_13 (1UL << 13)
#define L4_BLOCK_58_BIT_14 (1UL << 14)
#define L4_BLOCK_58_BIT_15 (1UL << 15)
#define L4_BLOCK_58_BIT_16 (1UL << 16)
#define L4_BLOCK_58_BIT_17 (1UL << 17)
#define L4_BLOCK_58_BIT_18 (1UL << 18)
#define L4_BLOCK_58_BIT_19 (1UL << 19)
#define L4_BLOCK_58_BIT_20 (1UL << 20)
#define L4_BLOCK_58_BIT_21 (1UL << 21)
#define L4_BLOCK_58_BIT_22 (1UL << 22)
#define L4_BLOCK_58_BIT_23 (1UL << 23)
#define L4_BLOCK_58_BIT_24 (1UL << 24)
#define L4_BLOCK_58_BIT_25 (1UL << 25)
#define L4_BLOCK_58_BIT_26 (1UL << 26)
#define L4_BLOCK_58_BIT_27 (1UL << 27)
#define L4_BLOCK_58_BIT_28 (1UL << 28)
#define L4_BLOCK_58_BIT_29 (1UL << 29)
#define L4_BLOCK_58_BIT_30 (1UL << 30)
#define L4_BLOCK_58_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 59 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_59_TypeDef;
#define L4_BLOCK_59 ((L4_BLOCK_59_TypeDef *)(0x40008000UL + 59 * 0x400UL))

#define L4_BLOCK_59_BIT_0 (1UL << 0)
#define L4_BLOCK_59_BIT_1 (1UL << 1)
#define L4_BLOCK_59_BIT_2 (1UL << 2)
#define L4_BLOCK_59_BIT_3 (1UL << 3)
#define L4_BLOCK_59_BIT_4 (1UL << 4)
#define L4_BLOCK_59_BIT_5 (1UL << 5)
#define L4_BLOCK_59_BIT_6 (1UL << 6)
#define L4_BLOCK_59_BIT_7 (1UL << 7)
#define L4_BLOCK_59_BIT_8 (1UL << 8)
#define L4_BLOCK_59_BIT_9 (1UL << 9)
#define L4_BLOCK_59_BIT_10 (1UL << 10)
#define L4_BLOCK_59_BIT_11 (1UL << 11)
#define L4_BLOCK_59_BIT_12 (1UL << 12)
#define L4_BLOCK_59_BIT_13 (1UL << 13)
#define L4_BLOCK_59_BIT_14 (1UL << 14)
#define L4_BLOCK_59_BIT_15 (1UL << 15)
#define L4_BLOCK_59_BIT_16 (1UL << 16)
#define L4_BLOCK_59_BIT_17 (1UL << 17)
#define L4_BLOCK_59_BIT_18 (1UL << 18)
#define L4_BLOCK_59_BIT_19 (1UL << 19)
#define L4_BLOCK_59_BIT_20 (1UL << 20)
#define L4_BLOCK_59_BIT_21 (1UL << 21)
#define L4_BLOCK_59_BIT_22 (1UL << 22)
#define L4_BLOCK_59_BIT_23 (1UL << 23)
#define L4_BLOCK_59_BIT_24 (1UL << 24)
#define L4_BLOCK_59_BIT_25 (1UL << 25)
#define L4_BLOCK_59_BIT_26 (1UL << 26)
#define L4_BLOCK_59_BIT_27 (1UL << 27)
#define L4_BLOCK_59_BIT_28 (1UL << 28)
#define L4_BLOCK_59_BIT_29 (1UL << 29)
#define L4_BLOCK_59_BIT_30 (1UL << 30)
#define L4_BLOCK_59_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 60 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_60_TypeDef;
#define L4_BLOCK_60 ((L4_BLOCK_60_TypeDef *)(0x40008000UL + 60 * 0x400UL))

#define L4_BLOCK_60_BIT_0 (1UL << 0)
#define L4_BLOCK_60_BIT_1 (1UL << 1)
#define L4_BLOCK_60_BIT_2 (1UL << 2)
#define L4_BLOCK_60_BIT_3 (1UL << 3)
#define L4_BLOCK_60_BIT_4 (1UL << 4)
#define L4_BLOCK_60_BIT_5 (1UL << 5)
#define L4_BLOCK_60_BIT_6 (1UL << 6)
#define L4_BLOCK_60_BIT_7 (1UL << 7)
#define L4_BLOCK_60_BIT_8 (1UL << 8)
#define L4_BLOCK_60_BIT_9 (1UL << 9)
#define L4_BLOCK_60_BIT_10 (1UL << 10)
#define L4_BLOCK_60_BIT_11 (1UL << 11)
#define L4_BLOCK_60_BIT_12 (1UL << 12)
#define L4_BLOCK_60_BIT_13 (1UL << 13)
#define L4_BLOCK_60_BIT_14 (1UL << 14)
#define L4_BLOCK_60_BIT_15 (1UL << 15)
#define L4_BLOCK_60_BIT_16 (1UL << 16)
#define L4_BLOCK_60_BIT_17 (1UL << 17)
#define L4_BLOCK_60_BIT_18 (1UL << 18)
#define L4_BLOCK_60_BIT_19 (1UL << 19)
#define L4_BLOCK_60_BIT_20 (1UL << 20)
#define L4_BLOCK_60_BIT_21 (1UL << 21)
#define L4_BLOCK_60_BIT_22 (1UL << 22)
#define L4_BLOCK_60_BIT_23 (1UL << 23)
#define L4_BLOCK_60_BIT_24 (1UL << 24)
#define L4_BLOCK_60_BIT_25 (1UL << 25)
#define L4_BLOCK_60_BIT_26 (1UL << 26)
#define L4_BLOCK_60_BIT_27 (1UL << 27)
#define L4_BLOCK_60_BIT_28 (1UL << 28)
#define L4_BLOCK_60_BIT_29 (1UL << 29)
#define L4_BLOCK_60_BIT_30 (1UL << 30)
#define L4_BLOCK_60_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 61 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_61_TypeDef;
#define L4_BLOCK_61 ((L4_BLOCK_61_TypeDef *)(0x40008000UL + 61 * 0x400UL))

#define L4_BLOCK_61_BIT_0 (1UL << 0)
#define L4_BLOCK_61_BIT_1 (1UL << 1)
#define L4_BLOCK_61_BIT_2 (1UL << 2)
#define L4_BLOCK_61_BIT_3 (1UL << 3)
#define L4_BLOCK_61_BIT_4 (1UL << 4)
#define L4_BLOCK_61_BIT_5 (1UL << 5)
#define L4_BLOCK_61_BIT_6 (1UL << 6)
#define L4_BLOCK_61_BIT_7 (1UL << 7)
#define L4_BLOCK_61_BIT_8 (1UL << 8)
#define L4_BLOCK_61_BIT_9 (1UL << 9)
#define L4_BLOCK_61_BIT_10 (1UL << 10)
#define L4_BLOCK_61_BIT_11 (1UL << 11)
#define L4_BLOCK_61_BIT_12 (1UL << 12)
#define L4_BLOCK_61_BIT_13 (1UL << 13)
#define L4_BLOCK_61_BIT_14 (1UL << 14)
#define L4_BLOCK_61_BIT_15 (1UL << 15)
#define L4_BLOCK_61_BIT_16 (1UL << 16)
#define L4_BLOCK_61_BIT_17 (1UL << 17)
#define L4_BLOCK_61_BIT_18 (1UL << 18)
#define L4_BLOCK_61_BIT_19 (1UL << 19)
#define L4_BLOCK_61_BIT_20 (1UL << 20)
#define L4_BLOCK_61_BIT_21 (1UL << 21)
#define L4_BLOCK_61_BIT_22 (1UL << 22)
#define L4_BLOCK_61_BIT_23 (1UL << 23)
#define L4_BLOCK_61_BIT_24 (1UL << 24)
#define L4_BLOCK_61_BIT_25 (1UL << 25)
#define L4_BLOCK_61_BIT_26 (1UL << 26)
#define L4_BLOCK_61_BIT_27 (1UL << 27)
#define L4_BLOCK_61_BIT_28 (1UL << 28)
#define L4_BLOCK_61_BIT_29 (1UL << 29)
#define L4_BLOCK_61_BIT_30 (1UL << 30)
#define L4_BLOCK_61_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 62 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_62_TypeDef;
#define L4_BLOCK_62 ((L4_BLOCK_62_TypeDef *)(0x40008000UL + 62 * 0x400UL))

#define L4_BLOCK_62_BIT_0 (1UL << 0)
#define L4_BLOCK_62_BIT_1 (1UL << 1)
#define L4_BLOCK_62_BIT_2 (1UL << 2)
#define L4_BLOCK_62_BIT_3 (1UL << 3)
#define L4_BLOCK_62_BIT_4 (1UL << 4)
#define L4_BLOCK_62_BIT_5 (1UL << 5)
#define L4_BLOCK_62_BIT_6 (1UL << 6)
#define L4_BLOCK_62_BIT_7 (1UL << 7)
#define L4_BLOCK_62_BIT_8 (1UL << 8)
#define L4_BLOCK_62_BIT_9 (1UL << 9)
#define L4_BLOCK_62_BIT_10 (1UL << 10)
#define L4_BLOCK_62_BIT_11 (1UL << 11)
#define L4_BLOCK_62_BIT_12 (1UL << 12)
#define L4_BLOCK_62_BIT_13 (1UL << 13)
#define L4_BLOCK_62_BIT_14 (1UL << 14)
#define L4_BLOCK_62_BIT_15 (1UL << 15)
#define L4_BLOCK_62_BIT_16 (1UL << 16)
#define L4_BLOCK_62_BIT_17 (1UL << 17)
#define L4_BLOCK_62_BIT_18 (1UL << 18)
#define L4_BLOCK_62_BIT_19 (1UL << 19)
#define L4_BLOCK_62_BIT_20 (1UL << 20)
#define L4_BLOCK_62_BIT_21 (1UL << 21)
#define L4_BLOCK_62_BIT_22 (1UL << 22)
#define L4_BLOCK_62_BIT_23 (1UL << 23)
#define L4_BLOCK_62_BIT_24 (1UL << 24)
#define L4_BLOCK_62_BIT_25 (1UL << 25)
#define L4_BLOCK_62_BIT_26 (1UL << 26)
#define L4_BLOCK_62_BIT_27 (1UL << 27)
#define L4_BLOCK_62_BIT_28 (1UL << 28)
#define L4_BLOCK_62_BIT_29 (1UL << 29)
#define L4_BLOCK_62_BIT_30 (1UL << 30)
#define L4_BLOCK_62_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 63 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_63_TypeDef;
#define L4_BLOCK_63 ((L4_BLOCK_63_TypeDef *)(0x40008000UL + 63 * 0x400UL))

#define L4_BLOCK_63_BIT_0 (1UL << 0)
#define L4_BLOCK_63_BIT_1 (1UL << 1)
#define L4_BLOCK_63_BIT_2 (1UL << 2)
#define L4_BLOCK_63_BIT_3 (1UL << 3)
#define L4_BLOCK_63_BIT_4 (1UL << 4)
#define L4_BLOCK_63_BIT_5 (1UL << 5)
#define L4_BLOCK_63_BIT_6 (1UL << 6)
#define L4_BLOCK_63_BIT_7 (1UL << 7)
#define L4_BLOCK_63_BIT_8 (1UL << 8)
#define L4_BLOCK_63_BIT_9 (1UL << 9)
#define L4_BLOCK_63_BIT_10 (1UL << 10)
#define L4_BLOCK_63_BIT_11 (1UL << 11)
#define L4_BLOCK_63_BIT_12 (1UL << 12)
#define L4_BLOCK_63_BIT_13 (1UL << 13)
#define L4_BLOCK_63_BIT_14 (1UL << 14)
#define L4_BLOCK_63_BIT_15 (1UL << 15)
#define L4_BLOCK_63_BIT_16 (1UL << 16)
#define L4_BLOCK_63_BIT_17 (1UL << 17)
#define L4_BLOCK_63_BIT_18 (1UL << 18)
#define L4_BLOCK_63_BIT_19 (1UL << 19)
#define L4_BLOCK_63_BIT_20 (1UL << 20)
#define L4_BLOCK_63_BIT_21 (1UL << 21)
#define L4_BLOCK_63_BIT_22 (1UL << 22)
#define L4_BLOCK_63_BIT_23 (1UL << 23)
#define L4_BLOCK_63_BIT_24 (1UL << 24)
#define L4_BLOCK_63_BIT_25 (1UL << 25)
#define L4_BLOCK_63_BIT_26 (1UL << 26)
#define L4_BLOCK_63_BIT_27 (1UL << 27)
#define L4_BLOCK_63_BIT_28 (1UL << 28)
#define L4_BLOCK_63_BIT_29 (1UL << 29)
#define L4_BLOCK_63_BIT_30 (1UL << 30)
#define L4_BLOCK_63_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 64 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_64_TypeDef;
#define L4_BLOCK_64 ((L4_BLOCK_64_TypeDef *)(0x40008000UL + 64 * 0x400UL))

#define L4_BLOCK_64_BIT_0 (1UL << 0)
#define L4_BLOCK_64_BIT_1 (1UL << 1)
#define L4_BLOCK_64_BIT_2 (1UL << 2)
#define L4_BLOCK_64_BIT_3 (1UL << 3)
#define L4_BLOCK_64_BIT_4 (1UL << 4)
#define L4_BLOCK_64_BIT_5 (1UL << 5)
#define L4_BLOCK_64_BIT_6 (1UL << 6)
#define L4_BLOCK_64_BIT_7 (1UL << 7)
#define L4_BLOCK_64_BIT_8 (1UL << 8)
#define L4_BLOCK_64_BIT_9 (1UL << 9)
#define L4_BLOCK_64_BIT_10 (1UL << 10)
#define L4_BLOCK_64_BIT_11 (1UL << 11)
#define L4_BLOCK_64_BIT_12 (1UL << 12)
#define L4_BLOCK_64_BIT_13 (1UL << 13)
#define L4_BLOCK_64_BIT_14 (1UL << 14)
#define L4_BLOCK_64_BIT_15 (1UL << 15)
#define L4_BLOCK_64_BIT_16 (1UL << 16)
#define L4_BLOCK_64_BIT_17 (1UL << 17)
#define L4_BLOCK_64_BIT_18 (1UL << 18)
#define L4_BLOCK_64_BIT_19 (1UL << 19)
#define L4_BLOCK_64_BIT_20 (1UL << 20)
#define L4_BLOCK_64_BIT_21 (1UL << 21)
#define L4_BLOCK_64_BIT_22 (1UL << 22)
#define L4_BLOCK_64_BIT_23 (1UL << 23)
#define L4_BLOCK_64_BIT_24 (1UL << 24)
#define L4_BLOCK_64_BIT_25 (1UL << 25)
#define L4_BLOCK_64_BIT_26 (1UL << 26)
#define L4_BLOCK_64_BIT_27 (1UL << 27)
#define L4_BLOCK_64_BIT_28 (1UL << 28)
#define L4_BLOCK_64_BIT_29 (1UL << 29)
#define L4_BLOCK_64_BIT_30 (1UL << 30)
#define L4_BLOCK_64_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 65 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_65_TypeDef;
#define L4_BLOCK_65 ((L4_BLOCK_65_TypeDef *)(0x40008000UL + 65 * 0x400UL))

#define L4_BLOCK_65_BIT_0 (1UL << 0)
#define L4_BLOCK_65_BIT_1 (1UL << 1)
#define L4_BLOCK_65_BIT_2 (1UL << 2)
#define L4_BLOCK_65_BIT_3 (1UL << 3)
#define L4_BLOCK_65_BIT_4 (1UL << 4)
#define L4_BLOCK_65_BIT_5 (1UL << 5)
#define L4_BLOCK_65_BIT_6 (1UL << 6)
#define L4_BLOCK_65_BIT_7 (1UL << 7)
#define L4_BLOCK_65_BIT_8 (1UL << 8)
#define L4_BLOCK_65_BIT_9 (1UL << 9)
#define L4_BLOCK_65_BIT_10 (1UL << 10)
#define L4_BLOCK_65_BIT_11 (1UL << 11)
#define L4_BLOCK_65_BIT_12 (1UL << 12)
#define L4_BLOCK_65_BIT_13 (1UL << 13)
#define L4_BLOCK_65_BIT_14 (1UL << 14)
#define L4_BLOCK_65_BIT_15 (1UL << 15)
#define L4_BLOCK_65_BIT_16 (1UL << 16)
#define L4_BLOCK_65_BIT_17 (1UL << 17)
#define L4_BLOCK_65_BIT_18 (1UL << 18)
#define L4_BLOCK_65_BIT_19 (1UL << 19)
#define L4_BLOCK_65_BIT_20 (1UL << 20)
#define L4_BLOCK_65_BIT_21 (1UL << 21)
#define L4_BLOCK_65_BIT_22 (1UL << 22)
#define L4_BLOCK_65_BIT_23 (1UL << 23)
#define L4_BLOCK_65_BIT_24 (1UL << 24)
#define L4_BLOCK_65_BIT_25 (1UL << 25)
#define L4_BLOCK_65_BIT_26 (1UL << 26)
#define L4_BLOCK_65_BIT_27 (1UL << 27)
#define L4_BLOCK_65_BIT_28 (1UL << 28)
#define L4_BLOCK_65_BIT_29 (1UL << 29)
#define L4_BLOCK_65_BIT_30 (1UL << 30)
#define L4_BLOCK_65_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 66 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_66_TypeDef;
#define L4_BLOCK_66 ((L4_BLOCK_66_TypeDef *)(0x40008000UL + 66 * 0x400UL))

