RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_66_BIT_0 (1UL << 0)
#define L4_BLOCK_66_BIT_1 (1UL << 1)
#define L4_BLOCK_66_BIT_2 (1UL << 2)
#define L4_BLOCK_66_BIT_3 (1UL << 3)
#define L4_BLOCK_66_BIT_4 (1UL << 4)
#define L4_BLOCK_66_BIT_5 (1UL << 5)
#define L4_BLOCK_66_BIT_6 (1UL << 6)
#define L4_BLOCK_66_BIT_7 (1UL << 7)
#define L4_BLOCK_66_BIT_8 (1UL << 8)
#define L4_BLOCK_66_BIT_9 (1UL << 9)
#define L4_BLOCK_66_BIT_10 (1UL << 10)
#define L4_BLOCK_66_BIT_11 (1UL << 11)
#define L4_BLOCK_66_BIT_12 (1UL << 12)
#define L4_BLOCK_66_BIT_13 (1UL << 13)
#define L4_BLOCK_66_BIT_14 (1UL << 14)
#define L4_BLOCK_66_BIT_15 (1UL << 15)
#define L4_BLOCK_66_BIT_16 (1UL << 16)
#define L4_BLOCK_66_BIT_17 (1UL << 17)
#define L4_BLOCK_66_BIT_18 (1UL << 18)
#define L4_BLOCK_66_BIT_19 (1UL << 19)
#define L4_BLOCK_66_BIT_20 (1UL << 20)
#define L4_BLOCK_66_BIT_21 (1UL << 21)
#define L4_BLOCK_66_BIT_22 (1UL << 22)
#define L4_BLOCK_66_BIT_23 (1UL << 23)
#define L4_BLOCK_66_BIT_24 (1UL << 24)
#define L4_BLOCK_66_BIT_25 (1UL << 25)
#define L4_BLOCK_66_BIT_26 (1UL << 26)
#define L4_BLOCK_66_BIT_27 (1UL << 27)
#define L4_BLOCK_66_BIT_28 (1UL << 28)
#define L4_BLOCK_66_BIT_29 (1UL << 29)
#define L4_BLOCK_66_BIT_30 (1UL << 30)
#define L4_BLOCK_66_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 67 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_67_TypeDef;
#define L4_BLOCK_67 ((L4_BLOCK_67_TypeDef *)(0x40008000UL + 67 * 0x400UL))

#define L4_BLOCK_67_BIT_0 (1UL << 0)
#define L4_BLOCK_67_BIT_1 (1UL << 1)
#define L4_BLOCK_67_BIT_2 (1UL << 2)
#define L4_BLOCK_67_BIT_3 (1UL << 3)
#define L4_BLOCK_67_BIT_4 (1UL << 4)
#define L4_BLOCK_67_BIT_5 (1UL << 5)
#define L4_BLOCK_67_BIT_6 (1UL << 6)
#define L4_BLOCK_67_BIT_7 (1UL << 7)
#define L4_BLOCK_67_BIT_8 (1UL << 8)
#define L4_BLOCK_67_BIT_9 (1UL << 9)
#define L4_BLOCK_67_BIT_10 (1UL << 10)
#define L4_BLOCK_67_BIT_11 (1UL << 11)
#define L4_BLOCK_67_BIT_12 (1UL << 12)
#define L4_BLOCK_67_BIT_13 (1UL << 13)
#define L4_BLOCK_67_BIT_14 (1UL << 14)
#define L4_BLOCK_67_BIT_15 (1UL << 15)
#define L4_BLOCK_67_BIT_16 (1UL << 16)
#define L4_BLOCK_67_BIT_17 (1UL << 17)
#define L4_BLOCK_67_BIT_18 (1UL << 18)
#define L4_BLOCK_67_BIT_19 (1UL << 19)
#define L4_BLOCK_67_BIT_20 (1UL << 20)
#define L4_BLOCK_67_BIT_21 (1UL << 21)
#define L4_BLOCK_67_BIT_22 (1UL << 22)
#define L4_BLOCK_67_BIT_23 (1UL << 23)
#define L4_BLOCK_67_BIT_24 (1UL << 24)
#define L4_BLOCK_67_BIT_25 (1UL << 25)
#define L4_BLOCK_67_BIT_26 (1UL << 26)
#define L4_BLOCK_67_BIT_27 (1UL << 27)
#define L4_BLOCK_67_BIT_28 (1UL << 28)
#define L4_BLOCK_67_BIT_29 (1UL << 29)
#define L4_BLOCK_67_BIT_30 (1UL << 30)
#define L4_BLOCK_67_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 68 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_68_TypeDef;
#define L4_BLOCK_68 ((L4_BLOCK_68_TypeDef *)(0x40008000UL + 68 * 0x400UL))

#define L4_BLOCK_68_BIT_0 (1UL << 0)
#define L4_BLOCK_68_BIT_1 (1UL << 1)
#define L4_BLOCK_68_BIT_2 (1UL << 2)
#define L4_BLOCK_68_BIT_3 (1UL << 3)
#define L4_BLOCK_68_BIT_4 (1UL << 4)
#define L4_BLOCK_68_BIT_5 (1UL << 5)
#define L4_BLOCK_68_BIT_6 (1UL << 6)
#define L4_BLOCK_68_BIT_7 (1UL << 7)
#define L4_BLOCK_68_BIT_8 (1UL << 8)
#define L4_BLOCK_68_BIT_9 (1UL << 9)
#define L4_BLOCK_68_BIT_10 (1UL << 10)
#define L4_BLOCK_68_BIT_11 (1UL << 11)
#define L4_BLOCK_68_BIT_12 (1UL << 12)
#define L4_BLOCK_68_BIT_13 (1UL << 13)
#define L4_BLOCK_68_BIT_14 (1UL << 14)
#define L4_BLOCK_68_BIT_15 (1UL << 15)
#define L4_BLOCK_68_BIT_16 (1UL << 16)
#define L4_BLOCK_68_BIT_17 (1UL << 17)
#define L4_BLOCK_68_BIT_18 (1UL << 18)
#define L4_BLOCK_68_BIT_19 (1UL << 19)
#define L4_BLOCK_68_BIT_20 (1UL << 20)
#define L4_BLOCK_68_BIT_21 (1UL << 21)
#define L4_BLOCK_68_BIT_22 (1UL << 22)
#define L4_BLOCK_68_BIT_23 (1UL << 23)
#define L4_BLOCK_68_BIT_24 (1UL << 24)
#define L4_BLOCK_68_BIT_25 (1UL << 25)
#define L4_BLOCK_68_BIT_26 (1UL << 26)
#define L4_BLOCK_68_BIT_27 (1UL << 27)
#define L4_BLOCK_68_BIT_28 (1UL << 28)
#define L4_BLOCK_68_BIT_29 (1UL << 29)
#define L4_BLOCK_68_BIT_30 (1UL << 30)
#define L4_BLOCK_68_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 69 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_69_TypeDef;
#define L4_BLOCK_69 ((L4_BLOCK_69_TypeDef *)(0x40008000UL + 69 * 0x400UL))

#define L4_BLOCK_69_BIT_0 (1UL << 0)
#define L4_BLOCK_69_BIT_1 (1UL << 1)
#define L4_BLOCK_69_BIT_2 (1UL << 2)
#define L4_BLOCK_69_BIT_3 (1UL << 3)
#define L4_BLOCK_69_BIT_4 (1UL << 4)
#define L4_BLOCK_69_BIT_5 (1UL << 5)
#define L4_BLOCK_69_BIT_6 (1UL << 6)
#define L4_BLOCK_69_BIT_7 (1UL << 7)
#define L4_BLOCK_69_BIT_8 (1UL << 8)
#define L4_BLOCK_69_BIT_9 (1UL << 9)
#define L4_BLOCK_69_BIT_10 (1UL << 10)
#define L4_BLOCK_69_BIT_11 (1UL << 11)
#define L4_BLOCK_69_BIT_12 (1UL << 12)
#define L4_BLOCK_69_BIT_13 (1UL << 13)
#define L4_BLOCK_69_BIT_14 (1UL << 14)
#define L4_BLOCK_69_BIT_15 (1UL << 15)
#define L4_BLOCK_69_BIT_16 (1UL << 16)
#define L4_BLOCK_69_BIT_17 (1UL << 17)
#define L4_BLOCK_69_BIT_18 (1UL << 18)
#define L4_BLOCK_69_BIT_19 (1UL << 19)
#define L4_BLOCK_69_BIT_20 (1UL << 20)
#define L4_BLOCK_69_BIT_21 (1UL << 21)
#define L4_BLOCK_69_BIT_22 (1UL << 22)
#define L4_BLOCK_69_BIT_23 (1UL << 23)
#define L4_BLOCK_69_BIT_24 (1UL << 24)
#define L4_BLOCK_69_BIT_25 (1UL << 25)
#define L4_BLOCK_69_BIT_26 (1UL << 26)
#define L4_BLOCK_69_BIT_27 (1UL << 27)
#define L4_BLOCK_69_BIT_28 (1UL << 28)
#define L4_BLOCK_69_BIT_29 (1UL << 29)
#define L4_BLOCK_69_BIT_30 (1UL << 30)
#define L4_BLOCK_69_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 70 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_70_TypeDef;
#define L4_BLOCK_70 ((L4_BLOCK_70_TypeDef *)(0x40008000UL + 70 * 0x400UL))

#define L4_BLOCK_70_BIT_0 (1UL << 0)
#define L4_BLOCK_70_BIT_1 (1UL << 1)
#define L4_BLOCK_70_BIT_2 (1UL << 2)
#define L4_BLOCK_70_BIT_3 (1UL << 3)
#define L4_BLOCK_70_BIT_4 (1UL << 4)
#define L4_BLOCK_70_BIT_5 (1UL << 5)
#define L4_BLOCK_70_BIT_6 (1UL << 6)
#define L4_BLOCK_70_BIT_7 (1UL << 7)
#define L4_BLOCK_70_BIT_8 (1UL << 8)
#define L4_BLOCK_70_BIT_9 (1UL << 9)
#define L4_BLOCK_70_BIT_10 (1UL << 10)
#define L4_BLOCK_70_BIT_11 (1UL << 11)
#define L4_BLOCK_70_BIT_12 (1UL << 12)
#define L4_BLOCK_70_BIT_13 (1UL << 13)
#define L4_BLOCK_70_BIT_14 (1UL << 14)
#define L4_BLOCK_70_BIT_15 (1UL << 15)
#define L4_BLOCK_70_BIT_16 (1UL << 16)
#define L4_BLOCK_70_BIT_17 (1UL << 17)
#define L4_BLOCK_70_BIT_18 (1UL << 18)
#define L4_BLOCK_70_BIT_19 (1UL << 19)
#define L4_BLOCK_70_BIT_20 (1UL << 20)
#define L4_BLOCK_70_BIT_21 (1UL << 21)
#define L4_BLOCK_70_BIT_22 (1UL << 22)
#define L4_BLOCK_70_BIT_23 (1UL << 23)
#define L4_BLOCK_70_BIT_24 (1UL << 24)
#define L4_BLOCK_70_BIT_25 (1UL << 25)
#define L4_BLOCK_70_BIT_26 (1UL << 26)
#define L4_BLOCK_70_BIT_27 (1UL << 27)
#define L4_BLOCK_70_BIT_28 (1UL << 28)
#define L4_BLOCK_70_BIT_29 (1UL << 29)
#define L4_BLOCK_70_BIT_30 (1UL << 30)
#define L4_BLOCK_70_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 71 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_71_TypeDef;
#define L4_BLOCK_71 ((L4_BLOCK_71_TypeDef *)(0x40008000UL + 71 * 0x400UL))

