RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_71_BIT_0 (1UL << 0)
#define L4_BLOCK_71_BIT_1 (1UL << 1)
#define L4_BLOCK_71_BIT_2 (1UL << 2)
#define L4_BLOCK_71_BIT_3 (1UL << 3)
#define L4_BLOCK_71_BIT_4 (1UL << 4)
#define L4_BLOCK_71_BIT_5 (1UL << 5)
#define L4_BLOCK_71_BIT_6 (1UL << 6)
#define L4_BLOCK_71_BIT_7 (1UL << 7)
#define L4_BLOCK_71_BIT_8 (1UL << 8)
#define L4_BLOCK_71_BIT_9 (1UL << 9)
#define L4_BLOCK_71_BIT_10 (1UL << 10)
#define L4_BLOCK_71_BIT_11 (1UL << 11)
#define L4_BLOCK_71_BIT_12 (1UL << 12)
#define L4_BLOCK_71_BIT_13 (1UL << 13)
#define L4_BLOCK_71_BIT_14 (1UL << 14)
#define L4_BLOCK_71_BIT_15 (1UL << 15)
#define L4_BLOCK_71_BIT_16 (1UL << 16)
#define L4_BLOCK_71_BIT_17 (1UL << 17)
#define L4_BLOCK_71_BIT_18 (1UL << 18)
#define L4_BLOCK_71_BIT_19 (1UL << 19)
#define L4_BLOCK_71_BIT_20 (1UL << 20)
#define L4_BLOCK_71_BIT_21 (1UL << 21)
#define L4_BLOCK_71_BIT_22 (1UL << 22)
#define L4_BLOCK_71_BIT_23 (1UL << 23)
#define L4_BLOCK_71_BIT_24 (1UL << 24)
#define L4_BLOCK_71_BIT_25 (1UL << 25)
#define L4_BLOCK_71_BIT_26 (1UL << 26)
#define L4_BLOCK_71_BIT_27 (1UL << 27)
#define L4_BLOCK_71_BIT_28 (1UL << 28)
#define L4_BLOCK_71_BIT_29 (1UL << 29)
#define L4_BLOCK_71_BIT_30 (1UL << 30)
#define L4_BLOCK_71_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 72 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_72_TypeDef;
#define L4_BLOCK_72 ((L4_BLOCK_72_TypeDef *)(0x40008000UL + 72 * 0x400UL))

#define L4_BLOCK_72_BIT_0 (1UL << 0)
#define L4_BLOCK_72_BIT_1 (1UL << 1)
#define L4_BLOCK_72_BIT_2 (1UL << 2)
#define L4_BLOCK_72_BIT_3 (1UL << 3)
#define L4_BLOCK_72_BIT_4 (1UL << 4)
#define L4_BLOCK_72_BIT_5 (1UL << 5)
#define L4_BLOCK_72_BIT_6 (1UL << 6)
#define L4_BLOCK_72_BIT_7 (1UL << 7)
#define L4_BLOCK_72_BIT_8 (1UL << 8)
#define L4_BLOCK_72_BIT_9 (1UL << 9)
#define L4_BLOCK_72_BIT_10 (1UL << 10)
#define L4_BLOCK_72_BIT_11 (1UL << 11)
#define L4_BLOCK_72_BIT_12 (1UL << 12)
#define L4_BLOCK_72_BIT_13 (1UL << 13)
#define L4_BLOCK_72_BIT_14 (1UL << 14)
#define L4_BLOCK_72_BIT_15 (1UL << 15)
#define L4_BLOCK_72_BIT_16 (1UL << 16)
#define L4_BLOCK_72_BIT_17 (1UL << 17)
#define L4_BLOCK_72_BIT_18 (1UL << 18)
#define L4_BLOCK_72_BIT_19 (1UL << 19)
#define L4_BLOCK_72_BIT_20 (1UL << 20)
#define L4_BLOCK_72_BIT_21 (1UL << 21)
#define L4_BLOCK_72_BIT_22 (1UL << 22)
#define L4_BLOCK_72_BIT_23 (1UL << 23)
#define L4_BLOCK_72_BIT_24 (1UL << 24)
#define L4_BLOCK_72_BIT_25 (1UL << 25)
#define L4_BLOCK_72_BIT_26 (1UL << 26)
#define L4_BLOCK_72_BIT_27 (1UL << 27)
#define L4_BLOCK_72_BIT_28 (1UL << 28)
#define L4_BLOCK_72_BIT_29 (1UL << 29)
#define L4_BLOCK_72_BIT_30 (1UL << 30)
#define L4_BLOCK_72_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 73 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_73_TypeDef;
#define L4_BLOCK_73 ((L4_BLOCK_73_TypeDef *)(0x40008000UL + 73 * 0x400UL))

#define L4_BLOCK_73_BIT_0 (1UL << 0)
#define L4_BLOCK_73_BIT_1 (1UL << 1)
#define L4_BLOCK_73_BIT_2 (1UL << 2)
#define L4_BLOCK_73_BIT_3 (1UL << 3)
#define L4_BLOCK_73_BIT_4 (1UL << 4)
#define L4_BLOCK_73_BIT_5 (1UL << 5)
#define L4_BLOCK_73_BIT_6 (1UL << 6)
#define L4_BLOCK_73_BIT_7 (1UL << 7)
#define L4_BLOCK_73_BIT_8 (1UL << 8)
#define L4_BLOCK_73_BIT_9 (1UL << 9)
#define L4_BLOCK_73_BIT_10 (1UL << 10)
#define L4_BLOCK_73_BIT_11 (1UL << 11)
#define L4_BLOCK_73_BIT_12 (1UL << 12)
#define L4_BLOCK_73_BIT_13 (1UL << 13)
#define L4_BLOCK_73_BIT_14 (1UL << 14)
#define L4_BLOCK_73_BIT_15 (1UL << 15)
#define L4_BLOCK_73_BIT_16 (1UL << 16)
#define L4_BLOCK_73_BIT_17 (1UL << 17)
#define L4_BLOCK_73_BIT_18 (1UL << 18)
#define L4_BLOCK_73_BIT_19 (1UL << 19)
#define L4_BLOCK_73_BIT_20 (1UL << 20)
#define L4_BLOCK_73_BIT_21 (1UL << 21)
#define L4_BLOCK_73_BIT_22 (1UL << 22)
#define L4_BLOCK_73_BIT_23 (1UL << 23)
#define L4_BLOCK_73_BIT_24 (1UL << 24)
#define L4_BLOCK_73_BIT_25 (1UL << 25)
#define L4_BLOCK_73_BIT_26 (1UL << 26)
#define L4_BLOCK_73_BIT_27 (1UL << 27)
#define L4_BLOCK_73_BIT_28 (1UL << 28)
#define L4_BLOCK_73_BIT_29 (1UL << 29)
#define L4_BLOCK_73_BIT_30 (1UL << 30)
#define L4_BLOCK_73_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 74 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_74_TypeDef;
#define L4_BLOCK_74 ((L4_BLOCK_74_TypeDef *)(0x40008000UL + 74 * 0x400UL))

#define L4_BLOCK_74_BIT_0 (1UL << 0)
#define L4_BLOCK_74_BIT_1 (1UL << 1)
#define L4_BLOCK_74_BIT_2 (1UL << 2)
#define L4_BLOCK_74_BIT_3 (1UL << 3)
#define L4_BLOCK_74_BIT_4 (1UL << 4)
#define L4_BLOCK_74_BIT_5 (1UL << 5)
#define L4_BLOCK_74_BIT_6 (1UL << 6)
#define L4_BLOCK_74_BIT_7 (1UL << 7)
#define L4_BLOCK_74_BIT_8 (1UL << 8)
#define L4_BLOCK_74_BIT_9 (1UL << 9)
#define L4_BLOCK_74_BIT_10 (1UL << 10)
#define L4_BLOCK_74_BIT_11 (1UL << 11)
#define L4_BLOCK_74_BIT_12 (1UL << 12)
#define L4_BLOCK_74_BIT_13 (1UL << 13)
#define L4_BLOCK_74_BIT_14 (1UL << 14)
#define L4_BLOCK_74_BIT_15 (1UL << 15)
#define L4_BLOCK_74_BIT_16 (1UL << 16)
#define L4_BLOCK_74_BIT_17 (1UL << 17)
#define L4_BLOCK_74_BIT_18 (1UL << 18)
#define L4_BLOCK_74_BIT_19 (1UL << 19)
#define L4_BLOCK_74_BIT_20 (1UL << 20)
#define L4_BLOCK_74_BIT_21 (1UL << 21)
#define L4_BLOCK_74_BIT_22 (1UL << 22)
#define L4_BLOCK_74_BIT_23 (1UL << 23)
#define L4_BLOCK_74_BIT_24 (1UL << 24)
#define L4_BLOCK_74_BIT_25 (1UL << 25)
#define L4_BLOCK_74_BIT_26 (1UL << 26)
#define L4_BLOCK_74_BIT_27 (1UL << 27)
#define L4_BLOCK_74_BIT_28 (1UL << 28)
#define L4_BLOCK_74_BIT_29 (1UL << 29)
#define L4_BLOCK_74_BIT_30 (1UL << 30)
#define L4_BLOCK_74_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 75 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_75_TypeDef;
#define L4_BLOCK_75 ((L4_BLOCK_75_TypeDef *)(0x40008000UL + 75 * 0x400UL))

#define L4_BLOCK_75_BIT_0 (1UL << 0)
#define L4_BLOCK_75_BIT_1 (1UL << 1)
#define L4_BLOCK_75_BIT_2 (1UL << 2)
#define L4_BLOCK_75_BIT_3 (1UL << 3)
#define L4_BLOCK_75_BIT_4 (1UL << 4)
#define L4_BLOCK_75_BIT_5 (1UL << 5)
#define L4_BLOCK_75_BIT_6 (1UL << 6)
#define L4_BLOCK_75_BIT_7 (1UL << 7)
#define L4_BLOCK_75_BIT_8 (1UL << 8)
#define L4_BLOCK_75_BIT_9 (1UL << 9)
#define L4_BLOCK_75_BIT_10 (1UL << 10)
#define L4_BLOCK_75_BIT_11 (1UL << 11)
#define L4_BLOCK_75_BIT_12 (1UL << 12)
#define L4_BLOCK_75_BIT_13 (1UL << 13)
#define L4_BLOCK_75_BIT_14 (1UL << 14)
#define L4_BLOCK_75_BIT_15 (1UL << 15)
#define L4_BLOCK_75_BIT_16 (1UL << 16)
#define L4_BLOCK_75_BIT_17 (1UL << 17)
#define L4_BLOCK_75_BIT_18 (1UL << 18)
#define L4_BLOCK_75_BIT_19 (1UL << 19)
#define L4_BLOCK_75_BIT_20 (1UL << 20)
#define L4_BLOCK_75_BIT_21 (1UL << 21)
#define L4_BLOCK_75_BIT_22 (1UL << 22)
#define L4_BLOCK_75_BIT_23 (1UL << 23)
#define L4_BLOCK_75_BIT_24 (1UL << 24)
#define L4_BLOCK_75_BIT_25 (1UL << 25)
#define L4_BLOCK_75_BIT_26 (1UL << 26)
#define L4_BLOCK_75_BIT_27 (1UL << 27)
#define L4_BLOCK_75_BIT_28 (1UL << 28)
#define L4_BLOCK_75_BIT_29 (1UL << 29)
#define L4_BLOCK_75_BIT_30 (1UL << 30)
#define L4_BLOCK_75_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 76 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_76_TypeDef;
#define L4_BLOCK_76 ((L4_BLOCK_76_TypeDef *)(0x40008000UL + 76 * 0x400UL))

