RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_76_BIT_0 (1UL << 0)
#define L4_BLOCK_76_BIT_1 (1UL << 1)
#define L4_BLOCK_76_BIT_2 (1UL << 2)
#define L4_BLOCK_76_BIT_3 (1UL << 3)
#define L4_BLOCK_76_BIT_4 (1UL << 4)
#define L4_BLOCK_76_BIT_5 (1UL << 5)
#define L4_BLOCK_76_BIT_6 (1UL << 6)
#define L4_BLOCK_76_BIT_7 (1UL << 7)
#define L4_BLOCK_76_BIT_8 (1UL << 8)
#define L4_BLOCK_76_BIT_9 (1UL << 9)
#define L4_BLOCK_76_BIT_10 (1UL << 10)
#define L4_BLOCK_76_BIT_11 (1UL << 11)
#define L4_BLOCK_76_BIT_12 (1UL << 12)
#define L4_BLOCK_76_BIT_13 (1UL << 13)
#define L4_BLOCK_76_BIT_14 (1UL << 14)
#define L4_BLOCK_76_BIT_15 (1UL << 15)
#define L4_BLOCK_76_BIT_16 (1UL << 16)
#define L4_BLOCK_76_BIT_17 (1UL << 17)
#define L4_BLOCK_76_BIT_18 (1UL << 18)
#define L4_BLOCK_76_BIT_19 (1UL << 19)
#define L4_BLOCK_76_BIT_20 (1UL << 20)
#define L4_BLOCK_76_BIT_21 (1UL << 21)
#define L4_BLOCK_76_BIT_22 (1UL << 22)
#define L4_BLOCK_76_BIT_23 (1UL << 23)
#define L4_BLOCK_76_BIT_24 (1UL << 24)
#define L4_BLOCK_76_BIT_25 (1UL << 25)
#define L4_BLOCK_76_BIT_26 (1UL << 26)
#define L4_BLOCK_76_BIT_27 (1UL << 27)
#define L4_BLOCK_76_BIT_28 (1UL << 28)
#define L4_BLOCK_76_BIT_29 (1UL << 29)
#define L4_BLOCK_76_BIT_30 (1UL << 30)
#define L4_BLOCK_76_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 77 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_77_TypeDef;
#define L4_BLOCK_77 ((L4_BLOCK_77_TypeDef *)(0x40008000UL + 77 * 0x400UL))

#define L4_BLOCK_77_BIT_0 (1UL << 0)
#define L4_BLOCK_77_BIT_1 (1UL << 1)
#define L4_BLOCK_77_BIT_2 (1UL << 2)
#define L4_BLOCK_77_BIT_3 (1UL << 3)
#define L4_BLOCK_77_BIT_4 (1UL << 4)
#define L4_BLOCK_77_BIT_5 (1UL << 5)
#define L4_BLOCK_77_BIT_6 (1UL << 6)
#define L4_BLOCK_77_BIT_7 (1UL << 7)
#define L4_BLOCK_77_BIT_8 (1UL << 8)
#define L4_BLOCK_77_BIT_9 (1UL << 9)
#define L4_BLOCK_77_BIT_10 (1UL << 10)
#define L4_BLOCK_77_BIT_11 (1UL << 11)
#define L4_BLOCK_77_BIT_12 (1UL << 12)
#define L4_BLOCK_77_BIT_13 (1UL << 13)
#define L4_BLOCK_77_BIT_14 (1UL << 14)
#define L4_BLOCK_77_BIT_15 (1UL << 15)
#define L4_BLOCK_77_BIT_16 (1UL << 16)
#define L4_BLOCK_77_BIT_17 (1UL << 17)
#define L4_BLOCK_77_BIT_18 (1UL << 18)
#define L4_BLOCK_77_BIT_19 (1UL << 19)
#define L4_BLOCK_77_BIT_20 (1UL << 20)
#define L4_BLOCK_77_BIT_21 (1UL << 21)
#define L4_BLOCK_77_BIT_22 (1UL << 22)
#define L4_BLOCK_77_BIT_23 (1UL << 23)
#define L4_BLOCK_77_BIT_24 (1UL << 24)
#define L4_BLOCK_77_BIT_25 (1UL << 25)
#define L4_BLOCK_77_BIT_26 (1UL << 26)
#define L4_BLOCK_77_BIT_27 (1UL << 27)
#define L4_BLOCK_77_BIT_28 (1UL << 28)
#define L4_BLOCK_77_BIT_29 (1UL << 29)
#define L4_BLOCK_77_BIT_30 (1UL << 30)
#define L4_BLOCK_77_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 78 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_78_TypeDef;
#define L4_BLOCK_78 ((L4_BLOCK_78_TypeDef *)(0x40008000UL + 78 * 0x400UL))

#define L4_BLOCK_78_BIT_0 (1UL << 0)
#define L4_BLOCK_78_BIT_1 (1UL << 1)
#define L4_BLOCK_78_BIT_2 (1UL << 2)
#define L4_BLOCK_78_BIT_3 (1UL << 3)
#define L4_BLOCK_78_BIT_4 (1UL << 4)
#define L4_BLOCK_78_BIT_5 (1UL << 5)
#define L4_BLOCK_78_BIT_6 (1UL << 6)
#define L4_BLOCK_78_BIT_7 (1UL << 7)
#define L4_BLOCK_78_BIT_8 (1UL << 8)
#define L4_BLOCK_78_BIT_9 (1UL << 9)
#define L4_BLOCK_78_BIT_10 (1UL << 10)
#define L4_BLOCK_78_BIT_11 (1UL << 11)
#define L4_BLOCK_78_BIT_12 (1UL << 12)
#define L4_BLOCK_78_BIT_13 (1UL << 13)
#define L4_BLOCK_78_BIT_14 (1UL << 14)
#define L4_BLOCK_78_BIT_15 (1UL << 15)
#define L4_BLOCK_78_BIT_16 (1UL << 16)
#define L4_BLOCK_78_BIT_17 (1UL << 17)
#define L4_BLOCK_78_BIT_18 (1UL << 18)
#define L4_BLOCK_78_BIT_19 (1UL << 19)
#define L4_BLOCK_78_BIT_20 (1UL << 20)
#define L4_BLOCK_78_BIT_21 (1UL << 21)
#define L4_BLOCK_78_BIT_22 (1UL << 22)
#define L4_BLOCK_78_BIT_23 (1UL << 23)
#define L4_BLOCK_78_BIT_24 (1UL << 24)
#define L4_BLOCK_78_BIT_25 (1UL << 25)
#define L4_BLOCK_78_BIT_26 (1UL << 26)
#define L4_BLOCK_78_BIT_27 (1UL << 27)
#define L4_BLOCK_78_BIT_28 (1UL << 28)
#define L4_BLOCK_78_BIT_29 (1UL << 29)
#define L4_BLOCK_78_BIT_30 (1UL << 30)
#define L4_BLOCK_78_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 79 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_79_TypeDef;
#define L4_BLOCK_79 ((L4_BLOCK_79_TypeDef *)(0x40008000UL + 79 * 0x400UL))

#define L4_BLOCK_79_BIT_0 (1UL << 0)
#define L4_BLOCK_79_BIT_1 (1UL << 1)
#define L4_BLOCK_79_BIT_2 (1UL << 2)
#define L4_BLOCK_79_BIT_3 (1UL << 3)
#define L4_BLOCK_79_BIT_4 (1UL << 4)
#define L4_BLOCK_79_BIT_5 (1UL << 5)
#define L4_BLOCK_79_BIT_6 (1UL << 6)
#define L4_BLOCK_79_BIT_7 (1UL << 7)
#define L4_BLOCK_79_BIT_8 (1UL << 8)
#define L4_BLOCK_79_BIT_9 (1UL << 9)
#define L4_BLOCK_79_BIT_10 (1UL << 10)
#define L4_BLOCK_79_BIT_11 (1UL << 11)
#define L4_BLOCK_79_BIT_12 (1UL << 12)
#define L4_BLOCK_79_BIT_13 (1UL << 13)
#define L4_BLOCK_79_BIT_14 (1UL << 14)
#define L4_BLOCK_79_BIT_15 (1UL << 15)
#define L4_BLOCK_79_BIT_16 (1UL << 16)
#define L4_BLOCK_79_BIT_17 (1UL << 17)
#define L4_BLOCK_79_BIT_18 (1UL << 18)
#define L4_BLOCK_79_BIT_19 (1UL << 19)
#define L4_BLOCK_79_BIT_20 (1UL << 20)
#define L4_BLOCK_79_BIT_21 (1UL << 21)
#define L4_BLOCK_79_BIT_22 (1UL << 22)
#define L4_BLOCK_79_BIT_23 (1UL << 23)
#define L4_BLOCK_79_BIT_24 (1UL << 24)
#define L4_BLOCK_79_BIT_25 (1UL << 25)
#define L4_BLOCK_79_BIT_26 (1UL << 26)
#define L4_BLOCK_79_BIT_27 (1UL << 27)
#define L4_BLOCK_79_BIT_28 (1UL << 28)
#define L4_BLOCK_79_BIT_29 (1UL << 29)
#define L4_BLOCK_79_BIT_30 (1UL << 30)
#define L4_BLOCK_79_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 80 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_80_TypeDef;
#define L4_BLOCK_80 ((L4_BLOCK_80_TypeDef *)(0x40008000UL + 80 * 0x400UL))

#define L4_BLOCK_80_BIT_0 (1UL << 0)
#define L4_BLOCK_80_BIT_1 (1UL << 1)
#define L4_BLOCK_80_BIT_2 (1UL << 2)
#define L4_BLOCK_80_BIT_3 (1UL << 3)
#define L4_BLOCK_80_BIT_4 (1UL << 4)
#define L4_BLOCK_80_BIT_5 (1UL << 5)
#define L4_BLOCK_80_BIT_6 (1UL << 6)
#define L4_BLOCK_80_BIT_7 (1UL << 7)
#define L4_BLOCK_80_BIT_8 (1UL << 8)
#define L4_BLOCK_80_BIT_9 (1UL << 9)
#define L4_BLOCK_80_BIT_10 (1UL << 10)
#define L4_BLOCK_80_BIT_11 (1UL << 11)
#define L4_BLOCK_80_BIT_12 (1UL << 12)
#define L4_BLOCK_80_BIT_13 (1UL << 13)
#define L4_BLOCK_80_BIT_14 (1UL << 14)
#define L4_BLOCK_80_BIT_15 (1UL << 15)
#define L4_BLOCK_80_BIT_16 (1UL << 16)
#define L4_BLOCK_80_BIT_17 (1UL << 17)
#define L4_BLOCK_80_BIT_18 (1UL << 18)
#define L4_BLOCK_80_BIT_19 (1UL << 19)
#define L4_BLOCK_80_BIT_20 (1UL << 20)
#define L4_BLOCK_80_BIT_21 (1UL << 21)
#define L4_BLOCK_80_BIT_22 (1UL << 22)
#define L4_BLOCK_80_BIT_23 (1UL << 23)
#define L4_BLOCK_80_BIT_24 (1UL << 24)
#define L4_BLOCK_80_BIT_25 (1UL << 25)
#define L4_BLOCK_80_BIT_26 (1UL << 26)
#define L4_BLOCK_80_BIT_27 (1UL << 27)
#define L4_BLOCK_80_BIT_28 (1UL << 28)
#define L4_BLOCK_80_BIT_29 (1UL << 29)
#define L4_BLOCK_80_BIT_30 (1UL << 30)
#define L4_BLOCK_80_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 81 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_81_TypeDef;
#define L4_BLOCK_81 ((L4_BLOCK_81_TypeDef *)(0x40008000UL + 81 * 0x400UL))

#define L4_BLOCK_81_BIT_0 (1UL << 0)
#define L4_BLOCK_81_BIT_1 (1UL << 1)
#define L4_BLOCK_81_BIT_2 (1UL << 2)
#define L4_BLOCK_81_BIT_3 (1UL << 3)
#define L4_BLOCK_81_BIT_4 (1UL << 4)
#define L4_BLOCK_81_BIT_5 (1UL << 5)
#define L4_BLOCK_81_BIT_6 (1UL << 6)
#define L4_BLOCK_81_BIT_7 (1UL << 7)
#define L4_BLOCK_81_BIT_8 (1UL << 8)
#define L4_BLOCK_81_BIT_9 (1UL << 9)
#define L4_BLOCK_81_BIT_10 (1UL << 10)
#define L4_BLOCK_81_BIT_11 (1UL << 11)
#define L4_BLOCK_81_BIT_12 (1UL << 12)
#define L4_BLOCK_81_BIT_13 (1UL << 13)
#define L4_BLOCK_81_BIT_14 (1UL << 14)
#define L4_BLOCK_81_BIT_15 (1UL << 15)
#define L4_BLOCK_81_BIT_16 (1UL << 16)
#define L4_BLOCK_81_BIT_17 (1UL << 17)
#define L4_BLOCK_81_BIT_18 (1UL << 18)
#define L4_BLOCK_81_BIT_19 (1UL << 19)
#define L4_BLOCK_81_BIT_20 (1UL << 20)
#define L4_BLOCK_81_BIT_21 (1UL << 21)
#define L4_BLOCK_81_BIT_22 (1UL << 22)
#define L4_BLOCK_81_BIT_23 (1UL << 23)
#define L4_BLOCK_81_BIT_24 (1UL << 24)
#define L4_BLOCK_81_BIT_25 (1UL << 25)
#define L4_BLOCK_81_BIT_26 (1UL << 26)
#define L4_BLOCK_81_BIT_27 (1UL << 27)
#define L4_BLOCK_81_BIT_28 (1UL << 28)
#define L4_BLOCK_81_BIT_29 (1UL << 29)
#define L4_BLOCK_81_BIT_30 (1UL << 30)
#define L4_BLOCK_81_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 82 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_82_TypeDef;
#define L4_BLOCK_82 ((L4_BLOCK_82_TypeDef *)(0x40008000UL + 82 * 0x400UL))

