RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_82_BIT_0 (1UL << 0)
#define L4_BLOCK_82_BIT_1 (1UL << 1)
#define L4_BLOCK_82_BIT_2 (1UL << 2)
#define L4_BLOCK_82_BIT_3 (1UL << 3)
#define L4_BLOCK_82_BIT_4 (1UL << 4)
#define L4_BLOCK_82_BIT_5 (1UL << 5)
#define L4_BLOCK_82_BIT_6 (1UL << 6)
#define L4_BLOCK_82_BIT_7 (1UL << 7)
#define L4_BLOCK_82_BIT_8 (1UL << 8)
#define L4_BLOCK_82_BIT_9 (1UL << 9)
#define L4_BLOCK_82_BIT_10 (1UL << 10)
#define L4_BLOCK_82_BIT_11 (1UL << 11)
#define L4_BLOCK_82_BIT_12 (1UL << 12)
#define L4_BLOCK_82_BIT_13 (1UL << 13)
#define L4_BLOCK_82_BIT_14 (1UL << 14)
#define L4_BLOCK_82_BIT_15 (1UL << 15)
#define L4_BLOCK_82_BIT_16 (1UL << 16)
#define L4_BLOCK_82_BIT_17 (1UL << 17)
#define L4_BLOCK_82_BIT_18 (1UL << 18)
#define L4_BLOCK_82_BIT_19 (1UL << 19)
#define L4_BLOCK_82_BIT_20 (1UL << 20)
#define L4_BLOCK_82_BIT_21 (1UL << 21)
#define L4_BLOCK_82_BIT_22 (1UL << 22)
#define L4_BLOCK_82_BIT_23 (1UL << 23)
#define L4_BLOCK_82_BIT_24 (1UL << 24)
#define L4_BLOCK_82_BIT_25 (1UL << 25)
#define L4_BLOCK_82_BIT_26 (1UL << 26)
#define L4_BLOCK_82_BIT_27 (1UL << 27)
#define L4_BLOCK_82_BIT_28 (1UL << 28)
#define L4_BLOCK_82_BIT_29 (1UL << 29)
#define L4_BLOCK_82_BIT_30 (1UL << 30)
#define L4_BLOCK_82_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 83 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_83_TypeDef;
#define L4_BLOCK_83 ((L4_BLOCK_83_TypeDef *)(0x40008000UL + 83 * 0x400UL))

#define L4_BLOCK_83_BIT_0 (1UL << 0)
#define L4_BLOCK_83_BIT_1 (1UL << 1)
#define L4_BLOCK_83_BIT_2 (1UL << 2)
#define L4_BLOCK_83_BIT_3 (1UL << 3)
#define L4_BLOCK_83_BIT_4 (1UL << 4)
#define L4_BLOCK_83_BIT_5 (1UL << 5)
#define L4_BLOCK_83_BIT_6 (1UL << 6)
#define L4_BLOCK_83_BIT_7 (1UL << 7)
#define L4_BLOCK_83_BIT_8 (1UL << 8)
#define L4_BLOCK_83_BIT_9 (1UL << 9)
#define L4_BLOCK_83_BIT_10 (1UL << 10)
#define L4_BLOCK_83_BIT_11 (1UL << 11)
#define L4_BLOCK_83_BIT_12 (1UL << 12)
#define L4_BLOCK_83_BIT_13 (1UL << 13)
#define L4_BLOCK_83_BIT_14 (1UL << 14)
#define L4_BLOCK_83_BIT_15 (1UL << 15)
#define L4_BLOCK_83_BIT_16 (1UL << 16)
#define L4_BLOCK_83_BIT_17 (1UL << 17)
#define L4_BLOCK_83_BIT_18 (1UL << 18)
#define L4_BLOCK_83_BIT_19 (1UL << 19)
#define L4_BLOCK_83_BIT_20 (1UL << 20)
#define L4_BLOCK_83_BIT_21 (1UL << 21)
#define L4_BLOCK_83_BIT_22 (1UL << 22)
#define L4_BLOCK_83_BIT_23 (1UL << 23)
#define L4_BLOCK_83_BIT_24 (1UL << 24)
#define L4_BLOCK_83_BIT_25 (1UL << 25)
#define L4_BLOCK_83_BIT_26 (1UL << 26)
#define L4_BLOCK_83_BIT_27 (1UL << 27)
#define L4_BLOCK_83_BIT_28 (1UL << 28)
#define L4_BLOCK_83_BIT_29 (1UL << 29)
#define L4_BLOCK_83_BIT_30 (1UL << 30)
#define L4_BLOCK_83_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 84 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_84_TypeDef;
#define L4_BLOCK_84 ((L4_BLOCK_84_TypeDef *)(0x40008000UL + 84 * 0x400UL))

#define L4_BLOCK_84_BIT_0 (1UL << 0)
#define L4_BLOCK_84_BIT_1 (1UL << 1)
#define L4_BLOCK_84_BIT_2 (1UL << 2)
#define L4_BLOCK_84_BIT_3 (1UL << 3)
#define L4_BLOCK_84_BIT_4 (1UL << 4)
#define L4_BLOCK_84_BIT_5 (1UL << 5)
#define L4_BLOCK_84_BIT_6 (1UL << 6)
#define L4_BLOCK_84_BIT_7 (1UL << 7)
#define L4_BLOCK_84_BIT_8 (1UL << 8)
#define L4_BLOCK_84_BIT_9 (1UL << 9)
#define L4_BLOCK_84_BIT_10 (1UL << 10)
#define L4_BLOCK_84_BIT_11 (1UL << 11)
#define L4_BLOCK_84_BIT_12 (1UL << 12)
#define L4_BLOCK_84_BIT_13 (1UL << 13)
#define L4_BLOCK_84_BIT_14 (1UL << 14)
#define L4_BLOCK_84_BIT_15 (1UL << 15)
#define L4_BLOCK_84_BIT_16 (1UL << 16)
#define L4_BLOCK_84_BIT_17 (1UL << 17)
#define L4_BLOCK_84_BIT_18 (1UL << 18)
#define L4_BLOCK_84_BIT_19 (1UL << 19)
#define L4_BLOCK_84_BIT_20 (1UL << 20)
#define L4_BLOCK_84_BIT_21 (1UL << 21)
#define L4_BLOCK_84_BIT_22 (1UL << 22)
#define L4_BLOCK_84_BIT_23 (1UL << 23)
#define L4_BLOCK_84_BIT_24 (1UL << 24)
#define L4_BLOCK_84_BIT_25 (1UL << 25)
#define L4_BLOCK_84_BIT_26 (1UL << 26)
#define L4_BLOCK_84_BIT_27 (1UL << 27)
#define L4_BLOCK_84_BIT_28 (1UL << 28)
#define L4_BLOCK_84_BIT_29 (1UL << 29)
#define L4_BLOCK_84_BIT_30 (1UL << 30)
#define L4_BLOCK_84_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 85 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_85_TypeDef;
#define L4_BLOCK_85 ((L4_BLOCK_85_TypeDef *)(0x40008000UL + 85 * 0x400UL))

#define L4_BLOCK_85_BIT_0 (1UL << 0)
#define L4_BLOCK_85_BIT_1 (1UL << 1)
#define L4_BLOCK_85_BIT_2 (1UL << 2)
#define L4_BLOCK_85_BIT_3 (1UL << 3)
#define L4_BLOCK_85_BIT_4 (1UL << 4)
#define L4_BLOCK_85_BIT_5 (1UL << 5)
#define L4_BLOCK_85_BIT_6 (1UL << 6)
#define L4_BLOCK_85_BIT_7 (1UL << 7)
#define L4_BLOCK_85_BIT_8 (1UL << 8)
#define L4_BLOCK_85_BIT_9 (1UL << 9)
#define L4_BLOCK_85_BIT_10 (1UL << 10)
#define L4_BLOCK_85_BIT_11 (1UL << 11)
#define L4_BLOCK_85_BIT_12 (1UL << 12)
#define L4_BLOCK_85_BIT_13 (1UL << 13)
#define L4_BLOCK_85_BIT_14 (1UL << 14)
#define L4_BLOCK_85_BIT_15 (1UL << 15)
#define L4_BLOCK_85_BIT_16 (1UL << 16)
#define L4_BLOCK_85_BIT_17 (1UL << 17)
#define L4_BLOCK_85_BIT_18 (1UL << 18)
#define L4_BLOCK_85_BIT_19 (1UL << 19)
#define L4_BLOCK_85_BIT_20 (1UL << 20)
#define L4_BLOCK_85_BIT_21 (1UL << 21)
#define L4_BLOCK_85_BIT_22 (1UL << 22)
#define L4_BLOCK_85_BIT_23 (1UL << 23)
#define L4_BLOCK_85_BIT_24 (1UL << 24)
#define L4_BLOCK_85_BIT_25 (1UL << 25)
#define L4_BLOCK_85_BIT_26 (1UL << 26)
#define L4_BLOCK_85_BIT_27 (1UL << 27)
#define L4_BLOCK_85_BIT_28 (1UL << 28)
#define L4_BLOCK_85_BIT_29 (1UL << 29)
#define L4_BLOCK_85_BIT_30 (1UL << 30)
#define L4_BLOCK_85_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 86 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_86_TypeDef;
#define L4_BLOCK_86 ((L4_BLOCK_86_TypeDef *)(0x40008000UL + 86 * 0x400UL))

#define L4_BLOCK_86_BIT_0 (1UL << 0)
#define L4_BLOCK_86_BIT_1 (1UL << 1)
#define L4_BLOCK_86_BIT_2 (1UL << 2)
#define L4_BLOCK_86_BIT_3 (1UL << 3)
#define L4_BLOCK_86_BIT_4 (1UL << 4)
#define L4_BLOCK_86_BIT_5 (1UL << 5)
#define L4_BLOCK_86_BIT_6 (1UL << 6)
#define L4_BLOCK_86_BIT_7 (1UL << 7)
#define L4_BLOCK_86_BIT_8 (1UL << 8)
#define L4_BLOCK_86_BIT_9 (1UL << 9)
#define L4_BLOCK_86_BIT_10 (1UL << 10)
#define L4_BLOCK_86_BIT_11 (1UL << 11)
#define L4_BLOCK_86_BIT_12 (1UL << 12)
#define L4_BLOCK_86_BIT_13 (1UL << 13)
#define L4_BLOCK_86_BIT_14 (1UL << 14)
#define L4_BLOCK_86_BIT_15 (1UL << 15)
#define L4_BLOCK_86_BIT_16 (1UL << 16)
#define L4_BLOCK_86_BIT_17 (1UL << 17)
#define L4_BLOCK_86_BIT_18 (1UL << 18)
#define L4_BLOCK_86_BIT_19 (1UL << 19)
#define L4_BLOCK_86_BIT_20 (1UL << 20)
#define L4_BLOCK_86_BIT_21 (1UL << 21)
#define L4_BLOCK_86_BIT_22 (1UL << 22)
#define L4_BLOCK_86_BIT_23 (1UL << 23)
#define L4_BLOCK_86_BIT_24 (1UL << 24)
#define L4_BLOCK_86_BIT_25 (1UL << 25)
#define L4_BLOCK_86_BIT_26 (1UL << 26)
#define L4_BLOCK_86_BIT_27 (1UL << 27)
#define L4_BLOCK_86_BIT_28 (1UL << 28)
#define L4_BLOCK_86_BIT_29 (1UL << 29)
#define L4_BLOCK_86_BIT_30 (1UL << 30)
#define L4_BLOCK_86_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 87 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_87_TypeDef;
#define L4_BLOCK_87 ((L4_BLOCK_87_TypeDef *)(0x40008000UL + 87 * 0x400UL))

#define L4_BLOCK_87_BIT_0 (1UL << 0)
#define L4_BLOCK_87_BIT_1 (1UL << 1)
#define L4_BLOCK_87_BIT_2 (1UL << 2)
#define L4_BLOCK_87_BIT_3 (1UL << 3)
#define L4_BLOCK_87_BIT_4 (1UL << 4)
#define L4_BLOCK_87_BIT_5 (1UL << 5)
#define L4_BLOCK_87_BIT_6 (1UL << 6)
#define L4_BLOCK_87_BIT_7 (1UL << 7)
#define L4_BLOCK_87_BIT_8 (1UL << 8)
#define L4_BLOCK_87_BIT_9 (1UL << 9)
#define L4_BLOCK_87_BIT_10 (1UL << 10)
#define L4_BLOCK_87_BIT_11 (1UL << 11)
#define L4_BLOCK_87_BIT_12 (1UL << 12)
#define L4_BLOCK_87_BIT_13 (1UL << 13)
#define L4_BLOCK_87_BIT_14 (1UL << 14)
#define L4_BLOCK_87_BIT_15 (1UL << 15)
#define L4_BLOCK_87_BIT_16 (1UL << 16)
#define L4_BLOCK_87_BIT_17 (1UL << 17)
#define L4_BLOCK_87_BIT_18 (1UL << 18)
#define L4_BLOCK_87_BIT_19 (1UL << 19)
#define L4_BLOCK_87_BIT_20 (1UL << 20)
#define L4_BLOCK_87_BIT_21 (1UL << 21)
#define L4_BLOCK_87_BIT_22 (1UL << 22)
#define L4_BLOCK_87_BIT_23 (1UL << 23)
#define L4_BLOCK_87_BIT_24 (1UL << 24)
#define L4_BLOCK_87_BIT_25 (1UL << 25)
#define L4_BLOCK_87_BIT_26 (1UL << 26)
#define L4_BLOCK_87_BIT_27 (1UL << 27)
#define L4_BLOCK_87_BIT_28 (1UL << 28)
#define L4_BLOCK_87_BIT_29 (1UL << 29)
#define L4_BLOCK_87_BIT_30 (1UL << 30)
#define L4_BLOCK_87_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 88 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_88_TypeDef;
#define L4_BLOCK_88 ((L4_BLOCK_88_TypeDef *)(0x40008000UL + 88 * 0x400UL))

#define L4_BLOCK_88_BIT_0 (1UL << 0)
#define L4_BLOCK_88_BIT_1 (1UL << 1)
#define L4_BLOCK_88_BIT_2 (1UL << 2)
#define L4_BLOCK_88_BIT_3 (1UL << 3)
#define L4_BLOCK_88_BIT_4 (1UL << 4)
#define L4_BLOCK_88_BIT_5 (1UL << 5)
#define L4_BLOCK_88_BIT_6 (1UL << 6)
#define L4_BLOCK_88_BIT_7 (1UL << 7)
#define L4_BLOCK_88_BIT_8 (1UL << 8)
#define L4_BLOCK_88_BIT_9 (1UL << 9)
#define L4_BLOCK_88_BIT_10 (1UL << 10)
#define L4_BLOCK_88_BIT_11 (1UL << 11)
#define L4_BLOCK_88_BIT_12 (1UL << 12)
#define L4_BLOCK_88_BIT_13 (1UL << 13)
#define L4_BLOCK_88_BIT_14 (1UL << 14)
#define L4_BLOCK_88_BIT_15 (1UL << 15)
#define L4_BLOCK_88_BIT_16 (1UL << 16)
#define L4_BLOCK_88_BIT_17 (1UL << 17)
#define L4_BLOCK_88_BIT_18 (1UL << 18)
#define L4_BLOCK_88_BIT_19 (1UL << 19)
#define L4_BLOCK_88_BIT_20 (1UL << 20)
#define L4_BLOCK_88_BIT_21 (1UL << 21)
#define L4_BLOCK_88_BIT_22 (1UL << 22)
#define L4_BLOCK_88_BIT_23 (1UL << 23)
#define L4_BLOCK_88_BIT_24 (1UL << 24)
#define L4_BLOCK_88_BIT_25 (1UL << 25)
#define L4_BLOCK_88_BIT_26 (1UL << 26)
#define L4_BLOCK_88_BIT_27 (1UL << 27)
#define L4_BLOCK_88_BIT_28 (1UL << 28)
#define L4_BLOCK_88_BIT_29 (1UL << 29)
#define L4_BLOCK_88_BIT_30 (1UL << 30)
#define L4_BLOCK_88_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 89 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_89_TypeDef;
#define L4_BLOCK_89 ((L4_BLOCK_89_TypeDef *)(0x40008000UL + 89 * 0x400UL))

#define L4_BLOCK_89_BIT_0 (1UL << 0)
#define L4_BLOCK_89_BIT_1 (1UL << 1)
#define L4_BLOCK_89_BIT_2 (1UL << 2)
#define L4_BLOCK_89_BIT_3 (1UL << 3)
#define L4_BLOCK_89_BIT_4 (1UL << 4)
#define L4_BLOCK_89_BIT_5 (1UL << 5)
#define L4_BLOCK_89_BIT_6 (1UL << 6)
#define L4_BLOCK_89_BIT_7 (1UL << 7)
#define L4_BLOCK_89_BIT_8 (1UL << 8)
#define L4_BLOCK_89_BIT_9 (1UL << 9)
#define L4_BLOCK_89_BIT_10 (1UL << 10)
#define L4_BLOCK_89_BIT_11 (1UL << 11)
#define L4_BLOCK_89_BIT_12 (1UL << 12)
#define L4_BLOCK_89_BIT_13 (1UL << 13)
#define L4_BLOCK_89_BIT_14 (1UL << 14)
#define L4_BLOCK_89_BIT_15 (1UL << 15)
#define L4_BLOCK_89_BIT_16 (1UL << 16)
#define L4_BLOCK_89_BIT_17 (1UL << 17)
#define L4_BLOCK_89_BIT_18 (1UL << 18)
#define L4_BLOCK_89_BIT_19 (1UL << 19)
#define L4_BLOCK_89_BIT_20 (1UL << 20)
#define L4_BLOCK_89_BIT_21 (1UL << 21)
#define L4_BLOCK_89_BIT_22 (1UL << 22)
#define L4_BLOCK_89_BIT_23 (1UL << 23)
#define L4_BLOCK_89_BIT_24 (1UL << 24)
#define L4_BLOCK_89_BIT_25 (1UL << 25)
#define L4_BLOCK_89_BIT_26 (1UL << 26)
#define L4_BLOCK_89_BIT_27 (1UL << 27)
#define L4_BLOCK_89_BIT_28 (1UL << 28)
#define L4_BLOCK_89_BIT_29 (1UL << 29)
#define L4_BLOCK_89_BIT_30 (1UL << 30)
#define L4_BLOCK_89_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 90 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_90_TypeDef;
#define L4_BLOCK_90 ((L4_BLOCK_90_TypeDef *)(0x40008000UL + 90 * 0x400UL))

#define L4_BLOCK_90_BIT_0 (1UL << 0)
#define L4_BLOCK_90_BIT_1 (1UL << 1)
#define L4_BLOCK_90_BIT_2 (1UL << 2)
#define L4_BLOCK_90_BIT_3 (1UL << 3)
#define L4_BLOCK_90_BIT_4 (1UL << 4)
#define L4_BLOCK_90_BIT_5 (1UL << 5)
#define L4_BLOCK_90_BIT_6 (1UL << 6)
#define L4_BLOCK_90_BIT_7 (1UL << 7)
#define L4_BLOCK_90_BIT_8 (1UL << 8)
#define L4_BLOCK_90_BIT_9 (1UL << 9)
#define L4_BLOCK_90_BIT_10 (1UL << 10)
#define L4_BLOCK_90_BIT_11 (1UL << 11)
#define L4_BLOCK_90_BIT_12 (1UL << 12)
#define L4_BLOCK_90_BIT_13 (1UL << 13)
#define L4_BLOCK_90_BIT_14 (1UL << 14)
#define L4_BLOCK_90_BIT_15 (1UL << 15)
#define L4_BLOCK_90_BIT_16 (1UL << 16)
#define L4_BLOCK_90_BIT_17 (1UL << 17)
#define L4_BLOCK_90_BIT_18 (1UL << 18)
#define L4_BLOCK_90_BIT_19 (1UL << 19)
#define L4_BLOCK_90_BIT_20 (1UL << 20)
#define L4_BLOCK_90_BIT_21 (1UL << 21)
#define L4_BLOCK_90_BIT_22 (1UL << 22)
#define L4_BLOCK_90_BIT_23 (1UL << 23)
#define L4_BLOCK_90_BIT_24 (1UL << 24)
#define L4_BLOCK_90_BIT_25 (1UL << 25)
#define L4_BLOCK_90_BIT_26 (1UL << 26)
#define L4_BLOCK_90_BIT_27 (1UL << 27)
#define L4_BLOCK_90_BIT_28 (1UL << 28)
#define L4_BLOCK_90_BIT_29 (1UL << 29)
#define L4_BLOCK_90_BIT_30 (1UL << 30)
#define L4_BLOCK_90_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 91 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_91_TypeDef;
#define L4_BLOCK_91 ((L4_BLOCK_91_TypeDef *)(0x40008000UL + 91 * 0x400UL))

#define L4_BLOCK_91_BIT_0 (1UL << 0)
#define L4_BLOCK_91_BIT_1 (1UL << 1)
#define L4_BLOCK_91_BIT_2 (1UL << 2)
#define L4_BLOCK_91_BIT_3 (1UL << 3)
#define L4_BLOCK_91_BIT_4 (1UL << 4)
#define L4_BLOCK_91_BIT_5 (1UL << 5)
#define L4_BLOCK_91_BIT_6 (1UL << 6)
#define L4_BLOCK_91_BIT_7 (1UL << 7)
#define L4_BLOCK_91_BIT_8 (1UL << 8)
#define L4_BLOCK_91_BIT_9 (1UL << 9)
#define L4_BLOCK_91_BIT_10 (1UL << 10)
#define L4_BLOCK_91_BIT_11 (1UL << 11)
#define L4_BLOCK_91_BIT_12 (1UL << 12)
#define L4_BLOCK_91_BIT_13 (1UL << 13)
#define L4_BLOCK_91_BIT_14 (1UL << 14)
#define L4_BLOCK_91_BIT_15 (1UL << 15)
#define L4_BLOCK_91_BIT_16 (1UL << 16)
#define L4_BLOCK_91_BIT_17 (1UL << 17)
#define L4_BLOCK_91_BIT_18 (1UL << 18)
#define L4_BLOCK_91_BIT_19 (1UL << 19)
#define L4_BLOCK_91_BIT_20 (1UL << 20)
#define L4_BLOCK_91_BIT_21 (1UL << 21)
#define L4_BLOCK_91_BIT_22 (1UL << 22)
#define L4_BLOCK_91_BIT_23 (1UL << 23)
#define L4_BLOCK_91_BIT_24 (1UL << 24)
#define L4_BLOCK_91_BIT_25 (1UL << 25)
#define L4_BLOCK_91_BIT_26 (1UL << 26)
#define L4_BLOCK_91_BIT_27 (1UL << 27)
#define L4_BLOCK_91_BIT_28 (1UL << 28)
#define L4_BLOCK_91_BIT_29 (1UL << 29)
#define L4_BLOCK_91_BIT_30 (1UL << 30)
#define L4_BLOCK_91_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 92 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_92_TypeDef;
#define L4_BLOCK_92 ((L4_BLOCK_92_TypeDef *)(0x40008000UL + 92 * 0x400UL))

