RohithSai4518/Embeded_Systems/include/registers/reg_stm32l4xx.h
#define L4_BLOCK_92_BIT_0 (1UL << 0)
#define L4_BLOCK_92_BIT_1 (1UL << 1)
#define L4_BLOCK_92_BIT_2 (1UL << 2)
#define L4_BLOCK_92_BIT_3 (1UL << 3)
#define L4_BLOCK_92_BIT_4 (1UL << 4)
#define L4_BLOCK_92_BIT_5 (1UL << 5)
#define L4_BLOCK_92_BIT_6 (1UL << 6)
#define L4_BLOCK_92_BIT_7 (1UL << 7)
#define L4_BLOCK_92_BIT_8 (1UL << 8)
#define L4_BLOCK_92_BIT_9 (1UL << 9)
#define L4_BLOCK_92_BIT_10 (1UL << 10)
#define L4_BLOCK_92_BIT_11 (1UL << 11)
#define L4_BLOCK_92_BIT_12 (1UL << 12)
#define L4_BLOCK_92_BIT_13 (1UL << 13)
#define L4_BLOCK_92_BIT_14 (1UL << 14)
#define L4_BLOCK_92_BIT_15 (1UL << 15)
#define L4_BLOCK_92_BIT_16 (1UL << 16)
#define L4_BLOCK_92_BIT_17 (1UL << 17)
#define L4_BLOCK_92_BIT_18 (1UL << 18)
#define L4_BLOCK_92_BIT_19 (1UL << 19)
#define L4_BLOCK_92_BIT_20 (1UL << 20)
#define L4_BLOCK_92_BIT_21 (1UL << 21)
#define L4_BLOCK_92_BIT_22 (1UL << 22)
#define L4_BLOCK_92_BIT_23 (1UL << 23)
#define L4_BLOCK_92_BIT_24 (1UL << 24)
#define L4_BLOCK_92_BIT_25 (1UL << 25)
#define L4_BLOCK_92_BIT_26 (1UL << 26)
#define L4_BLOCK_92_BIT_27 (1UL << 27)
#define L4_BLOCK_92_BIT_28 (1UL << 28)
#define L4_BLOCK_92_BIT_29 (1UL << 29)
#define L4_BLOCK_92_BIT_30 (1UL << 30)
#define L4_BLOCK_92_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 93 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_93_TypeDef;
#define L4_BLOCK_93 ((L4_BLOCK_93_TypeDef *)(0x40008000UL + 93 * 0x400UL))

#define L4_BLOCK_93_BIT_0 (1UL << 0)
#define L4_BLOCK_93_BIT_1 (1UL << 1)
#define L4_BLOCK_93_BIT_2 (1UL << 2)
#define L4_BLOCK_93_BIT_3 (1UL << 3)
#define L4_BLOCK_93_BIT_4 (1UL << 4)
#define L4_BLOCK_93_BIT_5 (1UL << 5)
#define L4_BLOCK_93_BIT_6 (1UL << 6)
#define L4_BLOCK_93_BIT_7 (1UL << 7)
#define L4_BLOCK_93_BIT_8 (1UL << 8)
#define L4_BLOCK_93_BIT_9 (1UL << 9)
#define L4_BLOCK_93_BIT_10 (1UL << 10)
#define L4_BLOCK_93_BIT_11 (1UL << 11)
#define L4_BLOCK_93_BIT_12 (1UL << 12)
#define L4_BLOCK_93_BIT_13 (1UL << 13)
#define L4_BLOCK_93_BIT_14 (1UL << 14)
#define L4_BLOCK_93_BIT_15 (1UL << 15)
#define L4_BLOCK_93_BIT_16 (1UL << 16)
#define L4_BLOCK_93_BIT_17 (1UL << 17)
#define L4_BLOCK_93_BIT_18 (1UL << 18)
#define L4_BLOCK_93_BIT_19 (1UL << 19)
#define L4_BLOCK_93_BIT_20 (1UL << 20)
#define L4_BLOCK_93_BIT_21 (1UL << 21)
#define L4_BLOCK_93_BIT_22 (1UL << 22)
#define L4_BLOCK_93_BIT_23 (1UL << 23)
#define L4_BLOCK_93_BIT_24 (1UL << 24)
#define L4_BLOCK_93_BIT_25 (1UL << 25)
#define L4_BLOCK_93_BIT_26 (1UL << 26)
#define L4_BLOCK_93_BIT_27 (1UL << 27)
#define L4_BLOCK_93_BIT_28 (1UL << 28)
#define L4_BLOCK_93_BIT_29 (1UL << 29)
#define L4_BLOCK_93_BIT_30 (1UL << 30)
#define L4_BLOCK_93_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 94 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_94_TypeDef;
#define L4_BLOCK_94 ((L4_BLOCK_94_TypeDef *)(0x40008000UL + 94 * 0x400UL))

#define L4_BLOCK_94_BIT_0 (1UL << 0)
#define L4_BLOCK_94_BIT_1 (1UL << 1)
#define L4_BLOCK_94_BIT_2 (1UL << 2)
#define L4_BLOCK_94_BIT_3 (1UL << 3)
#define L4_BLOCK_94_BIT_4 (1UL << 4)
#define L4_BLOCK_94_BIT_5 (1UL << 5)
#define L4_BLOCK_94_BIT_6 (1UL << 6)
#define L4_BLOCK_94_BIT_7 (1UL << 7)
#define L4_BLOCK_94_BIT_8 (1UL << 8)
#define L4_BLOCK_94_BIT_9 (1UL << 9)
#define L4_BLOCK_94_BIT_10 (1UL << 10)
#define L4_BLOCK_94_BIT_11 (1UL << 11)
#define L4_BLOCK_94_BIT_12 (1UL << 12)
#define L4_BLOCK_94_BIT_13 (1UL << 13)
#define L4_BLOCK_94_BIT_14 (1UL << 14)
#define L4_BLOCK_94_BIT_15 (1UL << 15)
#define L4_BLOCK_94_BIT_16 (1UL << 16)
#define L4_BLOCK_94_BIT_17 (1UL << 17)
#define L4_BLOCK_94_BIT_18 (1UL << 18)
#define L4_BLOCK_94_BIT_19 (1UL << 19)
#define L4_BLOCK_94_BIT_20 (1UL << 20)
#define L4_BLOCK_94_BIT_21 (1UL << 21)
#define L4_BLOCK_94_BIT_22 (1UL << 22)
#define L4_BLOCK_94_BIT_23 (1UL << 23)
#define L4_BLOCK_94_BIT_24 (1UL << 24)
#define L4_BLOCK_94_BIT_25 (1UL << 25)
#define L4_BLOCK_94_BIT_26 (1UL << 26)
#define L4_BLOCK_94_BIT_27 (1UL << 27)
#define L4_BLOCK_94_BIT_28 (1UL << 28)
#define L4_BLOCK_94_BIT_29 (1UL << 29)
#define L4_BLOCK_94_BIT_30 (1UL << 30)
#define L4_BLOCK_94_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 95 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_95_TypeDef;
#define L4_BLOCK_95 ((L4_BLOCK_95_TypeDef *)(0x40008000UL + 95 * 0x400UL))

#define L4_BLOCK_95_BIT_0 (1UL << 0)
#define L4_BLOCK_95_BIT_1 (1UL << 1)
#define L4_BLOCK_95_BIT_2 (1UL << 2)
#define L4_BLOCK_95_BIT_3 (1UL << 3)
#define L4_BLOCK_95_BIT_4 (1UL << 4)
#define L4_BLOCK_95_BIT_5 (1UL << 5)
#define L4_BLOCK_95_BIT_6 (1UL << 6)
#define L4_BLOCK_95_BIT_7 (1UL << 7)
#define L4_BLOCK_95_BIT_8 (1UL << 8)
#define L4_BLOCK_95_BIT_9 (1UL << 9)
#define L4_BLOCK_95_BIT_10 (1UL << 10)
#define L4_BLOCK_95_BIT_11 (1UL << 11)
#define L4_BLOCK_95_BIT_12 (1UL << 12)
#define L4_BLOCK_95_BIT_13 (1UL << 13)
#define L4_BLOCK_95_BIT_14 (1UL << 14)
#define L4_BLOCK_95_BIT_15 (1UL << 15)
#define L4_BLOCK_95_BIT_16 (1UL << 16)
#define L4_BLOCK_95_BIT_17 (1UL << 17)
#define L4_BLOCK_95_BIT_18 (1UL << 18)
#define L4_BLOCK_95_BIT_19 (1UL << 19)
#define L4_BLOCK_95_BIT_20 (1UL << 20)
#define L4_BLOCK_95_BIT_21 (1UL << 21)
#define L4_BLOCK_95_BIT_22 (1UL << 22)
#define L4_BLOCK_95_BIT_23 (1UL << 23)
#define L4_BLOCK_95_BIT_24 (1UL << 24)
#define L4_BLOCK_95_BIT_25 (1UL << 25)
#define L4_BLOCK_95_BIT_26 (1UL << 26)
#define L4_BLOCK_95_BIT_27 (1UL << 27)
#define L4_BLOCK_95_BIT_28 (1UL << 28)
#define L4_BLOCK_95_BIT_29 (1UL << 29)
#define L4_BLOCK_95_BIT_30 (1UL << 30)
#define L4_BLOCK_95_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 96 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_96_TypeDef;
#define L4_BLOCK_96 ((L4_BLOCK_96_TypeDef *)(0x40008000UL + 96 * 0x400UL))

#define L4_BLOCK_96_BIT_0 (1UL << 0)
#define L4_BLOCK_96_BIT_1 (1UL << 1)
#define L4_BLOCK_96_BIT_2 (1UL << 2)
#define L4_BLOCK_96_BIT_3 (1UL << 3)
#define L4_BLOCK_96_BIT_4 (1UL << 4)
#define L4_BLOCK_96_BIT_5 (1UL << 5)
#define L4_BLOCK_96_BIT_6 (1UL << 6)
#define L4_BLOCK_96_BIT_7 (1UL << 7)
#define L4_BLOCK_96_BIT_8 (1UL << 8)
#define L4_BLOCK_96_BIT_9 (1UL << 9)
#define L4_BLOCK_96_BIT_10 (1UL << 10)
#define L4_BLOCK_96_BIT_11 (1UL << 11)
#define L4_BLOCK_96_BIT_12 (1UL << 12)
#define L4_BLOCK_96_BIT_13 (1UL << 13)
#define L4_BLOCK_96_BIT_14 (1UL << 14)
#define L4_BLOCK_96_BIT_15 (1UL << 15)
#define L4_BLOCK_96_BIT_16 (1UL << 16)
#define L4_BLOCK_96_BIT_17 (1UL << 17)
#define L4_BLOCK_96_BIT_18 (1UL << 18)
#define L4_BLOCK_96_BIT_19 (1UL << 19)
#define L4_BLOCK_96_BIT_20 (1UL << 20)
#define L4_BLOCK_96_BIT_21 (1UL << 21)
#define L4_BLOCK_96_BIT_22 (1UL << 22)
#define L4_BLOCK_96_BIT_23 (1UL << 23)
#define L4_BLOCK_96_BIT_24 (1UL << 24)
#define L4_BLOCK_96_BIT_25 (1UL << 25)
#define L4_BLOCK_96_BIT_26 (1UL << 26)
#define L4_BLOCK_96_BIT_27 (1UL << 27)
#define L4_BLOCK_96_BIT_28 (1UL << 28)
#define L4_BLOCK_96_BIT_29 (1UL << 29)
#define L4_BLOCK_96_BIT_30 (1UL << 30)
#define L4_BLOCK_96_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 97 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_97_TypeDef;
#define L4_BLOCK_97 ((L4_BLOCK_97_TypeDef *)(0x40008000UL + 97 * 0x400UL))

#define L4_BLOCK_97_BIT_0 (1UL << 0)
#define L4_BLOCK_97_BIT_1 (1UL << 1)
#define L4_BLOCK_97_BIT_2 (1UL << 2)
#define L4_BLOCK_97_BIT_3 (1UL << 3)
#define L4_BLOCK_97_BIT_4 (1UL << 4)
#define L4_BLOCK_97_BIT_5 (1UL << 5)
#define L4_BLOCK_97_BIT_6 (1UL << 6)
#define L4_BLOCK_97_BIT_7 (1UL << 7)
#define L4_BLOCK_97_BIT_8 (1UL << 8)
#define L4_BLOCK_97_BIT_9 (1UL << 9)
#define L4_BLOCK_97_BIT_10 (1UL << 10)
#define L4_BLOCK_97_BIT_11 (1UL << 11)
#define L4_BLOCK_97_BIT_12 (1UL << 12)
#define L4_BLOCK_97_BIT_13 (1UL << 13)
#define L4_BLOCK_97_BIT_14 (1UL << 14)
#define L4_BLOCK_97_BIT_15 (1UL << 15)
#define L4_BLOCK_97_BIT_16 (1UL << 16)
#define L4_BLOCK_97_BIT_17 (1UL << 17)
#define L4_BLOCK_97_BIT_18 (1UL << 18)
#define L4_BLOCK_97_BIT_19 (1UL << 19)
#define L4_BLOCK_97_BIT_20 (1UL << 20)
#define L4_BLOCK_97_BIT_21 (1UL << 21)
#define L4_BLOCK_97_BIT_22 (1UL << 22)
#define L4_BLOCK_97_BIT_23 (1UL << 23)
#define L4_BLOCK_97_BIT_24 (1UL << 24)
#define L4_BLOCK_97_BIT_25 (1UL << 25)
#define L4_BLOCK_97_BIT_26 (1UL << 26)
#define L4_BLOCK_97_BIT_27 (1UL << 27)
#define L4_BLOCK_97_BIT_28 (1UL << 28)
#define L4_BLOCK_97_BIT_29 (1UL << 29)
#define L4_BLOCK_97_BIT_30 (1UL << 30)
#define L4_BLOCK_97_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 98 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_98_TypeDef;
#define L4_BLOCK_98 ((L4_BLOCK_98_TypeDef *)(0x40008000UL + 98 * 0x400UL))

#define L4_BLOCK_98_BIT_0 (1UL << 0)
#define L4_BLOCK_98_BIT_1 (1UL << 1)
#define L4_BLOCK_98_BIT_2 (1UL << 2)
#define L4_BLOCK_98_BIT_3 (1UL << 3)
#define L4_BLOCK_98_BIT_4 (1UL << 4)
#define L4_BLOCK_98_BIT_5 (1UL << 5)
#define L4_BLOCK_98_BIT_6 (1UL << 6)
#define L4_BLOCK_98_BIT_7 (1UL << 7)
#define L4_BLOCK_98_BIT_8 (1UL << 8)
#define L4_BLOCK_98_BIT_9 (1UL << 9)
#define L4_BLOCK_98_BIT_10 (1UL << 10)
#define L4_BLOCK_98_BIT_11 (1UL << 11)
#define L4_BLOCK_98_BIT_12 (1UL << 12)
#define L4_BLOCK_98_BIT_13 (1UL << 13)
#define L4_BLOCK_98_BIT_14 (1UL << 14)
#define L4_BLOCK_98_BIT_15 (1UL << 15)
#define L4_BLOCK_98_BIT_16 (1UL << 16)
#define L4_BLOCK_98_BIT_17 (1UL << 17)
#define L4_BLOCK_98_BIT_18 (1UL << 18)
#define L4_BLOCK_98_BIT_19 (1UL << 19)
#define L4_BLOCK_98_BIT_20 (1UL << 20)
#define L4_BLOCK_98_BIT_21 (1UL << 21)
#define L4_BLOCK_98_BIT_22 (1UL << 22)
#define L4_BLOCK_98_BIT_23 (1UL << 23)
#define L4_BLOCK_98_BIT_24 (1UL << 24)
#define L4_BLOCK_98_BIT_25 (1UL << 25)
#define L4_BLOCK_98_BIT_26 (1UL << 26)
#define L4_BLOCK_98_BIT_27 (1UL << 27)
#define L4_BLOCK_98_BIT_28 (1UL << 28)
#define L4_BLOCK_98_BIT_29 (1UL << 29)
#define L4_BLOCK_98_BIT_30 (1UL << 30)
#define L4_BLOCK_98_BIT_31 (1UL << 31)
/* STM32L4 Low Power Block 99 */
typedef struct { volatile uint32_t CR1, CR2, CR3, SR, ICR, DHR, LPTIM_CFGR, LPTIM_ISR; } L4_BLOCK_99_TypeDef;
#define L4_BLOCK_99 ((L4_BLOCK_99_TypeDef *)(0x40008000UL + 99 * 0x400UL))

#define L4_BLOCK_99_BIT_0 (1UL << 0)
#define L4_BLOCK_99_BIT_1 (1UL << 1)
#define L4_BLOCK_99_BIT_2 (1UL << 2)
#define L4_BLOCK_99_BIT_3 (1UL << 3)
#define L4_BLOCK_99_BIT_4 (1UL << 4)
#define L4_BLOCK_99_BIT_5 (1UL << 5)
#define L4_BLOCK_99_BIT_6 (1UL << 6)
#define L4_BLOCK_99_BIT_7 (1UL << 7)
#define L4_BLOCK_99_BIT_8 (1UL << 8)
#define L4_BLOCK_99_BIT_9 (1UL << 9)
#define L4_BLOCK_99_BIT_10 (1UL << 10)
#define L4_BLOCK_99_BIT_11 (1UL << 11)
#define L4_BLOCK_99_BIT_12 (1UL << 12)
#define L4_BLOCK_99_BIT_13 (1UL << 13)
#define L4_BLOCK_99_BIT_14 (1UL << 14)
#define L4_BLOCK_99_BIT_15 (1UL << 15)
#define L4_BLOCK_99_BIT_16 (1UL << 16)
#define L4_BLOCK_99_BIT_17 (1UL << 17)
#define L4_BLOCK_99_BIT_18 (1UL << 18)
#define L4_BLOCK_99_BIT_19 (1UL << 19)
#define L4_BLOCK_99_BIT_20 (1UL << 20)
#define L4_BLOCK_99_BIT_21 (1UL << 21)
#define L4_BLOCK_99_BIT_22 (1UL << 22)
#define L4_BLOCK_99_BIT_23 (1UL << 23)
#define L4_BLOCK_99_BIT_24 (1UL << 24)
#define L4_BLOCK_99_BIT_25 (1UL << 25)
#define L4_BLOCK_99_BIT_26 (1UL << 26)
#define L4_BLOCK_99_BIT_27 (1UL << 27)
#define L4_BLOCK_99_BIT_28 (1UL << 28)
#define L4_BLOCK_99_BIT_29 (1UL << 29)
#define L4_BLOCK_99_BIT_30 (1UL << 30)
#define L4_BLOCK_99_BIT_31 (1UL << 31)
#ifdef __cplusplus
}
#endif
#endif
